export default [
  {
    'code': 'TMB50',
    'name_th': 'กองทุนเปิดทหารไทย SET50'
  },
  {
    'code': 'ABG',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด โกรท'
  },
  {
    'code': 'ABLTF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด หุ้นระยะยาว'
  },
  {
    'code': 'ABSL',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด สยาม ลีดเดอร์ส'
  },
  {
    'code': 'ABV',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด แวลู'
  },
  {
    'code': 'ABSM',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด สมอล แค็พ'
  },
  {
    'code': 'ABSI-RMF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด สมาร์ท อินคัม เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ABFC',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด เฟล็กซิเบิ้ลแคปปิตอล'
  },
  {
    'code': 'ABSC-RMF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด สมาร์ท แคปปิตอล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ABWOOF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด เวิลด์ ออพพอร์ทูนิตี้ส์ ฟันด์'
  },
  {
    'code': 'ABAPAC',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด เอเชีย แปซิฟิค เอคควิตี้ ฟันด์'
  },
  {
    'code': 'ABEG',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ยูโรเปี้ยน โกรท ฟันด์'
  },
  {
    'code': 'K-GLOBE',
    'name_th': 'กองทุนเปิดเค โกลบอล อิควิตี้'
  },
  {
    'code': 'K-GA',
    'name_th': 'กองทุนเปิดเค โกลบอล แอลโลเคชั่น'
  },
  {
    'code': 'KEQRMF',
    'name_th': 'กองทุนเปิดเค หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFLRMF',
    'name_th': 'กองทุนเปิดเค หุ้นทุนบริพัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KGBRMF',
    'name_th': 'กองทุนเปิดเค พันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KGLTF-C(L)',
    'name_th': 'กองทุนเปิดเค โกรทหุ้นระยะยาวปันผล-C ชนิด LTF'
  },
  {
    'code': 'KSFRMF',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ระยะสั้นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KBLRMF',
    'name_th': 'กองทุนเปิดเค บาลานซ์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KSDLTF',
    'name_th': 'กองทุนเปิดเค สตราทีจิค ดีเฟ็นซีฟหุ้นระยะยาวปันผล'
  },
  {
    'code': 'KEQLTF-C(L)',
    'name_th': 'กองทุนเปิดเค หุ้นระยะยาว-C ชนิด LTF'
  },
  {
    'code': 'K70LTF-C(L)',
    'name_th': 'กองทุนเปิดเค 70:30 หุ้นระยะยาวปันผล-C ชนิด LTF'
  },
  {
    'code': 'KDLTF-C(L)',
    'name_th': 'กองทุนเปิดเค หุ้นระยะยาวปันผล-C ชนิด LTF'
  },
  {
    'code': 'K20SLTF-C(L)',
    'name_th': 'กองทุนเปิดเค 20 ซีเล็คท์หุ้นระยะยาวปันผล-C ชนิด LTF'
  },
  {
    'code': 'RKBC',
    'name_th': 'กองทุนเปิดรวงข้าวดุลทรัพย์'
  },
  {
    'code': 'RKF4',
    'name_th': 'กองทุนเปิดรวงข้าว 4'
  },
  {
    'code': 'K-SELECT',
    'name_th': 'กองทุนเปิดเค ซีเล็คท์ หุ้นทุน'
  },
  {
    'code': 'K-EQUITY',
    'name_th': 'กองทุนเปิดเค หุ้นทุน'
  },
  {
    'code': 'SCBDA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ธนอนันต์ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'K-VALUE',
    'name_th': 'กองทุนเปิดเค หุ้นปันผล'
  },
  {
    'code': 'K-STEQ',
    'name_th': 'กองทุนเปิดเค สตราทีจิค เทรดดิ้ง หุ้นทุน'
  },
  {
    'code': 'K-CASH',
    'name_th': 'กองทุนเปิดเค บริหารเงิน'
  },
  {
    'code': 'K-TREASURY',
    'name_th': 'กองทุนเปิดเค ตราสารรัฐระยะสั้น'
  },
  {
    'code': 'K-CBOND',
    'name_th': 'กองทุนเปิดเค หุ้นกู้'
  },
  {
    'code': 'K-FIXED',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้'
  },
  {
    'code': 'EHD',
    'name_th': 'กองทุนเปิด ยูโร ไฮดิวิเดนด์'
  },
  {
    'code': 'ASIA-E',
    'name_th': 'กองทุนเปิด ออล เอเชีย อีควิตี้'
  },
  {
    'code': 'ASIA-B',
    'name_th': 'กองทุนเปิด ตราสารหนี้เอเชีย'
  },
  {
    'code': 'CPRMF5',
    'name_th': 'กองทุนเปิด คุ้มครองเงินต้นเพื่อการเลี้ยงชีพ 5'
  },
  {
    'code': 'CPRMF4',
    'name_th': 'กองทุนเปิด คุ้มครองเงินต้นเพื่อการเลี้ยงชีพ 4'
  },
  {
    'code': 'CPRMF3',
    'name_th': 'กองทุนเปิด คุ้มครองเงินต้นเพื่อการเลี้ยงชีพ 3'
  },
  {
    'code': 'CPRMF2',
    'name_th': 'กองทุนเปิด คุ้มครองเงินต้นเพื่อการเลี้ยงชีพ 2'
  },
  {
    'code': 'CPRMF1',
    'name_th': 'กองทุนเปิด คุ้มครองเงินต้นเพื่อการเลี้ยงชีพ 1'
  },
  {
    'code': 'SVRMF',
    'name_th': 'กองทุนเปิด ออมทรัพย์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'GBRMF',
    'name_th': 'กองทุนเปิด พันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ERMF',
    'name_th': 'กองทุนเปิด หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': '70/30-D LTF',
    'name_th': 'กองทุนเปิด 70/30 ปันผล หุ้นระยะยาว'
  },
  {
    'code': 'TBF',
    'name_th': 'กองทุนเปิด ไทย บาลานซ์ฟันด์'
  },
  {
    'code': 'VALUE-D LTF',
    'name_th': 'กองทุนเปิด แวลูพลัส ปันผล หุ้นระยะยาว'
  },
  {
    'code': 'BIG CAP-D LTF',
    'name_th': 'กองทุนเปิด Big Cap ปันผล หุ้นระยะยาว'
  },
  {
    'code': 'CG-LTF',
    'name_th': 'กองทุนเปิด บรรษัทภิบาล หุ้นระยะยาว'
  },
  {
    'code': 'TEF-DIV',
    'name_th': 'กองทุนเปิด ไทย อิควิตี้ฟันด์ - ปันผล'
  },
  {
    'code': 'TEF',
    'name_th': 'กองทุนเปิด ไทย อิควิตี้ฟันด์'
  },
  {
    'code': 'TFIF',
    'name_th': 'กองทุนเปิด ไทย ตราสารหนี้'
  },
  {
    'code': 'TCMF',
    'name_th': 'กองทุนเปิด ไทย แคช แมเนจเม้นท์ ชนิดเพื่อผู้ลงทุนทั่วไป'
  },
  {
    'code': 'SCBPGF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ แพลทตินัม โกลบอล ฟันด์'
  },
  {
    'code': 'SCBRM4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRM3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์เฟล็กซิเบิ้ล ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRM2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์พันธบัตรรัฐบาลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRM1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBLTT',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวทาร์เก็ต'
  },
  {
    'code': 'SCBLTS',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวสมาร์ท'
  },
  {
    'code': 'SCBLT4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวอินเตอร์'
  },
  {
    'code': 'SCBLT3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว (ชนิดหุ้นระยะยาว)'
  },
  {
    'code': 'SCBLT2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว พลัส'
  },
  {
    'code': 'SCBLT1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวปันผล 70/30'
  },
  {
    'code': 'SCBRF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์เกษียณสุข (ตราสารหนี้)'
  },
  {
    'code': 'SCBSFF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สะสมทรัพย์ตราสารหนี้'
  },
  {
    'code': 'KFIRMF',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-GlobalBond',
    'name_th': 'กองทุนเปิดธนชาตโกลบอล บอนด์ ฟันด์'
  },
  {
    'code': 'T-GlobalValue',
    'name_th': 'กองทุนเปิดธนชาตโกลบอล แวยู ฟันด์'
  },
  {
    'code': 'T-GlobalEnergy',
    'name_th': 'กองทุนเปิดธนชาต โกลบอล เอ็นเนอร์จี ฟันด์'
  },
  {
    'code': 'T-INFRA',
    'name_th': 'กองทุนเปิดธนชาตอินฟราสตรัคเจอร์ แอนด์ แน็ชเชอรัล รีซอร์ส ฟันด์ ออฟ ฟันด์'
  },
  {
    'code': 'T-PREMIUM BRAND',
    'name_th': 'กองทุนเปิดธนชาตพรีเมียมแบรนดส์ฟันด์'
  },
  {
    'code': 'K-SET50',
    'name_th': 'กองทุนเปิดเค เซ็ท 50'
  },
  {
    'code': 'KTFIXPLUS-D',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ พลัส ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KTLF70/30-L',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้นระยะยาว70/30 ชนิด LTF'
  },
  {
    'code': 'TOF',
    'name_th': 'กองทุนเปิดไทยสร้างโอกาส'
  },
  {
    'code': 'RMF1',
    'name_th': 'กองทุนเปิดกรุงไทยผสมเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTSE',
    'name_th': 'กองทุนเปิดกรุงไทย ซีเล็คทีฟ อิควิตี้ ฟันด์'
  },
  {
    'code': 'KTSF',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้นทุนปันผล'
  },
  {
    'code': 'KTSS',
    'name_th': 'กองทุนเปิดกรุงไทยสะสมทรัพย์'
  },
  {
    'code': 'KTLF-L',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้นระยะยาว ชนิด LTF'
  },
  {
    'code': 'KSLTF-L',
    'name_th': 'กองทุนเปิดกรุงไทยชาริอะฮ์หุ้นระยะยาว ชนิด LTF'
  },
  {
    'code': 'KSRMF',
    'name_th': 'กองทุนเปิดกรุงไทยชาริอะฮ์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBCB',
    'name_th': 'กองทุนเปิดทหารไทยธนวัฒน์'
  },
  {
    'code': 'RMF3',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ภาครัฐเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'RMF2',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KSET50LTF-L',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้นระยะยาว SET50 ชนิด LTF'
  },
  {
    'code': 'TMB50DV',
    'name_th': 'กองทุนเปิดทหารไทย SET50 ปันผล'
  },
  {
    'code': 'JB25',
    'name_th': 'กองทุนเปิด JUMBO 25'
  },
  {
    'code': 'JB25 LTF',
    'name_th': 'กองทุนเปิด JUMBO 25 ปันผล หุ้นระยะยาว'
  },
  {
    'code': 'T-TTW1',
    'name_th': 'กองทุนเปิดธนชาตทุนทวี1'
  },
  {
    'code': 'JBP LTF',
    'name_th': 'กองทุนเปิด JUMBO PLUS ปันผล หุ้นระยะยาว'
  },
  {
    'code': 'JB25RMF',
    'name_th': 'กองทุนเปิด JUMBO 25 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBEMEQ',
    'name_th': 'กองทุนเปิดทหารไทย Emerging Markets Equity Index'
  },
  {
    'code': 'TMBMRMF',
    'name_th': 'กองทุนเปิดทหารไทยธนบดีเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBCHEQ',
    'name_th': 'กองทุนเปิดทหารไทย China Equity Index'
  },
  {
    'code': 'TMBGOLD',
    'name_th': 'กองทุนเปิดทหารไทย โกลด์ ฟันด์'
  },
  {
    'code': 'TMB50RMF',
    'name_th': 'กองทุนเปิดทหารไทย SET50 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBWDEQ',
    'name_th': 'กองทุนเปิดทหารไทย World Equity Index'
  },
  {
    'code': 'T-TSB',
    'name_th': 'กองทุนเปิดธนชาตธีรสมบัติ'
  },
  {
    'code': 'T-STSD',
    'name_th': 'กองทุนเปิดธนชาตเสถียรทรัพย์ปันผล'
  },
  {
    'code': 'T-EQUITY',
    'name_th': 'กองทุนเปิดธนชาตหุ้นทุน'
  },
  {
    'code': 'T-NFRMF',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBPMO',
    'name_th': 'กองทุนเปิดไทยพาณิชย์เพิ่มผลมั่นคง (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'T-NMIXRMF',
    'name_th': 'กองทุนเปิดธนชาตมิกซ์ ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-CASH',
    'name_th': 'กองทุนเปิดธนชาตบริหารเงิน'
  },
  {
    'code': 'T-CSD',
    'name_th': 'กองทุนเปิดธนชาตเจริญทรัพย์ปันผล'
  },
  {
    'code': 'T-LTFD',
    'name_th': 'กองทุนเปิดธนชาตหุ้นระยะยาวปันผล'
  },
  {
    'code': 'T-BigCapLTF',
    'name_th': 'กองทุนเปิดธนชาต Big Cap หุ้นระยะยาว'
  },
  {
    'code': 'T-PPSD',
    'name_th': 'กองทุนเปิดธนชาตเพิ่มพูนทรัพย์ปันผล'
  },
  {
    'code': 'T-NMRMF',
    'name_th': 'กองทุนเปิดธนชาตตลาดเงินเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-NFPLUS',
    'name_th': 'กองทุนเปิดธนชาตฟันดาเมนทอล พลัส'
  },
  {
    'code': 'T-NGRMF',
    'name_th': 'กองทุนเปิดธนชาตพันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-TSARN',
    'name_th': 'กองทุนเปิดธนชาตธนสาร'
  },
  {
    'code': 'T-NERMF',
    'name_th': 'กองทุนเปิดธนชาตหุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B25RMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้น 25% เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BFLRMF',
    'name_th': 'กองทุนเปิดบัวหลวงเฟล็กซิเบิ้ลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BLTF75',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นระยะยาว 75/25'
  },
  {
    'code': 'BFRMF',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BERMF',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B-LTF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นระยะยาว'
  },
  {
    'code': 'B-FLEX',
    'name_th': 'กองทุนเปิดบีเฟล็กซ์'
  },
  {
    'code': 'BBASIC',
    'name_th': 'กองทุนเปิดบัวหลวงปัจจัย 4'
  },
  {
    'code': 'BCAP',
    'name_th': 'กองทุนเปิดบัวหลวงร่วมทุน'
  },
  {
    'code': 'B-INFRA',
    'name_th': 'กองทุนเปิดบัวหลวงโครงสร้างพื้นฐาน'
  },
  {
    'code': 'BTK',
    'name_th': 'กองทุนเปิดบัวหลวงธนคม'
  },
  {
    'code': 'BKD',
    'name_th': 'กองทุนเปิดบัวแก้วปันผล'
  },
  {
    'code': 'B-TNTV',
    'name_th': 'กองทุนเปิดบัวหลวงธนทวี'
  },
  {
    'code': 'BKA',
    'name_th': 'กองทุนเปิดบัวแก้ว'
  },
  {
    'code': 'B-ACTIVE',
    'name_th': 'กองทุนเปิดบีแอ็คทีฟ'
  },
  {
    'code': 'TISCOCID',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า อินเดีย ดิวิเดนด์ ฟันด์'
  },
  {
    'code': 'BTP',
    'name_th': 'กองทุนเปิดบัวหลวงทศพล'
  },
  {
    'code': 'BKA2',
    'name_th': 'กองทุนเปิดบัวแก้ว 2'
  },
  {
    'code': 'TFIRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ตราสารหนี้เพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'TFPRMF-A',
    'name_th': 'ทิสโก้พลทรัพย์เพื่อการเลี้ยงชีพ (A)'
  },
  {
    'code': 'TDLTF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นระยะยาวปันผล'
  },
  {
    'code': 'TISCOFLEXP',
    'name_th': 'กองทุนเปิด ทิสโก้ เฟล็กซิเบิ้ล พลัส'
  },
  {
    'code': 'TISCOEDF',
    'name_th': 'กองทุนเปิดทิสโก้หุ้นทุนปันผล'
  },
  {
    'code': 'TW-BAL',
    'name_th': 'กองทุนเปิด ทิสโก้ เวลธ์ บาลานซ์'
  },
  {
    'code': 'TISCOEQF',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นทุนไทย'
  },
  {
    'code': 'TEGRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้หุ้นทุนเพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'TISCOAGF',
    'name_th': 'กองทุนเปิด ทิสโก้ แอ็กเกรสซีฟ โกรท ฟันด์'
  },
  {
    'code': 'TSF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ สแตรทิจิก ฟันด์ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'TSFIRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ตราสารหนี้มั่นคงเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TISCOFLEX',
    'name_th': 'กองทุนเปิด ทิสโก้ เฟล็กซิเบิ้ล ฟันด์'
  },
  {
    'code': 'TISCOEGF',
    'name_th': 'กองทุนเปิดทิสโก้ ทวีทุน'
  },
  {
    'code': 'TISCOSTF',
    'name_th': 'กองทุนเปิด ทิสโก้ พันธบัตรระยะสั้น'
  },
  {
    'code': 'UOBGBRMF',
    'name_th': 'กองทุนเปิด ยูโอบี พันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'UOBSD',
    'name_th': 'กองทุนเปิด ยูโอบี ชัวร์ เดลี'
  },
  {
    'code': 'UOBSA',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท เอเชีย'
  },
  {
    'code': 'UOBLTF',
    'name_th': 'กองทุนเปิด ยูโอบี หุ้นระยะยาว'
  },
  {
    'code': 'UOBSVRMF',
    'name_th': 'กองทุนเปิด ยูโอบี ออมทรัพย์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'UOBSMG',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท มิเลนเนียม โกรว์ธ'
  },
  {
    'code': 'UOBSAS100',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท แอคทีฟ เซท 100'
  },
  {
    'code': 'TDF',
    'name_th': 'กองทุนเปิด ไทยดรากอน'
  },
  {
    'code': 'KPLUS2',
    'name_th': 'กองทุนเปิด กำไรเพิ่มพูน 2'
  },
  {
    'code': 'KPLUS',
    'name_th': 'กองทุนเปิด กำไรเพิ่มพูน'
  },
  {
    'code': 'KKF',
    'name_th': 'กองทุนเปิด เกียรตินาคิน'
  },
  {
    'code': 'KFEQRMF',
    'name_th': 'กองทุนเปิดกรุงศรีอิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFS100RMF',
    'name_th': 'กองทุนเปิดกรุงศรี SET100 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFTSRMF',
    'name_th': 'กองทุนเปิดกรุงศรีทวีทรัพย์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFGOVRMF',
    'name_th': 'กองทุนเปิดกรุงศรีพันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFCASHRMF',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเงินเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFLTFEQ',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวอิควิตี้'
  },
  {
    'code': 'KFLTF50',
    'name_th': 'กองทนุเปิดกรุงศรีหุ้นระยะยาว SET50'
  },
  {
    'code': 'KFLTFDIV',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวปันผล'
  },
  {
    'code': 'KFLTFD70',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวปันผล 70/30'
  },
  {
    'code': 'KFFLEX',
    'name_th': 'กองทุนเปิดกรุงศรีเฟล็กซิเบิล'
  },
  {
    'code': 'KFSMUL',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเจริญทรัพย์'
  },
  {
    'code': 'KFENS50-A',
    'name_th': 'กองทุนเปิดกรุงศรีเอ็นแฮนซ์เซ็ท 50 ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFDYNAMIC',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นไดนามิค'
  },
  {
    'code': 'KFGROWTH-D',
    'name_th': 'กองทุนเปิดกรุงศรีโกรทอิควิตี้-ปันผล'
  },
  {
    'code': 'KFSEQ',
    'name_th': 'กองทุนเปิดกรุงศรีอิควิตี้'
  },
  {
    'code': 'KFSEQ-D',
    'name_th': 'กองทุนเปิดกรุงศรีอิควิตี้ปันผล'
  },
  {
    'code': 'KFSDIV',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นปันผล'
  },
  {
    'code': 'KFMTFI-D',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ระยะกลางปันผล'
  },
  {
    'code': 'KFMTFI',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ระยะกลาง'
  },
  {
    'code': 'KFSPLUS',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเพิ่มทรัพย์'
  },
  {
    'code': 'KFCASH-A',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเงิน ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ASP-ERF',
    'name_th': 'กองทุนเปิดแอสเซทพลัสตราสารทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-MRF',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นผสมตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-FRF',
    'name_th': 'กองทุนรวมแอสเซทพลัสตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-GLTF-T',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นระยะยาวทวีกำไร ชนิดมีสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'ASP-LTF-T',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นระยะยาวชนิดจ่ายเงินปันผลและมีสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'ASP-NGF',
    'name_th': 'กองทุนเปิดแอสเซทพลัสนิปปอนโกรท'
  },
  {
    'code': 'ASP-GDF',
    'name_th': 'กองทุนเปิดแอสเซทพลัสกำไรปันผล'
  },
  {
    'code': 'ASP',
    'name_th': 'กองทุนเปิดแอสเซท พลัส ตราสารหนี้'
  },
  {
    'code': '1AM-GEM',
    'name_th': 'กองทุนเปิดวรรณเอเอ็ม โกลบอล อีเมอร์จิ้ง มาร์เก็ต เอควิตี้'
  },
  {
    'code': 'V-RMF',
    'name_th': 'กองทุนเปิด หุ้นคุณค่า เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'FLEX-RMF',
    'name_th': 'กองทุนเปิด เฟล็กซิเบิลคุณค่า เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'F-RMF',
    'name_th': 'กองทุนเปิด ตราสารหนี้คุณค่า เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'M-RMF',
    'name_th': 'กองทุนเปิด ตราสารการเงินคุณค่า เพื่อการเลี้ยงชีพ'
  },
  {
    'code': '1SMART-LTF',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มสมาร์ทหุ้นระยะยาว'
  },
  {
    'code': '1SG-LTF-T',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มซีเล็คทีฟโกรทหุ้นระยะยาว ชนิดได้รับสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': '1S-LTF-T',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มซีเล็คทีฟหุ้นระยะยาว ชนิดได้รับสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'FLEXAR',
    'name_th': 'กองทุนเปิดวรรณเฟล็กซิเบิลคืนกำไร'
  },
  {
    'code': 'ONE-FLEX',
    'name_th': 'กองทุนเปิดวรรณเฟล็กซิเบิล'
  },
  {
    'code': '1AMSET50-RA',
    'name_th': 'กองทุนเปิด วรรณเอเอ็มเซ็ท 50 ชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': '1VAL-D',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มหุ้นคุณค่าปันผล'
  },
  {
    'code': 'THANA1',
    'name_th': 'กองทุนเปิดธนาวรรณ'
  },
  {
    'code': 'ONE-EQ',
    'name_th': 'กองทุนเปิด วรรณ อิควิตี้'
  },
  {
    'code': 'ONE-FAS',
    'name_th': 'กองทุนเปิดเอกเอเซียพูนผล'
  },
  {
    'code': 'ONE+1',
    'name_th': 'กองทุนเปิด วรรณพลัสวรรณ'
  },
  {
    'code': 'ONE-UB 3',
    'name_th': 'กองทุนเปิดสหธนาคารเอกปันผล 3'
  },
  {
    'code': 'ONE-G',
    'name_th': 'กองทุนเปิดเอกทวีคูณ'
  },
  {
    'code': 'ONE-FAR',
    'name_th': 'กองทุนเปิดเอกตราสารหนี้คืนกำไร'
  },
  {
    'code': 'BCARE',
    'name_th': 'กองทุนเปิดบัวหลวงโกลบอลเฮลธ์แคร์'
  },
  {
    'code': 'MGS',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล สมาร์ท ฟันด์'
  },
  {
    'code': 'MGAG',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล อัลฟ่า ฟันด์ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'M-VALUE',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเงินทุนสร้างค่าเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MMF-RMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีตลาดเงินเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'M-FIX',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'M-CR',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีคุ้มครองเงินต้นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'M-BOND',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีพันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MVLTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเพิ่มค่าหุ้นระยะยาว'
  },
  {
    'code': 'MIFLTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีอิสลามิกหุ้นระยะยาว'
  },
  {
    'code': 'MGLTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีโกลบอลหุ้นระยะยาว'
  },
  {
    'code': 'MALTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเพิ่มทรัพย์หุ้นระยะยาว'
  },
  {
    'code': 'MIF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อิสลามิก ฟันด์'
  },
  {
    'code': 'MFX',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเฟล็กซิเบิลฟันด์'
  },
  {
    'code': 'M-BT',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี-บีทีอินคัมโกรทฟันด์'
  },
  {
    'code': 'KAF',
    'name_th': 'กองทุนเปิดกาญจนอนันต์'
  },
  {
    'code': 'HAPPY D5',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี แฮปปี้ ดี ไฟฟ์ ฟันด์'
  },
  {
    'code': 'UNF',
    'name_th': 'กองทุนเปิดยูไนเต็ดฟันด์'
  },
  {
    'code': 'TS',
    'name_th': 'กองทุนเปิดธีรทรัพย์'
  },
  {
    'code': 'STD2',
    'name_th': 'กองทุนเปิดสตางค์แดงสอง'
  },
  {
    'code': 'TNP',
    'name_th': 'กองทุนเปิดธนภูมิ'
  },
  {
    'code': 'STD',
    'name_th': 'กองทุนเปิดสตางค์แดง'
  },
  {
    'code': 'SSB',
    'name_th': 'กองทุนทรัพย์สมบูรณ์'
  },
  {
    'code': 'SF8',
    'name_th': 'กองทุนเปิดสินภิญโญแปด'
  },
  {
    'code': 'SF7',
    'name_th': 'กองทุนเปิดสินภิญโญเจ็ด'
  },
  {
    'code': 'SF5',
    'name_th': 'กองทุนเปิดสินภิญโญห้า'
  },
  {
    'code': 'SF4',
    'name_th': 'กองทุนเปิดสินภิญโญสี่'
  },
  {
    'code': 'SCIF2',
    'name_th': 'กองทุนเปิดนครหลวงไทย สอง'
  },
  {
    'code': 'SCIF',
    'name_th': 'กองทุนเปิดนครหลวงไทย'
  },
  {
    'code': 'SCDF',
    'name_th': 'กองทุนเปิดสินชฎา'
  },
  {
    'code': 'SAN',
    'name_th': 'กองทุนเปิดทรัพย์อนันต์'
  },
  {
    'code': 'RRF1',
    'name_th': 'กองทุนเปิดรุ่งโรจน์หนึ่ง'
  },
  {
    'code': 'RPF2',
    'name_th': 'กองทุนเปิดร่วมพัฒนาสอง'
  },
  {
    'code': 'M-S50',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เซ็ท 50'
  },
  {
    'code': 'DE-1',
    'name_th': 'กองทุนเปิดตะวันออกหนึ่ง'
  },
  {
    'code': 'BMBF',
    'name_th': 'กองทุนเปิดศรีนคร'
  },
  {
    'code': 'AGF',
    'name_th': 'กองทุนเปิดแอ๊ดคินซันโกรทฟันด์'
  },
  {
    'code': 'SMARTMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท ฟิกซ์ อินคัม'
  },
  {
    'code': 'MMM-MF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีตราสารหนี้ระยะสั้น'
  },
  {
    'code': 'MFF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีตราสารหนี้'
  },
  {
    'code': 'KKP EQRMF',
    'name_th': 'กองทุนเปิดเคเคพี หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP BLRMF',
    'name_th': 'กองทุนเปิดเคเคพี บาลานซ์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP INRMF',
    'name_th': 'กองทุนเปิดเคเคพี อินคัมเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP LTFD',
    'name_th': 'กองทุนเปิดเคเคพี หุ้นระยะยาวปันผล'
  },
  {
    'code': 'KKP PLUS',
    'name_th': 'กองทุนเปิดเคเคพี ตราสารหนี้พลัส'
  },
  {
    'code': 'KF-ORTFLEX',
    'name_th': 'กองทุนเปิดกรุงศรีโอเรียนทัลเฟล็กซ์'
  },
  {
    'code': 'KFFLEX2RMF',
    'name_th': 'กองทุนเปิดกรุงศรีเฟล็กซิเบิ้ล 2 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFMTFIRMF',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ระยะกลางเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFLTGOVRMF',
    'name_th': 'กองทุนเปิดกรุงศรีพันธบัตรระยะยาวเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFLTFA50-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวแอ็คทีฟ SET50 ปันผล'
  },
  {
    'code': 'KFVALUE',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นแวลู'
  },
  {
    'code': 'KFFLEX-D',
    'name_th': 'กองทุนเปิดกรุงศรีเฟล็กซิเบิ้ลปันผล'
  },
  {
    'code': 'KFDNM-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นไดนามิคปันผล'
  },
  {
    'code': 'P-LTF',
    'name_th': 'กองทุนเปิด ฟิลลิป หุ้นระยะยาว'
  },
  {
    'code': 'PCASH',
    'name_th': 'กองทุนเปิดฟิลลิปบริหารเงิน'
  },
  {
    'code': 'EP-LTF',
    'name_th': 'กองทุนเปิดเอคควิตี้โปร หุ้นระยะยาว'
  },
  {
    'code': 'MS-CHINA VALUE',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ ไชน่า แวลู เอฟไอเอฟ'
  },
  {
    'code': 'MS-CORE LTF',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ คอร์ หุ้นระยะยาว'
  },
  {
    'code': 'MS-CORE EQ',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ คอร์ อิควิตี้'
  },
  {
    'code': 'PRINCIPAL GCF',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล คอมมอดิตี้'
  },
  {
    'code': 'PRINCIPAL AARMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล อะเกรสซีฟ แอลโลเคชั่นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL ELTF-T',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ หุ้นระยะยาว T'
  },
  {
    'code': 'PRINCIPAL EEF-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ อิควิตี้ D'
  },
  {
    'code': 'PRINCIPAL FIRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล ตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL EQRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL PRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล มุ่งรักษาเงินต้นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL LTF-T',
    'name_th': 'กองทุนเปิดพรินซิเพิล หุ้นระยะยาว T'
  },
  {
    'code': 'PRINCIPAL 70LTFD-T',
    'name_th': 'กองทุนเปิดพรินซิเพิล 70 หุ้นระยะยาวปันผล T'
  },
  {
    'code': 'PRINCIPAL DAILY FIX',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ ตราสารหนี้'
  },
  {
    'code': 'K-STAR-A(R)',
    'name_th': 'กองทุนเปิดเค สตาร์ หุ้นทุน-A ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'TISCOLTF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นระยะยาว ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'MS-MONEY',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ มันนี่ มาร์เก็ต'
  },
  {
    'code': 'MS-EE EURO',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ อิเมอร์จิ้ง อีสเทอร์น ยุโรป เอฟไอเอฟ'
  },
  {
    'code': 'KFDIVRMF',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นปันผลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'K-FEQ',
    'name_th': 'กองทุนเปิดเค หุ้นทุนบริพัตร'
  },
  {
    'code': 'AEOB',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด อีเมอร์จิ้ง ออพพอร์ทูนิตี้ บอนด์ ฟันด์'
  },
  {
    'code': 'ABTED',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ไทย เอคควิตี้ ดีวิเด็น'
  },
  {
    'code': 'ABCC',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด แคช ครีเอชั่น'
  },
  {
    'code': 'TCIRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า อินเดีย เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFFIN-D',
    'name_th': 'กองทุนเปิดกรุงศรีไฟแนนเชี่ยลโฟกัสปันผล'
  },
  {
    'code': 'KFCASHPLUS',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเงินพลัส'
  },
  {
    'code': 'UOBEQRMF',
    'name_th': 'กองทุนเปิด ยูโอบี ตราสารทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBDV',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุนปันผล'
  },
  {
    'code': 'SCBSET',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เซ็ท อินเด็กซ์ ฟันด์ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'KFLTFEQ70D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวอิควิตี้ 70 ปันผล'
  },
  {
    'code': 'SYRUS-M',
    'name_th': 'กองทุนเปิด ไซรัส โมเมนตัม ฟันด์'
  },
  {
    'code': 'Q-PORT',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ควอนท์ - อินเทลลิเจ้นท์ พอร์ตฟอลิโอ ฟันด์'
  },
  {
    'code': 'I-CHIC',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล ชิค ฟันด์'
  },
  {
    'code': 'K-MONEY',
    'name_th': 'กองทุนเปิดเค ตลาดเงิน'
  },
  {
    'code': 'K-2500',
    'name_th': 'กองทุนเปิดเค ไลฟ์สไตล์ 2500'
  },
  {
    'code': 'SCBAEM',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เอเชียน อีเมอร์จิ้ง มาร์เก็ต ฟันด์'
  },
  {
    'code': 'K-2520',
    'name_th': 'กองทุนเปิดเค ไลฟ์สไตล์ 2520'
  },
  {
    'code': 'K-2530',
    'name_th': 'กองทุนเปิดเค ไลฟ์สไตล์ 2530'
  },
  {
    'code': 'K-2510',
    'name_th': 'กองทุนเปิดเค ไลฟ์สไตล์ 2510'
  },
  {
    'code': 'UOBSGC',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท เกรธเธอร์ ไชน่า'
  },
  {
    'code': 'ASP-BRIC',
    'name_th': 'กองทุนเปิดแอสเซทพลัสบริค'
  },
  {
    'code': '1GLOBALBOND',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ออพพอร์ทูนิตี้ บอนด์ ฟันด์'
  },
  {
    'code': 'KF-BRIC',
    'name_th': 'กองทุนเปิดกรุงศรีบริคสตาร์'
  },
  {
    'code': 'BRIC',
    'name_th': 'กองทุนเปิด บริค'
  },
  {
    'code': 'ASP-ASIAN',
    'name_th': 'กองทุนเปิดแอสเซทพลัสเอเชี่ยนสเปเชียลซิททูเอชั่นส์'
  },
  {
    'code': 'TFIX-3M#2',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3 เดือน#2'
  },
  {
    'code': 'TFIX-3M#5',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3 เดือน#5'
  },
  {
    'code': 'TGOV3M2',
    'name_th': 'กองทุนเปิดธนชาตพันธบัตรรัฐคุ้มครองเงินต้น 3M/2'
  },
  {
    'code': 'TGOV3M1',
    'name_th': 'กองทุนเปิดธนชาตพันธบัตรรัฐคุ้มครองเงินต้น 3M/1'
  },
  {
    'code': 'T-MONEY',
    'name_th': 'กองทุนเปิดธนชาตตลาดเงิน'
  },
  {
    'code': 'TFIX-3M#3',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3 เดือน#3'
  },
  {
    'code': 'TFIX-3M#4',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3 เดือน#4'
  },
  {
    'code': 'PFIXRMF',
    'name_th': 'กองทุนเปิดฟิลลิปตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP2',
    'name_th': 'กองทุนเปิดแอสเซทพลัสตราสารหนี้ 2'
  },
  {
    'code': 'ONE-DI',
    'name_th': 'กองทุนเปิดวรรณตราสารหนี้ปันผล'
  },
  {
    'code': 'ABGEM',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด โกลบอล อีเมอร์จิ้ง โกรท ฟันด์'
  },
  {
    'code': 'KKP GHC',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล เฮลธ์แคร์'
  },
  {
    'code': 'UOBSAS100D',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท แอคทีฟ เซท 100 ดิวิเดนด์'
  },
  {
    'code': 'UOBSC',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท คอมโมดิตี้'
  },
  {
    'code': 'IN-RMF',
    'name_th': 'กองทุนเปิดบัวหลวงโครงสร้างพื้นฐานเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'K-AGRI',
    'name_th': 'กองทุนเปิดเค อะกริคัลเจอร์'
  },
  {
    'code': 'K-GOLD-A(D)',
    'name_th': 'กองทุนเปิดเค โกลด์-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ENGY',
    'name_th': 'กองทุนเปิด MTrack Energy ETF'
  },
  {
    'code': 'KKP MP',
    'name_th': 'กองทุนเปิดเคเคพี มันนี่ โพสิทีฟ'
  },
  {
    'code': 'PRINCIPAL EPIF',
    'name_th': 'กองทุนเปิดพรินซิเพิล ดัชนีธุรกิจพลังงานและธุรกิจปิโตรเคมีและเคมีภัณฑ์'
  },
  {
    'code': '1US-OPP',
    'name_th': 'กองทุนเปิด วรรณ ยูเอส รีคอฟเวอรี่ ออพพอร์ทูนิตี้ ฟันด์'
  },
  {
    'code': '1AM-DAILY-RA',
    'name_th': 'กองทุนเปิดวรรณเดลี่ หน่วยลงทุนชนิดสะสมมูลค่า สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'KTSIV3M1',
    'name_th': 'กองทุนเปิดกรุงไทยสมาร์ท อินเวส 3 เดือน1'
  },
  {
    'code': 'KTFIX3M2',
    'name_th': 'กองทุนเปิดกรุงไทยประจำ 3 เดือนคุ้มครองเงินต้น2'
  },
  {
    'code': 'KTFIX3M1',
    'name_th': 'กองทุนเปิดกรุงไทยประจำ 3 เดือนคุ้มครองเงินต้น1'
  },
  {
    'code': 'MM-RMF',
    'name_th': 'กองทุนเปิดบัวหลวงมันนี่มาร์เก็ตเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PMIXRMF',
    'name_th': 'กองทุนเปิดฟิลลิปผสมเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MMGOVMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พันธบัตรตลาดเงิน ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'KTFIX3M3',
    'name_th': 'กองทุนเปิดกรุงไทยประจำ 3 เดือนคุ้มครองเงินต้น3'
  },
  {
    'code': '1AM-TG',
    'name_th': 'กองทุนเปิดวรรณพันธบัตรไทย'
  },
  {
    'code': 'KTSIV6M2',
    'name_th': 'กองทุนเปิดกรุงไทยสมาร์ท อินเวส 6 เดือน2'
  },
  {
    'code': 'KTSIV3M3',
    'name_th': 'กองทุนเปิดกรุงไทยสมาร์ท อินเวส 3 เดือน3'
  },
  {
    'code': 'KTSIV3M2',
    'name_th': 'กองทุนเปิดกรุงไทยสมาร์ท อินเวส 3 เดือน2'
  },
  {
    'code': 'MS-FLEX RMF',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ เฟล็กซิเบิ้ลฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL FI',
    'name_th': 'กองทุนเปิดพรินซิเพิล ตราสารหนี้'
  },
  {
    'code': 'RMF4',
    'name_th': 'กองทุนเปิดกรุงไทยตลาดเงินเพื่อการเลี้ยงชีพ (RMF4)'
  },
  {
    'code': 'TMBTM',
    'name_th': 'กองทุนเปิดทหารไทยธนรัฐ'
  },
  {
    'code': 'TMBMF',
    'name_th': 'กองทุนเปิดทหารไทยธนบดี'
  },
  {
    'code': 'HI-DIV',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ ฟันด์'
  },
  {
    'code': 'KTSIV6M1',
    'name_th': 'กองทุนเปิดกรุงไทยสมาร์ท อินเวส 6 เดือน1'
  },
  {
    'code': 'I-GOLD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล โกลด์ ฟันด์'
  },
  {
    'code': 'KF-GOLD',
    'name_th': 'กองทุนเปิดกรุงศรีโกลด์'
  },
  {
    'code': 'TISCOOIL',
    'name_th': 'กองทุนเปิด ทิสโก้ ออยล์ ฟันด์'
  },
  {
    'code': 'TGOLD',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลด์ ฟันด์'
  },
  {
    'code': 'KF-OIL',
    'name_th': 'กองทุนเปิดกรุงศรี ออยล์'
  },
  {
    'code': 'I-OIL',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล ออยล์ ฟันด์'
  },
  {
    'code': 'SCBAUD',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้นและเงินฝากสกุลเงินออสเตรเลีย'
  },
  {
    'code': 'KTSV',
    'name_th': 'กองทุนเปิดกรุงไทย เซฟวิ่ง ฟันด์'
  },
  {
    'code': 'ASP-GOLD',
    'name_th': 'กองทุนเปิดแอสเซทพลัสโกลด์'
  },
  {
    'code': 'PRINCIPAL TREASURY',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ ตราสารรัฐระยะสั้น'
  },
  {
    'code': 'ASP-OIL',
    'name_th': 'กองทุนเปิดแอสเซทพลัสออยล์'
  },
  {
    'code': 'ABFTH',
    'name_th': 'กองทุนเปิดดัชนีพันธบัตรไทยเอบีเอฟ'
  },
  {
    'code': 'TISCOAP',
    'name_th': 'กองทุนเปิด ทิสโก้ เอเชีย แปซิฟิก เอ็กซ์ เจแปน'
  },
  {
    'code': 'ASP-S&P500',
    'name_th': 'กองทุนเปิดแอสเซทพลัสเอสแอนด์พี 500'
  },
  {
    'code': 'SCBTMF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารรัฐตลาดเงิน'
  },
  {
    'code': 'ASP-TFIXED5',
    'name_th': 'กองทุนเปิดแอสเซทพลัสตราสารหนี้ทวีทรัพย์ 5'
  },
  {
    'code': 'K-OIL',
    'name_th': 'กองทุนเปิดเค ออยล์'
  },
  {
    'code': 'TISCOUS',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส อิควิตี้ ฟันด์'
  },
  {
    'code': 'GC',
    'name_th': 'กองทุนเปิด เกรธเธอร์ ไชน่า'
  },
  {
    'code': 'KT-ENERGY',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ เอ็นเนอร์จี ฟันด์'
  },
  {
    'code': 'ABCG',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ไชน่า เกทเวย์ ฟันด์'
  },
  {
    'code': 'MS-EQ DIV',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ อิควิตี้ ปันผล'
  },
  {
    'code': 'KFGOLDRMF',
    'name_th': 'กองทุนเปิดกรุงศรีโกลด์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-MAP',
    'name_th': 'กองทุนเปิดธนชาต Multi Asset Portfolio'
  },
  {
    'code': 'SCBCE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน'
  },
  {
    'code': 'K-CHINA',
    'name_th': 'กองทุนเปิดเค ไชน่า หุ้นทุน'
  },
  {
    'code': 'K-PLAN1',
    'name_th': 'กองทุนเปิดเค แพลน 1'
  },
  {
    'code': 'K-PLAN2',
    'name_th': 'กองทุนเปิดเค แพลน 2'
  },
  {
    'code': 'K-PLAN3',
    'name_th': 'กองทุนเปิดเค แพลน 3'
  },
  {
    'code': 'KT-FINANCE',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ ไฟแนนเชียล เซอร์วิส ฟันด์'
  },
  {
    'code': 'I-EQRMF',
    'name_th': 'กองทุนเปิดอินโนเทคตราสารทุนเพื้อการเลี้ยงชีพ'
  },
  {
    'code': 'TAPRMF',
    'name_th': 'กองทุนเปิดทิสโก้ เอเชีย แปซิฟิก เอ็กซ์ เจแปน เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP MMRMF',
    'name_th': 'กองทุนเปิดเคเคพี ตลาดเงินเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL SET50-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ เซ็ท 50 อินเด็กซ์ โดยอัตโนมัติ'
  },
  {
    'code': 'KGDRMF',
    'name_th': 'กองทุนเปิดเค โกลด์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KF-CHINA',
    'name_th': 'กองทุนเปิดกรุงศรีไชน่าอิควิตี้'
  },
  {
    'code': 'KF-LATAM',
    'name_th': 'กองทุนเปิดกรุงศรีลาตินอเมริกาอิควิตี้'
  },
  {
    'code': 'TW-E20',
    'name_th': 'กองทุนเปิด ทิสโก้ เวลธ์ คอนเซอเวทีฟ E20'
  },
  {
    'code': 'M-Active',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี แอคทิฟ อิควิตี้ ฟันด์'
  },
  {
    'code': 'KT-OIL',
    'name_th': 'กองทุนเปิดเคแทม ออยล์ ฟันด์'
  },
  {
    'code': 'GOLD-RMF',
    'name_th': 'กองทุนเปิดวรรณโกลด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TISCOLAF',
    'name_th': 'กองทุนเปิด ทิสโก้ ละติน อเมริกา'
  },
  {
    'code': 'KT-MINING',
    'name_th': 'กองทุนเปิด เคแทม เวิลด์ เมทัล แอนด์ ไมน์นิ่ง ฟันด์'
  },
  {
    'code': 'BGOLD',
    'name_th': 'กองทุนเปิดบัวหลวงโกลด์ฟันด์'
  },
  {
    'code': 'BGOLDRMF',
    'name_th': 'กองทุนเปิดบัวหลวงโกลด์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'I-GOLDRMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล โกลด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBOIL',
    'name_th': 'กองทุนเปิดทหารไทยออย์ฟันด์'
  },
  {
    'code': 'IREITG',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล เรียลเอสเตท ฟันด์ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'ONE-CHINA',
    'name_th': 'กองทุนเปิดวรรณไชน่าออโต้รีเด็มชั่นฟันด์'
  },
  {
    'code': 'TMBGF',
    'name_th': 'กองทุนเปิดทหารไทย Global Bond Fund'
  },
  {
    'code': 'ABAG',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด อเมริกัน โกรท ฟันด์'
  },
  {
    'code': 'ASP-HSI',
    'name_th': 'กองทุนเปิดแอสเซทพลัสเอชเอสไอ'
  },
  {
    'code': 'I-10',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล เทน'
  },
  {
    'code': 'M-Property',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้เวลท์ ฟันด์'
  },
  {
    'code': 'PGOLD',
    'name_th': 'กองทุนเปิด ฟิลลิป ทองคำ'
  },
  {
    'code': 'UOBSG-N',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลด์ ชนิดไม่จ่ายเงินปันผล'
  },
  {
    'code': 'UOBSG-D',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลด์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ONE-PROP',
    'name_th': 'กองทุนเปิด วรรณ พร็อพเพอร์ตี้ พลัส ฟันด์'
  },
  {
    'code': 'KT-GOLD',
    'name_th': 'กองทุนเปิดเคแทม โกลด์ ฟันด์'
  },
  {
    'code': 'UOBSDF',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท ดิวิเดนด์-โฟกัส อิควิตี้ ฟันด์'
  },
  {
    'code': 'K-GEMO',
    'name_th': 'กองทุนเปิดเค โกลบอล อีเมอร์จิ้ง มาร์เก็ต ออพพอร์ทูนนิตี้'
  },
  {
    'code': 'TMBBFRMF',
    'name_th': 'กองทุนเปิดทหารไทยธนไพศาล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-GOLD RMF',
    'name_th': 'กองทุนเปิดเคแทม โกลด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KF-TRB',
    'name_th': 'กองทุนเปิดกรุงศรีโทเทิลรีเทิร์นบอนด์'
  },
  {
    'code': 'SCBFP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ พลัส (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'TISCOCH',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า H-Shares อิควิตี้'
  },
  {
    'code': 'PRINCIPAL VF-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เพิ่มพูนทรัพย์ โดยอัตโนมัติ'
  },
  {
    'code': 'T-GlobalBondRMF',
    'name_th': 'กองทุนเปิดธนชาตโกลบอล บอนด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'CHINA',
    'name_th': 'กองทุนเปิดดับเบิลยูไอเอสอี เคแทม ซีเอสไอ 300 ไชน่า แทร็กเกอร์'
  },
  {
    'code': 'PRINCIPAL CII',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ ไชน่า-อินเดีย-อินโด อิควิตี้'
  },
  {
    'code': 'KT-PRECIOUS',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ โกลด์ แอนด์ เพรเชียส เอคควิตี้'
  },
  {
    'code': 'PRINCIPAL SET100RMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล SET100 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL MMRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล มันนี่ มาร์เก็ตเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'FCF',
    'name_th': 'กองทุนเปิด เฟลกซิเบิ้ล คอร์ปอเรท'
  },
  {
    'code': 'UOBSCI-N',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท ไชน่า อินเดีย ชนิดไม่จ่ายเงินปันผล'
  },
  {
    'code': 'UOBSCI-D',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท ไชน่า อินเดีย ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TMBGOLDSRMF',
    'name_th': 'กองทุนเปิดทหารไทย โกลด์ สิงคโปร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBGOLDS',
    'name_th': 'กองทุนเปิดทหารไทย โกลด์ สิงคโปร์'
  },
  {
    'code': 'UOBID',
    'name_th': 'กองทุนเปิด ยูโอบี อินคัม เดลี'
  },
  {
    'code': 'TMBGRMF',
    'name_th': 'กองทุนเปิดทหารไทย Global Bond Fund เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BFIXED',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารหนี้'
  },
  {
    'code': 'TGOLDBULLION-UH',
    'name_th': 'กองทุนเปิดธนชาตทองคำแท่ง-UH'
  },
  {
    'code': 'TGOLDBULLION-H',
    'name_th': 'กองทุนเปิดธนชาตทองคำแท่ง-H'
  },
  {
    'code': 'ABIG',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด อินเดีย โกรท ฟันด์'
  },
  {
    'code': 'I-Emerging 10S2',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล อีเมอร์จิ้ง 10 ซีรี่ส์ 2'
  },
  {
    'code': 'T-GlobalEQ',
    'name_th': 'กองทุนเปิดธนชาต Global Equity Fund'
  },
  {
    'code': 'KTEF',
    'name_th': 'กองทุนเปิดกรุงไทย สมาร์ท อิควิตี้ ฟันด์'
  },
  {
    'code': 'I-DEVELOP',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล ดีเวลลอป มาร์เก็ต'
  },
  {
    'code': 'KT-AGRI',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ อะกริคัลเจอร์ ฟันด์'
  },
  {
    'code': 'TMBUSO',
    'name_th': 'กองทุนเปิดทหารไทยยูเอสออพพอร์ทูนิตี้ส์'
  },
  {
    'code': 'TGOLDRMF-UH',
    'name_th': 'กองทุนเปิดธนชาตทองคำแท่งเพื่อการเลี้ยงชีพ-UH'
  },
  {
    'code': 'TGOLDRMF-H',
    'name_th': 'กองทุนเปิดธนชาตทองคำแท่งเพื่อการเลี้ยงชีพ-H'
  },
  {
    'code': 'K-INDIA',
    'name_th': 'กองทุนเปิดเค อินเดีย หุ้นทุน'
  },
  {
    'code': 'SCBSE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ซีเล็คท์ อิควิตี้ ฟันด์ (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'SCBENERGY',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET ENERGY SECTOR INDEX (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'SCBBANKING',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET BANKING SECTOR INDEX (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'ONE-EC14-RD',
    'name_th': 'กองทุนเปิด วรรณ อีควิตี้ฟันด์ (คอร์ปอเรท 14) ชนิดจ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'I-20',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล ทเวนตี้'
  },
  {
    'code': 'KACB',
    'name_th': 'กองทุนเปิด เคเอ คอร์เปอเรท บอนด์'
  },
  {
    'code': 'KAEQ',
    'name_th': 'กองทุนเปิด เคเอ เอควิตี้'
  },
  {
    'code': 'KASF',
    'name_th': 'กองทุนเปิด เคเอ ชอร์ท เทอม ฟิกซ์ อินคัม'
  },
  {
    'code': 'KTILB',
    'name_th': 'กองทุนเปิดกรุงไทยพันธบัตรรัฐบาลชดเชยเงินเฟ้อ'
  },
  {
    'code': 'I-ASEAN STAR 10',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล อาเซียน สตาร์ 10'
  },
  {
    'code': 'TMBGDF',
    'name_th': 'กองทุนเปิดทหารไทย โกลบอล บอนด์ ปันผล'
  },
  {
    'code': 'KKP SG-AA',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น ชนิดทั่วไป'
  },
  {
    'code': 'GLD',
    'name_th': 'กองทุนเปิดเคแทม โกลด์ อีทีเอฟ แทร็กเกอร์'
  },
  {
    'code': '1DIV',
    'name_th': 'กองทุนเปิดไทยเด็กซ์ SET High Dividend ETF'
  },
  {
    'code': 'SCBGOLDH',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ THB เฮดจ์'
  },
  {
    'code': 'SCBGOLD',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์'
  },
  {
    'code': 'ONEPROP-SG',
    'name_th': 'กองทุนเปิด วรรณ พร็อพเพอร์ตี้ สิงคโปร์'
  },
  {
    'code': 'KT-ST',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ระยะสั้น'
  },
  {
    'code': 'I-GOLD7S2',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล โกลด์ สปอท 7 ซีรี่ส์ 2'
  },
  {
    'code': 'KKP ACT EQ-D',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ อิควิตี้ ฟันด์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KT-PROPERTY',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ พร็อพเพอร์ตี้ ฟันด์'
  },
  {
    'code': 'SCBSET50',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET 50 INDEX (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBRMS50',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET 50 Index เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBGOLDHRMF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ THB เฮดจ์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-BOND',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ บอนด์ ฟันด์'
  },
  {
    'code': 'KKP PROP',
    'name_th': 'กองทุนเปิดเคเคพี พร็อพเพอร์ตี้ เซคเตอร์ ฟันด์'
  },
  {
    'code': 'TGOLDRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'UOBSGB',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลบอล บอนด์ ฟันด์'
  },
  {
    'code': 'LHMM-A',
    'name_th': 'กองทุนเปิด แอล เอช ตลาดเงิน ชนิดสะสมมูลค่า'
  },
  {
    'code': 'UOBGRMF-H',
    'name_th': 'กองทุนเปิด ยูโอบี โกลด์ เพื่อการเลี้ยงชีพ - H'
  },
  {
    'code': 'KKP PROPRMF',
    'name_th': 'กองทุนเปิดเคเคพี พร็อพเพอร์ตี้ เซคเตอร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'I-GOLD7S3',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล โกลด์ สปอท 7 ซีรี่ส์ 3'
  },
  {
    'code': 'PRINCIPAL BARMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล บาลานซ์ แอลโลเคชั่นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBGLOW',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล เวลท์'
  },
  {
    'code': 'KKP GOLD',
    'name_th': 'กองทุนเปิดเคเคพี โกลด์'
  },
  {
    'code': 'MS-ASIAN SM',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ เอเชียน สมอลแคป อิควิตี้ เอฟไอเอฟ'
  },
  {
    'code': 'ABAPAC-RMF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด เอเชีย แปซิฟิค เอคควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ADR-D',
    'name_th': 'กองทุนเปิด เอเชี่ยน เดบท์ รีจินอล บอนด์ ปันผล'
  },
  {
    'code': 'PRINCIPAL DEF',
    'name_th': 'กองทุนเปิดพรินซิเพิล หุ้นปันผล'
  },
  {
    'code': 'PRINCIPAL iPROP-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม-ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'UOBSG - H',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลด์ ฟันด์ - H'
  },
  {
    'code': 'PRINCIPAL iPROP-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม-ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TCMFENJOY',
    'name_th': 'กองทุนเปิด ไทย แคช แมเนจเม้นท์ เอ็นจอย'
  },
  {
    'code': 'T-LowBeta',
    'name_th': 'กองทุนเปิดธนชาต Low Beta'
  },
  {
    'code': 'BSIRICG',
    'name_th': 'กองทุนเปิดบัวหลวงสิริผลบรรษัทภิบาล'
  },
  {
    'code': 'TMBAASF',
    'name_th': 'กองทุนเปิดทหารไทยจัดทัพลงทุน ระยะสั้น'
  },
  {
    'code': 'TMBAAMF',
    'name_th': 'กองทุนเปิดทหารไทยจัดทัพลงทุน ระยะปานกลาง'
  },
  {
    'code': 'TMBAALF',
    'name_th': 'กองทุนเปิดทหารไทยจัดทัพลงทุน ระยะยาว'
  },
  {
    'code': 'TGOLDETF',
    'name_th': 'กองทุนเปิดธนชาตอีทีเอฟทองคำแท่ง'
  },
  {
    'code': 'MIX-D1585',
    'name_th': 'กองทุนเปิด ไทย มิกซ์ 15/85 ปันผล'
  },
  {
    'code': 'PRINCIPAL iDAILY-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL iDAILY-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'PRINCIPAL iDAILY-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KF-US',
    'name_th': 'กองทุนเปิดกรุงศรียูเอสอิควิตี้'
  },
  {
    'code': 'TBOND1Y',
    'name_th': 'กองทุนเปิด ทิสโก้ พันธบัตร 1 ปี'
  },
  {
    'code': 'PRINCIPAL iDIV-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล อิควิตี้ ดิวิเดนด์ อินคัม-ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL iDIV-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล อิควิตี้ ดิวิเดนด์ อินคัม-ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'PRINCIPAL iDIV-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล อิควิตี้ ดิวิเดนด์ อินคัม-ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KKP DIVIDEND',
    'name_th': 'กองทุนเปิดเคเคพี ดิวิเดนด์ อิควิตี้'
  },
  {
    'code': 'ABINC',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด อินคัม ครีเอชั่น'
  },
  {
    'code': 'PRINCIPAL iPROP-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม-ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KF-HGOLD',
    'name_th': 'กองทุนเปิดกรุงศรีโกลด์เฮดจ์'
  },
  {
    'code': 'T-SET50',
    'name_th': 'กองทุนเปิดธนชาต SET50'
  },
  {
    'code': 'TISCOHD',
    'name_th': 'กองทุนเปิด ทิสโก้ ไฮ ดิวิเดนด์ หุ้นทุน'
  },
  {
    'code': 'SCBGSIF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล สตราทีจิก อินเวสเมนท์'
  },
  {
    'code': 'SCBGLOB',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล บอนด์'
  },
  {
    'code': 'B-TREASURY',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารหนี้ภาครัฐ'
  },
  {
    'code': 'SCBTMFPLUS-A',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐตลาดเงิน พลัส ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'SCBTMFPLUS-B',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐตลาดเงิน พลัส ชนิดหน่วยลงทุน B'
  },
  {
    'code': 'SCBTMFPLUS-I',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐตลาดเงิน พลัส ชนิดหน่วยลงทุน I'
  },
  {
    'code': 'K-USA-A(D)',
    'name_th': 'กองทุนเปิด เค ยูเอสเอ หุ้นทุน-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'VFOCUS-D',
    'name_th': 'กองทุนเปิด ไทย แวลู โฟกัส อิควิตี้ ปันผล'
  },
  {
    'code': 'PRINCIPAL APDI',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอเชีย แปซิฟิก ไดนามิก อินคัม อิควิตี้'
  },
  {
    'code': 'SCBRMGWP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล เวลท์ พลัส เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRMGW',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล เวลท์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBGLOWP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล เวลท์ พลัส'
  },
  {
    'code': 'LHDEBT-D',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHDEBT-A',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHDEBT-R',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'SCBSMART2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สมาร์ทแพลน 2'
  },
  {
    'code': 'LHEQD-A',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHEQD-D',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHEQD-R',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'SCBSMART4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สมาร์ทแพลน 4'
  },
  {
    'code': 'SCBSMART3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สมาร์ทแพลน 3'
  },
  {
    'code': 'KTSE-RMF',
    'name_th': 'กองทุนเปิดกรุงไทย ซีเล็คทีฟ อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBOIL',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ออยล์'
  },
  {
    'code': 'SCBCOMP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ คอมมอดิตี้ พลัส'
  },
  {
    'code': 'KFMXPLS2TM',
    'name_th': 'กองทุนเปิดกรุงศรีมิกซ์พลัส 2TM'
  },
  {
    'code': 'KFMX2TM',
    'name_th': 'กองทุนเปิดกรุงศรีมิกซ์ 2TM'
  },
  {
    'code': 'THDRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ไฮ ดิวิเดนด์ หุ้นทุน เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'EBANK',
    'name_th': 'กองทุนเปิด KTAM SET Banking ETF Tracker'
  },
  {
    'code': 'KF-EM',
    'name_th': 'กองทุนเปิดกรุงศรีอีเมอร์จิ้งมาร์เก็ตส์อิควิตี้'
  },
  {
    'code': 'ONEPROP-RMF',
    'name_th': 'กองทุนเปิด วรรณ พร็อพเพอร์ตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B-SM-RMF',
    'name_th': 'กองทุนเปิดบัวหลวง Small-Mid Cap เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL iGOLD-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลด์ อินคัม ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL iGOLD-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลด์ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHFLRMF',
    'name_th': 'กองทุนเปิด แอล เอช เฟล็กซิเบิ้ลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHGOVRMF',
    'name_th': 'กองทุนเปิด แอล เอช พันธบัตรเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KGARMF',
    'name_th': 'กองทุนเปิดเค โกลบอล แอลโลเคชั่น เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-PROPERTY RMF',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ พร็อพเพอร์ตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KF-ELI',
    'name_th': 'กองทุนเปิดกรุงศรีอีเมอร์จิ้งโลคอลอินเวสเม้นท์'
  },
  {
    'code': 'PRINCIPAL iFIXED-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล คอร์ ฟิกซ์ อินคัม ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL iFIXED-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล คอร์ ฟิกซ์ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBEMEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นตลาดเกิดใหม่'
  },
  {
    'code': 'T-LowBetaRMF',
    'name_th': 'กองทุนเปิดธนชาต Low Beta เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBS&P500',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยูเอส'
  },
  {
    'code': 'PRINCIPAL iPROPRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัมเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-BOND RMF',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ บอนด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TCHRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า H-Shares อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBUS500RMF',
    'name_th': 'กองทุนเปิดทหารไทย US500 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBUS500',
    'name_th': 'กองทุนเปิดทหารไทย US500 Equity Index'
  },
  {
    'code': 'SCBGEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลบอล อิควิตี้ (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'SPOT33S7',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 7'
  },
  {
    'code': 'SPOT33S8',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 8'
  },
  {
    'code': 'TH100',
    'name_th': 'กองทุนเปิดไทยเด็กซ์ SET100 ETF'
  },
  {
    'code': 'SPOT33S9',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 9'
  },
  {
    'code': 'T-Dmixed',
    'name_th': 'กองทุนเปิดธนชาต ไดนามิก มิกซ์'
  },
  {
    'code': 'LHFL',
    'name_th': 'กองทุนเปิด แอล เอช เฟล็กซิเบิ้ล'
  },
  {
    'code': 'SCBEMBOND',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ตลาดเกิดใหม่'
  },
  {
    'code': 'ONEPROP-D',
    'name_th': 'กองทุนเปิด วรรณ พร็อพเพอร์ตี้ พลัส ดิวิเดน ฟันด์'
  },
  {
    'code': 'ENY',
    'name_th': 'กองทุนเปิด KTAM SET Energy ETF Tracker'
  },
  {
    'code': 'SCBCEH',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน THB เฮ็ดจ์'
  },
  {
    'code': 'KTILF',
    'name_th': 'กองทุนเปิดกรุงไทยอ้างอิงเงินเฟ้อ'
  },
  {
    'code': 'SPOT33S11',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 11'
  },
  {
    'code': 'SPOT33S10',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 10'
  },
  {
    'code': 'ASP-PRIME4',
    'name_th': 'กองทุนเปิดแอสเซทพลัสไพร์ม 4'
  },
  {
    'code': 'TMB-T-ES-IPLUS',
    'name_th': 'กองทุนเปิดทีเอ็มบี ธนชาต อีสท์สปริง อินคัม พลัส'
  },
  {
    'code': 'KT-WCORP',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ คอปเปอร์เรท บอนด์ ฟันด์'
  },
  {
    'code': 'K-USXNDQ-A(D)',
    'name_th': 'กองทุนเปิดเค หุ้นยูเอส ดัชนีเอ็นดีคิว 100-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'T-Privilege',
    'name_th': 'กองทุนเปิดธนชาตพริวิเลจ'
  },
  {
    'code': 'BSIRIRMF',
    'name_th': 'กองทุนเปิดบัวหลวงสิริผลบรรษัทภิบาลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SPOT33S14',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 14'
  },
  {
    'code': 'KF-EUROPE',
    'name_th': 'กองทุนเปิดกรุงศรียุโรปอิควิตี้'
  },
  {
    'code': 'SPOT33S15',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีสปอท 33 ซีรี่ส์ 15'
  },
  {
    'code': 'K-SF',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ระยะสั้น'
  },
  {
    'code': 'LHGROWTH-R',
    'name_th': 'กองทุนเปิด แอล เอช โกรทชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'LHGROWTH-D',
    'name_th': 'กองทุนเปิด แอล เอช โกรทชนิดจ่ายปันผล'
  },
  {
    'code': 'LHGROWTH-A',
    'name_th': 'กองทุนเปิด แอล เอช โกรทชนิดสะสมมูลค่า'
  },
  {
    'code': 'TUSREIT',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส รีท'
  },
  {
    'code': 'ONE-PREMIER',
    'name_th': 'กองทุนเปิด วรรณ อินคัม พรีเมียร์ ฟันด์'
  },
  {
    'code': 'ASP-AIF1',
    'name_th': 'กองทุนเปิดแอสเซทพลัสเอไอตราสารหนี้ 1'
  },
  {
    'code': 'TISCOMS-A',
    'name_th': 'กองทุนเปิด ทิสโก้ Mid/Small Cap อิควิตี้ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'PEQ',
    'name_th': 'กองทุนเปิด ฟิลลิป ตราสารทุน'
  },
  {
    'code': 'KTPLUS',
    'name_th': 'กองทุนเปิดกรุงไทย ธนทรัพย์ พลัส'
  },
  {
    'code': 'TISCOJP',
    'name_th': 'กองทุนเปิด ทิสโก้ เจแปน อิควิตี้'
  },
  {
    'code': 'B-SENIOR',
    'name_th': 'กองทุนผสมบีซีเนียร์สำหรับวัยเกษียณ'
  },
  {
    'code': 'K-EUROPE',
    'name_th': 'กองทุนเปิดเค ยูโรเปียน หุ้นทุน'
  },
  {
    'code': 'ABJO',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด เจแปน ออพพอร์ทูนิตี้ส์ ฟันด์'
  },
  {
    'code': 'LHTPROP',
    'name_th': 'กองทุนเปิด แอล เอช ไทย พร็อพเพอร์ตี้'
  },
  {
    'code': 'PRINCIPAL iBALANCED-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล บาลานซ์ อินคัม-ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'KKP PROP-D',
    'name_th': 'กองทุนเปิดเคเคพี พร็อพเพอร์ตี้ เซคเตอร์ - ดิวิเดนด์'
  },
  {
    'code': 'KT-FLEX',
    'name_th': 'กองทุนเปิดกรุงไทย เฟล็กซิเบิ้ล ฟันด์'
  },
  {
    'code': 'SCBNK225D',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นญี่ปุ่น ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBNK225',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นญี่ปุ่น'
  },
  {
    'code': 'MPDIVMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ ดิวิเดนด์ ฟันด์ ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'I-SMART',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล สมาร์ท ฟันด์'
  },
  {
    'code': 'KT-HiDiv',
    'name_th': 'กองทุนเปิดกรุงไทย หุ้นไฮดิวิเดนด์'
  },
  {
    'code': 'K-ASIA',
    'name_th': 'กองทุนเปิดเค เอเชียน สมอลเลอร์ หุ้นทุน'
  },
  {
    'code': 'SCB2586',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สำหรับการเกษียณอายุปี 2586'
  },
  {
    'code': 'SCB2576',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สำหรับการเกษียณอายุปี 2576'
  },
  {
    'code': 'SCB2566',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สำหรับการเกษียณอายุปี 2566'
  },
  {
    'code': 'SCBSFFPLUS-I',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส ชนิดหน่วยลงทุน I'
  },
  {
    'code': 'SCBSFFPLUS-B',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส ชนิดหน่วยลงทุน B'
  },
  {
    'code': 'SCBSFFPLUS-A',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'KT-HiDiv RMF',
    'name_th': 'กองทุนเปิดกรุงไทย หุ้นไฮดิวิเดนด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TJPRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ เจแปน อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KS50RMF',
    'name_th': 'กองทุนเปิดเค เซ็ท 50 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TUSRMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-GlobalEQRMF',
    'name_th': 'กองทุนเปิดธนชาต Global Equity เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-OPP-A',
    'name_th': 'กองทุนเปิด กรุงไทยออพเพอร์ทูนิตี้ ชนิดสะสมมลูค่า'
  },
  {
    'code': 'KT-OPP-D',
    'name_th': 'กองทุนเปิด กรุงไทยออพเพอร์ทูนิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KTFIX-1Y3Y',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ระยะ 1 ถึง 3 ปี'
  },
  {
    'code': 'PRINCIPAL JEQ',
    'name_th': 'กองทุนเปิดพรินซิเพิล เจแปนนิส อิควิตี้'
  },
  {
    'code': 'TISCOEU',
    'name_th': 'กองทุนเปิด ทิสโก้ ยุโรป อิควิตี้'
  },
  {
    'code': 'SCBEUEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยุโรป'
  },
  {
    'code': 'KT-EURO',
    'name_th': 'กองทุนเปิดเคแทม ยูโรเปียน อิควิตี้ ฟันด์'
  },
  {
    'code': 'UOBSJSM',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท เจแปน สมอล แอนด์ มิด แคป ฟันด์'
  },
  {
    'code': 'TISCONA',
    'name_th': 'กองทุนเปิด ทิสโก้ นอร์ธ เอเชีย อิควิตี้'
  },
  {
    'code': 'JSM',
    'name_th': 'กองทุนเปิด เจแปน สมอล แอนด์ มิด แคป ฟันด์'
  },
  {
    'code': 'PRINCIPAL KEQ',
    'name_th': 'กองทุนเปิดพรินซิเพิล เกาหลี อิควิตี้'
  },
  {
    'code': 'K-GB',
    'name_th': 'กองทุนเปิดเค โกลบอล บอนด์'
  },
  {
    'code': 'PRINCIPAL GEF-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL iDIV-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล อิควิตี้ ดิวิเดนด์ อินคัม-ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'PRINCIPAL GSCEQ-R',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล สมอล แค็พ อิควิตี้ ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'UOBSHY',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท ยูเอส ไฮ ยิลด์ ฟันด์'
  },
  {
    'code': 'ASP-THEQ',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นไทย'
  },
  {
    'code': 'USHY',
    'name_th': 'กองทุนเปิด ยูเอส ไฮ ยิลด์ ฟันด์'
  },
  {
    'code': 'BBASICRMF',
    'name_th': 'กองทุนเปิดบัวหลวงปัจจัย 4 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBEGRMF',
    'name_th': 'กองทุนเปิดทหารไทย ยูโรเปี้ยน โกรท เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBEG',
    'name_th': 'กองทุนเปิดทหารไทย ยูโรเปี้ยน โกรท'
  },
  {
    'code': 'PRINCIPAL iDAILY-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'PRINCIPAL iFIXED-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล คอร์ ฟิกซ์ อินคัม ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'PRINCIPAL KOS',
    'name_th': 'กองทุนเปิดพรินซิเพิล หุ้นเกาหลี'
  },
  {
    'code': 'TISCOLTF-B',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นระยะยาว ชนิดหน่วยลงทุน B'
  },
  {
    'code': 'TFIRMF-B',
    'name_th': 'กองทุนเปิด ทิสโก้ ตราสารหนี้เพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน B'
  },
  {
    'code': 'TEGRMF-B',
    'name_th': 'กองทุนเปิด ทิสโก้หุ้นทุนเพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน B'
  },
  {
    'code': 'TMBPIPF',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ อินคัม พลัส เฟล็กซิเบื้ล'
  },
  {
    'code': 'PRINCIPAL iPROP-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม-ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'TMBPIPRMF',
    'name_th': 'กองทุนเปิดทีเอ็มบีอีสท์สปริงพรอพเพอร์ตี้แอนด์อินฟราสตรัคเจอร์อินคัมพลัสเฟล็กซิเบื้ลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MS-ASM RMF',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ เอเชียน สมอลแคป อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-CHINA',
    'name_th': 'กองทุนเปิดแอสเซทพลัสไชน่า'
  },
  {
    'code': 'PRINCIPAL APEQ',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอเชีย แปซิฟิก อิควิตี้'
  },
  {
    'code': 'KFHEALTH-D',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเฮลธ์แคร์อิควิตี้-ปันผล'
  },
  {
    'code': 'MS-HCARE-D',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ เฮลธ์แคร์ เอฟไอเอฟ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MS-HCARE-A',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ เฮลธ์แคร์ เอฟไอเอฟ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TISCOGY',
    'name_th': 'กองทุนเปิด ทิสโก้ เยอรมัน อิควิตี้'
  },
  {
    'code': 'SCBKEQTG',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นเกาหลี'
  },
  {
    'code': 'K-GPROP-A(D)',
    'name_th': 'กองทุนเปิดเค โกลบอล พร็อพเพอร์ตี้ หุ้นทุน ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'UGH',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล เฮลท์แคร์ ฟันด์'
  },
  {
    'code': 'UOBSHC',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลบอล เฮลท์แคร์ ฟันด์'
  },
  {
    'code': 'TMSRMF-A',
    'name_th': 'ทิสโก้ Mid/Small Cap อิควิตี้ เพื่อการเลี้ยงชีพ (A)'
  },
  {
    'code': 'KF-SMCAPD',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลสมอล-มิดแคปอิควิตี้ปันผล'
  },
  {
    'code': 'TSTARP',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล สตาร์ พลัส'
  },
  {
    'code': 'KT-IGF-R',
    'name_th': 'กองทุนเปิดเคแทม อินคัม แอนด์ โกรท ฟันด์ ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'K-MIDSMALL',
    'name_th': 'กองทุนเปิดเค Mid Small Cap หุ้นทุน'
  },
  {
    'code': 'KT-WEQ',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ อิควิตี้ ฟันด์'
  },
  {
    'code': 'TMBCOF',
    'name_th': 'กองทุนเปิดทหารไทย China Opportunity'
  },
  {
    'code': 'ABEHB',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ยูโร ไฮ ยิลด์ บอนด์ ฟันด์'
  },
  {
    'code': 'BKIND',
    'name_th': 'กองทุนรวมคนไทยใจดี'
  },
  {
    'code': 'TMBAGLF',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Asia Active Equity'
  },
  {
    'code': 'T-SM CAP',
    'name_th': 'กองทุนเปิดธนชาต Small Medium Cap'
  },
  {
    'code': 'KF-HEUROPE',
    'name_th': 'กองทุนเปิดกรุงศรียุโรปอิควิตี้เฮดจ์'
  },
  {
    'code': 'TMBGRR',
    'name_th': 'กองทุนเปิดทหารไทย โกลบอล เรียล รีเทิร์น'
  },
  {
    'code': 'KT-WEQ RMF',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KEURMF',
    'name_th': 'กองทุนเปิดเค ยูโรเปียน หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KJPRMF',
    'name_th': 'กองทุนเปิดเค เจแปน หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'K-GHEALTH',
    'name_th': 'กองทุนเปิดเค โกลบอล เฮลท์แคร์ หุ้นทุน'
  },
  {
    'code': 'B-NIPPON',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นญี่ปุ่น'
  },
  {
    'code': 'KFHCARERMF',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเฮลธ์แคร์อิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFEURORMF',
    'name_th': 'กองทุนเปิดกรุงศรียุโรปอิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KF-INCOME',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลอินคัม'
  },
  {
    'code': 'K-JP',
    'name_th': 'กองทุนเปิดเค ญี่ปุ่น หุ้นทุน'
  },
  {
    'code': 'KT25/75RMF',
    'name_th': 'กองทุนเปิดกรุงไทย คอนเซอเวทีฟ 25/75 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL APDIRMF',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอเชีย แปซิฟิก ไดนามิก อินคัม อิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBMSE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุน Mid/Small Cap (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'TJREIT',
    'name_th': 'กองทุนเปิด ทิสโก้ เจแปน รีท'
  },
  {
    'code': 'HIDIVPLUSG',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ พลัส ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'SCBCHA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นจีนเอแชร์'
  },
  {
    'code': 'ASP-EUROPE QUALITY',
    'name_th': 'กองทุนเปิดแอสเซทพลัสยุโรปควอลิตี้'
  },
  {
    'code': 'KF-HJAPAND',
    'name_th': 'กองทุนเปิดกรุงศรีเจแปนเฮดจ์ปันผล'
  },
  {
    'code': 'UOBGARMF',
    'name_th': 'กองทุนเปิด ยูโอบี โกลบอล แอลโลเคชั่น เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'UOBSGA',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลบอล แอลโลเคชั่น ฟันด์'
  },
  {
    'code': 'TMBJE',
    'name_th': 'กองทุนเปิดทหารไทย Japan Equity'
  },
  {
    'code': 'PRINCIPAL DPLUS-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม พลัส A'
  },
  {
    'code': 'KT-US-A',
    'name_th': 'กองทุนเปิดเคแทม ยูเอส โกรท อิควิตี้ ฟันด์'
  },
  {
    'code': 'T-PROPERTY',
    'name_th': 'กองทุนเปิดธนชาตพร็อพเพอร์ตี้เซ็คเตอร์ฟันด์'
  },
  {
    'code': 'TMBGQG',
    'name_th': 'กองทุนเปิดทหารไทย Global Quality Growth'
  },
  {
    'code': 'SCBINDIA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นอินเดีย'
  },
  {
    'code': 'TCHSTARP',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า สตาร์ พลัส'
  },
  {
    'code': 'KT-ASEAN-A',
    'name_th': 'กองทุนเปิดเคแทม อาเซียน อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-ASIA',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นเอเชีย'
  },
  {
    'code': 'M-MIDSMALL',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี มิด สมอล แค็ป'
  },
  {
    'code': 'MS-INDIA-D',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ อินเดีย อิควิตี้ เอฟไอเอฟชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MS-INDIA-A',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ อินเดีย อิควิตี้ เอฟไอเอฟชนิดสะสมมูลค่า'
  },
  {
    'code': 'KF-HCHINAD',
    'name_th': 'กองทุนเปิดกรุงศรีเกรทเทอร์ไชน่าอิควิตี้เฮดจ์ปันผล'
  },
  {
    'code': 'TISCOC19',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า ทริกเกอร์ 8% #19'
  },
  {
    'code': 'KTMSEQ',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้น Mid-Small Cap'
  },
  {
    'code': 'T-CHCHALLENGE#1',
    'name_th': 'กองทุนเปิดธนชาตไชน่าชาเลนจ์#1'
  },
  {
    'code': 'ONE-ACTIVE6/2',
    'name_th': 'กองทุนเปิด วรรณ แอคทีฟ6/2 ฟันด์'
  },
  {
    'code': 'K-ENERGY',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นธุรกิจพลังงาน'
  },
  {
    'code': 'USHY-A',
    'name_th': 'กองทุนเปิด ยูเอส ไฮ ยิลด์ ฟันด์ - ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'UOBSHY-A',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท ยูเอส ไฮยิลด์ ฟันด์ - ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'TISCOC21',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า ทริกเกอร์ 8% #21'
  },
  {
    'code': 'TISCOC20',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า ทริกเกอร์ 8% #20'
  },
  {
    'code': 'BCARERMF',
    'name_th': 'กองทุนเปิดบัวหลวงโกลบอลเฮลธ์แคร์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TGHSTARP',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล เฮลธ์แคร์ สตาร์ พลัส'
  },
  {
    'code': 'UAI',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เอเชีย แปซิฟิก อินคัม ฟันด์'
  },
  {
    'code': 'UOBSAI',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท เอเชีย แปซิฟิก อินคัม ฟันด์'
  },
  {
    'code': 'K-ICT',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นธุรกิจเทคโนโลยีและการสื่อสาร'
  },
  {
    'code': 'KFAINCOM-R',
    'name_th': 'กองทุนเปิดกรุงศรีเอเชียนอินคัมเฮดจ์-รับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'M-FLEX',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เฟล็กซิเบิล อินเวสเมนท์'
  },
  {
    'code': 'K-GINCOME-A(R)',
    'name_th': 'กองทุนเปิดเค โกลบอล อินคัม-A ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL EUEQ',
    'name_th': 'กองทุนเปิดพรินซิเพิล ยูโรเปี้ยน อิควิตี้'
  },
  {
    'code': 'ONE-STOXXASEAN',
    'name_th': 'กองทุนเปิด วรรณ STOXX อาเซียน ซีเล็ค ดิวิเดนด์ อินเด็กซ์ ฟันด์'
  },
  {
    'code': 'MWELL1',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท เวลเนส ซีรี่ส์ 1'
  },
  {
    'code': 'T-HEALTHCARE',
    'name_th': 'กองทุนเปิดธนชาตโกลบอลเฮลธ์แคร์'
  },
  {
    'code': 'T-HEALTHCARERMF',
    'name_th': 'กองทุนเปิดธนชาตโกลบอลเฮลธ์แคร์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-mai',
    'name_th': 'กองทุนเปิดกรุงไทยหุ้น เอ็ม เอ ไอ'
  },
  {
    'code': 'TOIL6',
    'name_th': 'กองทุนเปิด ทิสโก้ ออยล์ ทริกเกอร์ 8% #6'
  },
  {
    'code': 'LHMSFL-R',
    'name_th': 'กองทุนเปิด แอล เอช เอ็ม เอส เฟล็กซิเบิ้ล ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'TUSOIL',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส ออยล์'
  },
  {
    'code': 'KT-AASIA-A',
    'name_th': 'กองทุนเปิดเคแทม ออล เอเชีย แปซิฟิก อิควิตี้ ฟันด์ - ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBBLN',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ บิลเลียนแนร์'
  },
  {
    'code': 'TMBJERMF',
    'name_th': 'กองทุนเปิดทหารไทย Japan Equity เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBGQGRMF',
    'name_th': 'กองทุนเปิดทหารไทย Global Quality Growth เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBCORMF',
    'name_th': 'กองทุนเปิดทหารไทย China Opportunity เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBAGLRMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Asia Active Equity เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KGHRMF',
    'name_th': 'กองทุนเปิดเค โกลบอล เฮลท์แคร์ หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-EUPROP',
    'name_th': 'กองทุนเปิดแอสเซทพลัสยุโรปพร็อพเพอร์ตี้'
  },
  {
    'code': 'UTSME',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไทย สมอล์ แอนด์ มิด แคป อิควี้ตี้ ฟันด์'
  },
  {
    'code': 'TMBGER',
    'name_th': 'กองทุนเปิดทหารไทย German Equity'
  },
  {
    'code': 'K-INDX',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นอินเดีย'
  },
  {
    'code': 'UHCRMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล เฮลท์แคร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ONE-ULTRA',
    'name_th': 'กองทุนเปิด วรรณ อัลตร้า อินคัม ฟันด์'
  },
  {
    'code': 'TGHRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล เฮลธ์แคร์ เพื่อการเลี้ยงชีพ ชนิดผู้ลงทุนทั้วไป'
  },
  {
    'code': 'SCBGHC',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นโกลบอลเฮลธ์แคร์'
  },
  {
    'code': 'T-JapanEQ',
    'name_th': 'กองทุนเปิดธนชาตเจแปน อิควิตี้'
  },
  {
    'code': 'T-EuropeEQ',
    'name_th': 'กองทุนเปิดธนชาตยุโรป อิควิตี้'
  },
  {
    'code': 'K-BANKING',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นธุรกิจธนาคาร'
  },
  {
    'code': 'K-CHX',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นจีน'
  },
  {
    'code': 'KMSRMF',
    'name_th': 'กองทุนเปิดเค Mid Small Cap หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B-GLOBAL',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นโกลบอล'
  },
  {
    'code': 'TEURMF',
    'name_th': 'กองทุนเปิด ทิสโก้ ยุโรป อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRMGIF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลบอลอินฟราสตรัคเจอร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBGIF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล อินฟราสตรัคเจอร์ อิควิตี้'
  },
  {
    'code': 'KKP ACT FIXED',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ ฟิกซ์ อินคัม'
  },
  {
    'code': 'PRINCIPAL GSA',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล ซิลเวอร์ เอจ'
  },
  {
    'code': 'TISESG-D',
    'name_th': 'กองทุนเปิด ทิสโก้ ESG เพื่อสังคม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'UES',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ยูโรเปี้ยน สมอล แคป ฟันด์'
  },
  {
    'code': 'ABAGS',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด อเมริกัน โกรท - สมอลเลอร์ คอมพานี ฟันด์'
  },
  {
    'code': 'KF-CINCOME',
    'name_th': 'กองทุนเปิดกรุงศรีคอลเล็คทีฟโกลบอลอินคัม'
  },
  {
    'code': 'SCBRMJP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นญี่ปุ่น เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRMGHC',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลเฮลธ์แคร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRMEU',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นยุโรป เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B-GLOBALRMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นโกลบอลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-FinanceTH',
    'name_th': 'กองทุนเปิดธนชาตหุ้นไทยไฟแนนเชียลเซ็คเตอร์'
  },
  {
    'code': 'K-EUSAGE',
    'name_th': 'กองทุนเปิดเค ยูโรเปียน ซิลเวอร์เอจ หุ้นทุน'
  },
  {
    'code': 'LHPROP-I',
    'name_th': 'กองทุนเปิด แอล เอช พร็อพเพอร์ตี้ พลัส I'
  },
  {
    'code': 'UGD',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ดูเรเบิ้ล อิควิตี้ ฟันด์'
  },
  {
    'code': 'SCBFST',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ตราสารหนี้ระยะสั้นต่างประเทศ'
  },
  {
    'code': 'LHTPROPRMF',
    'name_th': 'กองทุนเปิด แอล เอช ไทย พร็อพเพอร์ตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TSTAR-UH',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล สตาร์ พลัส อันเฮดจ์'
  },
  {
    'code': 'K-SGM',
    'name_th': 'กองทุนเปิดเค สตราทีจิค โกลบอล มัลติ-แอสเซ็ท'
  },
  {
    'code': 'KFJAPANRMF',
    'name_th': 'กองทุนเปิดกรุงศรีเจแปนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-HEALTHC RMF',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ เฮลธ์แคร์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-HEALTHCARE-A',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ เฮลธ์แคร์ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'T-INCOMEAI',
    'name_th': 'กองทุนเปิดธนชาตโกลบอลอินคัม ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UGSE',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ซีเคียวริตี้ อิควิตี้ ฟันด์'
  },
  {
    'code': 'KKP GNP',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล นิว เพอร์สเปกทีฟ'
  },
  {
    'code': 'TMSRMF-P',
    'name_th': 'ทิสโก้ Mid/Small Cap อิควิตี้ เพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน PVD'
  },
  {
    'code': 'TFPRMF-P',
    'name_th': 'ทิสโก้พลทรัพย์เพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน PVD'
  },
  {
    'code': 'TFIRMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้ ตราสารหนี้เพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน PVD'
  },
  {
    'code': 'TEGRMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้หุ้นทุนเพื่อการเลี้ยงชีพ ชนิดหน่วยลงทุน PVD'
  },
  {
    'code': 'K-GHEALTH(UH)',
    'name_th': 'กองทุนเปิดเค โกลบอล เฮลท์แคร์ หุ้นทุน Unhedged'
  },
  {
    'code': 'T-PropertyRMF',
    'name_th': 'กองทุนเปิดธนชาตพร็อพเพอร์ตี้เซ็คเตอร์ฟันด์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TUSEQ-UH',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส อิควิตี้ อันเฮดจ์'
  },
  {
    'code': 'ONE-UGG-RA',
    'name_th': 'กองทุนเปิด วรรณ อัลติเมท โกลบอล โกรว์ธ หน่วยลงทุนชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'T-PrimeLowBeta',
    'name_th': 'กองทุนเปิดธนชาต Prime Low Beta'
  },
  {
    'code': 'KT-INDIA-A',
    'name_th': 'กองทุนเปิดเคแทม อินเดีย อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBGPLUS',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลอินคัมพลัส'
  },
  {
    'code': 'PRINCIPAL GIF',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล อินฟราสตรัคเจอร์ อิควิตี้'
  },
  {
    'code': 'UIF-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม โฟกัส ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'TISCOIN',
    'name_th': 'กองทุนเปิด ทิสโก้ อินเดีย อิควิตี้'
  },
  {
    'code': 'UIF-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม โฟกัส ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'MMM-PLUS',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ตราสารหนี้ระยะสั้น พลัส'
  },
  {
    'code': 'K-AEC',
    'name_th': 'กองทุนเปิดเค อาเซียน อีโคโนมิค คอมมูนิตี้ หุ้นทุน'
  },
  {
    'code': 'KFTHAISM',
    'name_th': 'กองทุนเปิดกรุงศรีไทยสมอล-มิดแคปอิควิตี้'
  },
  {
    'code': 'SCBST555A',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ สมาร์ท เทรด 555 ฟันด์ เอ'
  },
  {
    'code': 'TMBJPNAE',
    'name_th': 'กองทุนเปิดทหารไทย Japan Active Equity'
  },
  {
    'code': 'T-PropInfraFlex',
    'name_th': 'กองทุนเปิดธนชาตพร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิล'
  },
  {
    'code': 'KT-INDIA-D',
    'name_th': 'กองทุนเปิดเคแทม อินเดีย อิควิตี้ ฟันด์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ONE-HOSPITAL',
    'name_th': 'กองทุนเปิด วรรณ โฮสพีทอล'
  },
  {
    'code': 'SCBPLUS',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ อินคัมพลัส'
  },
  {
    'code': 'KKP SMART MV',
    'name_th': 'กองทุนเปิดเคเคพี สมาร์ท มินิมั่ม โวลาติลิตี้'
  },
  {
    'code': 'TMBUSBLUECHIP',
    'name_th': 'กองทุนเปิดทหารไทย US Blue Chip Equity'
  },
  {
    'code': 'UIDPLUS',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม เดลี่ อัลตร้า พลัส ฟันด์'
  },
  {
    'code': 'K-GINFRA',
    'name_th': 'กองทุนเปิดเค โกลบอล อินฟราสตรัคเจอร์ หุ้นทุน'
  },
  {
    'code': 'K-SFPLUS',
    'name_th': 'กองทุนเปิดเค เอสเอฟ พลัส'
  },
  {
    'code': 'B-ASEAN',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นอาเซียน'
  },
  {
    'code': 'KFGPROP-D',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลพร็อพเพอร์ตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TINC-R',
    'name_th': 'กองทุนเปิด ทิสโก้ อินคัม พลัส ชนิดรับซื้อคืนโดยอัตโนมัติ'
  },
  {
    'code': 'KT-GMO-A',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล แม็คโคร ออพเพอทูนิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'K-EUX',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นยุโรป'
  },
  {
    'code': 'K-JPX',
    'name_th': 'กองทุนเปิดเค ดัชนีหุ้นญี่ปุ่น'
  },
  {
    'code': 'SCBLEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้น LOW VOLATILITY'
  },
  {
    'code': 'T-Mixed7030',
    'name_th': 'กองทุนเปิดธนชาตออพพอร์ทูนิตี้ส์ มิกซ์ 70/30'
  },
  {
    'code': 'LHIP-D',
    'name_th': 'กองทุนเปิด แอล เอช อินคัม พลัส ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHSMART-D',
    'name_th': 'กองทุนเปิด แอล เอช สมาร์ท อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ONE-ACT',
    'name_th': 'กองทุนเปิด วรรณ แอนไท คอรัปชั่น'
  },
  {
    'code': 'KTFIXPLUS-I',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ พลัส ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'KTFIXPLUS-A',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFSMART',
    'name_th': 'กองทุนเปิดกรุงศรีสมาร์ทตราสารหนี้'
  },
  {
    'code': 'TMBGINCOME',
    'name_th': 'กองทุนเปิดทหารไทย Global Income'
  },
  {
    'code': 'PRINCIPAL SIF',
    'name_th': 'กองทุนเปิดพรินซิเพิล สตราทีจิค อินคัม ฟันด์'
  },
  {
    'code': 'KGIFRMF',
    'name_th': 'กองทุนเปิดเค โกลบอล อินฟราสตรัคเจอร์ หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-JAPAN-A',
    'name_th': 'กองทุนเปิดเคแทม เจแปน อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KT-JAPAN-D',
    'name_th': 'กองทุนเปิดเคแทม เจแปน อิควิตี้ ฟันด์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBEUSM',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นยุโรปสมอลแคป'
  },
  {
    'code': 'SCBUSSM',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ยูเอสสมอลแคป'
  },
  {
    'code': 'K-PROPI',
    'name_th': 'กองทุนเปิดเค Property Infra Flexible'
  },
  {
    'code': 'BMSCITH',
    'name_th': 'กองทุนเปิด BCAP MSCI THAILAND ETF'
  },
  {
    'code': 'UGMAC',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล แม็คโคร ออพพอร์ทูนิตี้ส์'
  },
  {
    'code': 'KF-GLS',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลอิควิตี้ลองชอร์ต'
  },
  {
    'code': 'UPINCM',
    'name_th': 'กองทุนเปิด ยูไนเต็ด แพลตินัม อินคัม ออพพอร์ทูนิตี้ส์ พลัส ฟันด์'
  },
  {
    'code': 'SCBDIGI',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลดิจิตอล'
  },
  {
    'code': 'TUSFIX',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส ตราสารหนี้ระยะสั้น'
  },
  {
    'code': 'TMBINCOME',
    'name_th': 'กองทุนเปิดทหารไทย อินคัมพลัส'
  },
  {
    'code': 'PRINCIPAL GEQ',
    'name_th': 'กองทุนเปิดพรินซิเพิล เยอรมัน อิควิตี้'
  },
  {
    'code': 'KT-PIF-A',
    'name_th': 'กองทุนเปิดกรุงไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KT-PIF-D',
    'name_th': 'กองทุนเปิดกรุงไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KTSTPLUS-A',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ระยะสั้น พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'K-MVEQ',
    'name_th': 'กองทุนเปิดเค มินิมั่ม โวลาติลิตี้ หุ้นทุน'
  },
  {
    'code': 'KFGBRAND-D',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลแบรนด์อิควิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TMBGINCOMERMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี Global Income เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHJAPE-D',
    'name_th': 'กองทุนเปิด แอล เอช เจแปน - E ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TMBGINFRA',
    'name_th': 'กองทุนเปิดทีเอ็มบี Global Infrastructure Equity'
  },
  {
    'code': 'SCBST555B',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ สมาร์ท เทรด 555 ฟันด์ บี'
  },
  {
    'code': 'SCBGSIFR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล สตราทีจิก อินเวสเมนท์ (ชนิดรับซื้อคืนอัตโนมัติ)'
  },
  {
    'code': 'B-HY (H75) AI',
    'name_th': 'กองทุนเปิดบัวหลวงไฮยิลด์ (เฮดจ์ 75) ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'B-HY (UH) AI',
    'name_th': 'กองทุนเปิดบัวหลวงไฮยิลด์ (อันเฮดจ์) ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'M-PROP RMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท พร็อพเพอร์ตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TISCOFIX',
    'name_th': 'กองทุนเปิด ทิสโก้ ฟิกซ์ อินคัม ซีเล็ค'
  },
  {
    'code': 'LHMSFL-D',
    'name_th': 'กองทุนเปิด แอล เอช เอ็ม เอส เฟล็กซิเบิ้ล ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHMSFL-A',
    'name_th': 'กองทุนเปิด แอล เอช เอ็ม เอส เฟล็กซิเบิ้ล ชนิดสะสมมูลค่า'
  },
  {
    'code': 'UFIN-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เฟล็กซิเบิ้ล อินคัม ฟันด์ (ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ)'
  },
  {
    'code': 'UFIN-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เฟล็กซิเบิ้ล อินคัม ฟันด์ (ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ)'
  },
  {
    'code': 'TMSRMF-B',
    'name_th': 'ทิสโก้ Mid/Small Cap อิควิตี้ เพื่อการเลี้ยงชีพ (B)'
  },
  {
    'code': 'LHSMARTLTF-D',
    'name_th': 'กองทุนเปิด แอล เอช สมาร์ท หุ้นระยะยาว ชนิดจ่ายเงินปันผล และสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'SCBFLX',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เฟล็กซิเบิ้ล'
  },
  {
    'code': 'SCBTEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ไทยอิควิตี้ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'TMBTMSMV',
    'name_th': 'กองทุนเปิดทีเอ็มบี Thai Mid Small Minimum Variance'
  },
  {
    'code': 'TDSLTF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ดิวิเดนด์ ซีเล็ค หุ้นระยะยาว (ชนิดหน่วยลงทุน A)'
  },
  {
    'code': 'TMSLTF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ Mid/Small Cap หุ้นระยะยาว (ชนิดหน่วยลงทุน A)'
  },
  {
    'code': 'TDSLTF-B',
    'name_th': 'กองทุนเปิด ทิสโก้ ดิวิเดนด์ ซีเล็ค หุ้นระยะยาว (ชนิดหน่วยลงทุน B)'
  },
  {
    'code': 'TMSLTF-B',
    'name_th': 'กองทุนเปิด ทิสโก้ Mid/Small Cap หุ้นระยะยาว (ชนิดหน่วยลงทุน B)'
  },
  {
    'code': 'TISCODS',
    'name_th': 'กองทุนเปิด ทิสโก้ ดิวิเดนด์ ซีเล็ค อิควิตี้'
  },
  {
    'code': 'ONE-ACT70LTF',
    'name_th': 'กองทุนเปิด วรรณ แอนไท คอรัปชั่น 70 หุ้นระยะยาว'
  },
  {
    'code': 'KF-CSINCOM',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลคอลเล็คทีฟสมาร์ทอินคัม'
  },
  {
    'code': 'KF-SINCOME',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลสมาร์ทอินคัม'
  },
  {
    'code': 'T-LowBetaLTFD',
    'name_th': 'กองทุนเปิดธนชาต Low Beta หุ้นระยะยาวปันผล'
  },
  {
    'code': 'SCBGPROP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล พร็อพเพอร์ตี้'
  },
  {
    'code': 'T-IncomePropAI',
    'name_th': 'กองทุนเปิดธนชาตโกลบอล อินคัม พร็อพเพอร์ตี้ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UIFRMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม โฟกัส ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TCINCP-R',
    'name_th': 'กองทุนเปิด ทิสโก้ คอนเซอเวทีฟ อินคัม พลัส ชนิดรับซื้อคืนโดยอัตโนมัติ'
  },
  {
    'code': 'TLFLEX',
    'name_th': 'กองทุนเปิดทาลิส เฟล็กซิเบิ้ล'
  },
  {
    'code': 'KFAFIX-A',
    'name_th': 'กองทุนเปิดกรุงศรีแอคทีฟตราสารหนี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHPROPINFRA-D',
    'name_th': 'กองทุนเปิด แอล เอช ไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBAPLUS',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เอเชียแปซิฟิค อินคัมพลัส ห้ามขายผู้ลงทุนรายย่อย (ชนิดรับซื้อคืนอัตโนมัติ)'
  },
  {
    'code': 'BBASICDLTF',
    'name_th': 'กองทุนเปิดบัวหลวงปัจจัย 4 หุ้นระยะยาวปันผล'
  },
  {
    'code': 'TLLTFEQ',
    'name_th': 'กองทุนเปิดทาลิส หุ้นระยะยาว'
  },
  {
    'code': 'KKP SM CAP',
    'name_th': 'กองทุนเปิดเคเคพี SMALL AND MID CAP EQUITY'
  },
  {
    'code': 'ONE-SHARIAHLTF',
    'name_th': 'กองทุนเปิด วรรณ กองทุนคุณธรรม (ชะรีอะห์) หุ้นระยะยาว'
  },
  {
    'code': 'TLEQRMF',
    'name_th': 'กองทุนเปิดทาลิส หุ้นทุน เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TLFLEXRMF',
    'name_th': 'กองทุนเปิดทาลิส เฟล็กซิเบิ้ล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TLMMRMF',
    'name_th': 'กองทุนเปิดทาลิส ตลาดเงิน เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBABRMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี ธนไพบูลย์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBTMSMVLTF',
    'name_th': 'กองทุนเปิดทีเอ็มบี ไทย มิด สมอล ผันผวนต่ำ หุ้นระยะยาว'
  },
  {
    'code': 'TMBTMSMVRMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี ไทย มิด สมอล ผันผวนต่ำ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHPROPIA-D',
    'name_th': 'กองทุนเปิด แอล เอช พร็อพเพอร์ตี้ อินฟรา เฟล็กซิเบิล A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KFLTFAST-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวออลสตาร์ปันผล'
  },
  {
    'code': 'KFLTFTSM-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวไทยสมอล-มิดแคปปันผล'
  },
  {
    'code': 'KMSLTF-C(L)',
    'name_th': 'กองทุนเปิดเค Mid Small Cap หุ้นระยะยาว-C ชนิด LTF'
  },
  {
    'code': 'KMVLTF-C(L)',
    'name_th': 'กองทุนเปิดเค มินิมั่ม โวลาติลิตี้ หุ้นระยะยาว-C ชนิด LTF'
  },
  {
    'code': 'KS50LTF-C(L)',
    'name_th': 'กองทุนเปิดเค เซ็ท 50 หุ้นระยะยาว-C ชนิด LTF'
  },
  {
    'code': 'KFGBRANRMF',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลแบรนด์อิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFSINCRMF',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลสมาร์ทอินคัมเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTEF-LTF-L',
    'name_th': 'กองทุนเปิดกรุงไทย สมาร์ท หุ้นระยะยาว ชนิด LTF'
  },
  {
    'code': 'KT-PIF RMF',
    'name_th': 'กองทุนเปิดกรุงไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ABLTF 70/30',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด หุ้นระยะยาว 70/30'
  },
  {
    'code': 'KKP SmartMV LTF',
    'name_th': 'กองทุนเปิดเคเคพี สมาร์ท มินิมั่ม โวลาติลิตี้ หุ้นระยะยาว'
  },
  {
    'code': 'T-AsianProp',
    'name_th': 'กองทุนเปิดธนชาตเอเชี่ยน พร็อพเพอร์ตี้'
  },
  {
    'code': 'TMBASIAB',
    'name_th': 'กองทุนเปิดทีเอ็มบี Asian Bond'
  },
  {
    'code': 'TISCOGC',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล คอนซูเมอร์'
  },
  {
    'code': 'UTSME-LTF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไทย สมอล์ แอนด์ มิด แคป หุ้นระยะยาว'
  },
  {
    'code': 'TLMMF',
    'name_th': 'กองทุนเปิดทาลิส ตลาดเงิน'
  },
  {
    'code': 'CG-RMF',
    'name_th': 'กองทุนเปิด บรรษัทภิบาล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TLMSEQ',
    'name_th': 'กองทุนเปิดทาลิส MID-SMALL CAP หุ้นทุน'
  },
  {
    'code': 'TLEQ',
    'name_th': 'กองทุนเปิดทาลิส หุ้นทุน'
  },
  {
    'code': 'T-SMCapLTF',
    'name_th': 'กองทุนเปิดธนชาต Small Medium Cap หุ้นระยะยาว'
  },
  {
    'code': 'KTSE-LTF-L',
    'name_th': 'กองทุนเปิดกรุงไทย ซีเล็คทีฟ หุ้นระยะยาว ชนิด LTF'
  },
  {
    'code': 'ONE-UGERMF',
    'name_th': 'กองทุนเปิด วรรณ อัลติเมท โกลบอล อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTSET50RMF',
    'name_th': 'กองทุนเปิดกรุงไทย SET50 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHACTLTF-A',
    'name_th': 'กองทุนเปิด แอล เอช แอคทีฟ หุ้นระยะยาว ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHACTLTF-D',
    'name_th': 'กองทุนเปิด แอล เอช แอคทีฟ หุ้นระยะยาว ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KTWG-A',
    'name_th': 'กองทุนเปิดกรุงไทยผสม เวลท์ โกรท ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTWP-A',
    'name_th': 'กองทุนเปิดกรุงไทยผสม เวลท์ พลัส ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TMB-T-ES-DPLUS',
    'name_th': 'กองทุนเปิดทีเอ็มบี ธนชาต อีสท์สปริง เดลี่ อินคัม พลัส'
  },
  {
    'code': 'SCBGINR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลอินคัม ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'SCBMPLUSA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ มัลติ อินคัมพลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL TDIF-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล ไทย ไดนามิก อินคัม อิควิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ONE-FIXED-A',
    'name_th': 'กองทุนเปิด วรรณ ชอร์ตเทอม ฟิกซ์ อินคัม ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'ASP-DPLUS',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ตราสารหนี้ เดลี่ พลัส'
  },
  {
    'code': 'UGIS-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินคัม สตราทีจิค บอนด์ ฟันด์ (ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ)'
  },
  {
    'code': 'UGIS-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินคัม สตราทีจิค บอนด์ ฟันด์ (ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ)'
  },
  {
    'code': 'KF-GTECH',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเทคโนโลยีอิควิตี้'
  },
  {
    'code': 'SCBGMTA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลบอลมัลติสตราทิจีส์ เพื่อผู้ลงทุนที่มิใช่รายย่อย ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ONE-POWER',
    'name_th': 'กองทุนเปิด วรรณ พาวเวอร์ เอ็นเนอร์จี หน่วยลงทุนชนิดไม่จ่ายเงินปันผล'
  },
  {
    'code': 'KT-CLMVT-A',
    'name_th': 'กองทุนเปิดกรุงไทย หุ้น ซีแอลเอ็มวีที ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHSTRATEGY-A',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHSTRATEGY-D',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHSTRATEGY-R',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดขายคืนหน่วยลงทุนอัตโนมัต'
  },
  {
    'code': 'PRINCIPAL GREITs',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล รีทส์'
  },
  {
    'code': 'B-INNOTECH',
    'name_th': 'กองทุนเปิดบัวหลวงโกลบอลอินโนเวชั่นและเทคโนโลยี'
  },
  {
    'code': 'T-DIV',
    'name_th': 'กองทุนเปิดธนชาตหุ้นปันผล'
  },
  {
    'code': 'KFTSTAR-D',
    'name_th': 'กองทุนเปิดกรุงศรีไทยออลสตาร์ปันผล'
  },
  {
    'code': 'KT-CLMVT-D',
    'name_th': 'กองทุนเปิดกรุงไทย หุ้น ซีแอลเอ็มวีที ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'K-SEMQ',
    'name_th': 'กองทุนเปิดเค ซีเล็คทีฟ อีเมอร์จิ้ง มาร์เก็ตส์ หุ้นทุน'
  },
  {
    'code': 'USDHY-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ชอร์ต ดูเรชั่น ไฮ ยิลด์ บอนด์ ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัต'
  },
  {
    'code': 'USDHY-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ชอร์ต ดูเรชั่น ไฮ ยิลด์ บอนด์ ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'T-DIV2',
    'name_th': 'กองทุนเปิดธนชาตหุ้นปันผล 2'
  },
  {
    'code': 'LHSTPLUS-A',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ระยะสั้น พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBUSHYA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ตราสารหนี้ US Short Duration High Income ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KF-HUSINDX',
    'name_th': 'กองทุนเปิดกรุงศรียูเอสอิควิตี้อินเด็กซ์เฮดจ์เอฟเอ็กซ์'
  },
  {
    'code': 'KF-HJPINDX',
    'name_th': 'กองทุนเปิดกรุงศรีเจแปนอิควิตี้อินเด็กซ์เฮดจ์เอฟเอ็กซ์'
  },
  {
    'code': 'K-AFIXED',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้เอเชีย'
  },
  {
    'code': 'TMBEAE',
    'name_th': 'กองทุนเปิดทีเอ็มบี Emerging Active Equity'
  },
  {
    'code': 'KT-CHINA-A',
    'name_th': 'กองทุนเปิดเคแทม ไชน่า อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TISCOGEM',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล อีเมอร์จิ้ง มาร์เก็ต'
  },
  {
    'code': 'ASP-FFPLUSR',
    'name_th': 'กองทุนเปิดแอสเซทพลัส ตราสารหนี้ต่างประเทศพลัส ห้ามขายผู้ลงทุนรายย่อย-R'
  },
  {
    'code': 'ASP-FFPLUSA',
    'name_th': 'กองทุนเปิดแอสเซทพลัส ตราสารหนี้ต่างประเทศพลัส ห้ามขายผู้ลงทุนรายย่อย-A'
  },
  {
    'code': 'SCBABS',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ แอปโซลูท รีเทิร์น (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'TISCOJPA',
    'name_th': 'กองทุนเปิด ทิสโก้ เจแปน แอคทีฟ อิควิตี้'
  },
  {
    'code': 'SCBSEA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ซีเล็คท์ อิควิตี้ ฟันด์ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'M-INCOMEAI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินคัม พลัส ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'B-INCOME',
    'name_th': 'กองทุนเปิดบัวหลวงอินคัม'
  },
  {
    'code': 'TISCOBIG',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นบิ๊ก'
  },
  {
    'code': 'KF-JPSCAPD',
    'name_th': 'กองทุนเปิดกรุงศรีเจแปนสมอลแคปอิควิตี้ปันผล'
  },
  {
    'code': 'KT-SET50-A',
    'name_th': 'กองทุนเปิดกรุงไทย SET50 ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL GOPP-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล ออพพอร์ทูนิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TMBEBF',
    'name_th': 'กองทุนเปิดทีเอ็มบี Emerging Bond'
  },
  {
    'code': 'KF-JPSCAP',
    'name_th': 'กองทุนเปิดกรุงศรีเจแปนสมอลแคปอิควิตี้'
  },
  {
    'code': 'B-ASEANRMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นอาเซียนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASPGIPLUS-A',
    'name_th': 'กองทุนเปิด แอสเซทพลัส โกลบอล อินคัม พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ASPGIPLUS-R',
    'name_th': 'กองทุนเปิด แอสเซทพลัส โกลบอล อินคัม พลัส ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'ONE-APACPROP',
    'name_th': 'กองทุนเปิด วรรณ เอเชียแปซิฟิก พร็อพเพอร์ตี้ รีทส์'
  },
  {
    'code': 'ONE-ENHANCED3M3',
    'name_th': 'กองทุนเปิด วรรณ เอ็นแฮนท์ ไฟแนนเชียล อินสตรูเมนท์ ฟันด์ 3M3 ห้ามขายผู้ลงทุนราย ย่อย'
  },
  {
    'code': 'KF-HSMUS',
    'name_th': 'กองทุนเปิดกรุงศรียูเอสสมอล-มิดแคปอิควิตี้เฮดจ์เอฟเอ็กซ์'
  },
  {
    'code': 'LHSELECT-D',
    'name_th': 'กองทุนเปิด แอล เอช ซีเล็ค ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBWINR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เวิลด์อินคัม (ชนิดรับซื้อคืนอัตโนมัติ)'
  },
  {
    'code': 'KFHAPPY-A',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดี๊ดี ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHGINCOME-R',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อินคัม ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'LHGINCOME-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHGINCOME-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBDAP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ธนอนันต์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBDVP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุนปันผล (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBFPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ พลัส (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBMSEP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุน Mid/Small Cap (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBPMOP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์เพิ่มผลมั่นคง (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBSETP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET INDEX (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBTMFPLUS-P',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐตลาดเงิน พลัส ชนิดหน่วยลงทุน P'
  },
  {
    'code': 'ASP-SME',
    'name_th': 'กองทุนเปิด แอสเซทพลัส สมอล แอนด์ มิด แคป อิควิตี้'
  },
  {
    'code': 'ASP-FLEXPLUS',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เฟล็กซิเบิ้ล พลัส'
  },
  {
    'code': 'K-FIXEDPLUS-A',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ พลัส ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'MN-APREIT-A',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ เอเชีย แปซิฟิก พร็อพเพอร์ตี้ รีท ชนิดสะสมมูลค่า'
  },
  {
    'code': 'MN-APREIT-R',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ เอเชีย แปซิฟิก พร็อพเพอร์ตี้ รีท ชนิดขายคืนหน่วยลงทุนอัตโนมัตร'
  },
  {
    'code': 'KFMINCOM-R',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลมัลติแอสเซทอินคัมเฮดจ์เอฟเอ็กซ์-รับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'TISCOGIF-R',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล อินฟราสตรัคเจอร์ อิควิตี้ ชนิดรับซื้อคืนโดยอัตโนมัติ'
  },
  {
    'code': 'SCBBANKINGP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET BANKING SECTOR INDEX (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBENERGYP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET ENERGY SECTOR INDEX (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'KFTHAICG',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นธรรมาภิบาลไทย'
  },
  {
    'code': 'SCBAEMHA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เอเชียน อีเมอร์จิ้ง มาร์เก็ต ฟันด์ THB เฮดจ์'
  },
  {
    'code': 'TISESG-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ESG เพื่อสังคม ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'LHGLIFEE-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไลฟ์สไตล์ อิควิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ASP-ROBOT',
    'name_th': 'กองทุนเปิด แอสเซทพลัส โรโบติกส์'
  },
  {
    'code': 'SCBROBOA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลโรโบติกส์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'BSET100',
    'name_th': 'กองทุนเปิด BCAP SET100 ETF'
  },
  {
    'code': 'K-GREAT',
    'name_th': 'กองทุนเปิดเค โกลบอล ริสก์-เอ็นแฮนซท์ แอลโลเคชั่น'
  },
  {
    'code': 'M-SMART INCOME-AR',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล สมาร์ท อินคัม ชนิดขายคืนหน่วยลงทุนอัตโนมัต'
  },
  {
    'code': 'M-SMART INCOME-AC',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล สมาร์ท อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-BHARATA',
    'name_th': 'กองทุนเปิดบัวหลวงภารตะ'
  },
  {
    'code': 'SCBTHAICGA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นธรรมาภิบาลไทย(ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'KF-INDIA',
    'name_th': 'กองทุนเปิดกรุงศรีอินเดียอิควิตี้'
  },
  {
    'code': 'TLEQ-THAICG',
    'name_th': 'กองทุนเปิดทาลิส หุ้นธรรมาภิบาลไทย'
  },
  {
    'code': 'TMB-THAICG',
    'name_th': 'กองทุนรวมหุ้น ทีเอ็มบี ธรรมาภิบาลไทย'
  },
  {
    'code': 'T-PrimePlusAI',
    'name_th': 'กอวทุนเปิดธนาชาติ Prime Plus ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTBTHAICG-A',
    'name_th': 'กองทุนเปิดกรุงไทย บุญตรง ธรรมภิบาลไทย ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBSEP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ซีเล็คท์ อิควิตี้ ฟันด์(ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBSET50P',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET50 INDEX(ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'TISTECH-A',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล เทคโนโลยี อิควิตี้ ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'KT-GOI-A',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล ออปติมอล อินคัม ฟันด์ชนิดสะสมมูลค่า'
  },
  {
    'code': 'K-STAR-A(A)',
    'name_th': 'กองทุนเปิดเค สตาร์ หุ้นทุน-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-THAICG',
    'name_th': 'กองทุนรวมบัวหลวงหุ้นธรรมาภิบาลไทย'
  },
  {
    'code': 'LHTOPPICK-A',
    'name_th': 'กองทุนเปิด แอล เอช ท็อปพิค ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHTOPPICK-D',
    'name_th': 'กองทุนเปิด แอล เอช ท็อปพิค ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHTOPPICK-R',
    'name_th': 'กองทุนเปิด แอล เอช ท็อปพิค ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'K-FITXL',
    'name_th': 'กองทุนเปิดเค ฟิต แอลโลเคชั่น XL'
  },
  {
    'code': 'K-FITS',
    'name_th': 'กองทุนเปิดเค ฟิต แอลโลเคชั่น S'
  },
  {
    'code': 'K-FITM',
    'name_th': 'กองทุนเปิดเค ฟิต แอลโลเคชั่น M'
  },
  {
    'code': 'K-FITL',
    'name_th': 'กองทุนเปิดเค ฟิต แอลโลเคชั่น L'
  },
  {
    'code': 'K-ART',
    'name_th': 'กองทุนเปิดเค อิควิตี้แอบโซลูทรีเทิร์น ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFLTFSTARD',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวไทยออลสตาร์ปันผล'
  },
  {
    'code': 'KFCHINARMF',
    'name_th': 'กองทุนเปิดกรุงศรีเกรทเทอร์ไชน่าอิควิตี้เฮดจ์เอฟเอ็กซ์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFGTECHRMF',
    'name_th': 'กองทุนเปิดกรุงศรีโลกบอลเทคโนโลยีอิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFHAPPYRMF',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดี๊ดีเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFSTARRMF',
    'name_th': 'กองทุนเปิดกรุงศรีไทยออลสตาร์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT25/75-R',
    'name_th': 'กองทุนเปิดกรุงไทย คอนเซอเวทีฟ 25 /75 ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'PRINCIPAL VNEQ-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เวียดนาม อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'UEMIF-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อีเมอร์จิ้ง มาร์เก็ต อินคัม ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'UEMIF-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อีเมอร์จิ้ง มาร์เก็ต อินคัม ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'PRINCIPAL iDAILY-I',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'KFTSTAR-A',
    'name_th': 'กองทุนเปิดกรุงศรีไทยออลสตาร์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBPOPA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Global Population Trend ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBRMPOP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Global Population Trend เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ONE-GLOBHY-I',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฮยิลด์บอนด์ ระยะสั้น ชนิดหน่วยลงทุนสำหรับผู้ลงทุนรายใหญ่หรือผู้ลงทุนสถาบัน'
  },
  {
    'code': 'ONE-GLOBHY-R',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฮยิลด์บอนด์ ระยะสั้น ชนิดหน่วยลงทุนสำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'ASP-SMELTF-T',
    'name_th': 'กองทุนเปิด แอสเซทพลัส สมอล แอนด์ มิด แคป อิควิตี้ หุ้นระยะยาว ชนิดมีสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'KTHAICGRMF',
    'name_th': 'กองทุนเปิดเค หุ้นธรรมาภิบาลไทยเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHSTGLTF-A',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ หุ้นระยะยาว ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHSTGLTF-D',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ หุ้นระยะยาว ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KKP G-UBOND-H',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล อันคอนสเตรนด์ บอนด์ เฮดจ์'
  },
  {
    'code': 'TMBGPROP',
    'name_th': 'กองทุนเปิดที่เอ็มบี Global Property'
  },
  {
    'code': 'TLDIVLTF-D',
    'name_th': 'กองทุนเปิดทาลิส DIVIDEND STOCK หุ้นระยะยาวปันผล'
  },
  {
    'code': 'TLDIVRMF',
    'name_th': 'กองทุนเปิดทาลิส DIVIDEND STOCK เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'B-INDIAMRMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นอินเดียมิดแคปเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'HIDIVLTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ หุ้นระยะยาว'
  },
  {
    'code': 'MIDSMALLLTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี มิด สมอล แค็ป หุ้นระยะยาว'
  },
  {
    'code': 'KTEF-RMF',
    'name_th': 'กองทุนเปิดกรุงไทย สมาร์ท อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-ROBOTRMF',
    'name_th': 'กอวทุนเปิด แอสเซทพลัส โรโบติกส์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHGINCOMERMF',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อินคัม เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'THMO1',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไทย โมเมนตัม ซีรี่ส์ 1'
  },
  {
    'code': 'UTHAICG',
    'name_th': 'กองทุนเปิด ยูไนเต็ด หุ้นธรรมาภิบาลไทย'
  },
  {
    'code': 'UGISRMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินคัม สตราทีจิค บอนด์ ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBMLTA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Machine Learning Thai Equity ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL GFIXED',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล ฟิกซ์ อินคัม'
  },
  {
    'code': 'KT25/75-A',
    'name_th': 'กองทุนเปิดกรุงไทย คอนเซอเวทีฟ 25/75 ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TUSFIN-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ยูเอส ไฟแนนเชียล ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'LHINDIAE-D',
    'name_th': 'กองทุนเปิด แอล เอช อินเดีย-E ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KT-CHINA RMF',
    'name_th': 'กองทุนเปิดเคแทม ไชน่า อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'K-APB',
    'name_th': 'กองทุนเปิดเค เอเชีย แปซิฟิก บอนด์'
  },
  {
    'code': 'K-GINCOME-A(A)',
    'name_th': 'กองทุนเปิดเค โกลบอล อินคัม–A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ONE-TOP5M',
    'name_th': 'กองทุนเปิด วรรณ ท็อป ซีเล็คชั่น 5M'
  },
  {
    'code': 'SCBWINA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เวิลด์อินคัม (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBGINA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลอินคัม (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBAPLUSA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เอเชียแปซิฟิค อินคัมพลัส ห้ามขายผู้ลงทุนรายย่อย (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBMLTP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Machine Learning Thai Equity (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SMO5A1',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท โมเมนตัม ซีรี่ส์ 5 เอ 1'
  },
  {
    'code': 'ASP-VIET',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เวียดนาม โกรท ฟันด์'
  },
  {
    'code': 'LHROBOTE-D',
    'name_th': 'กองทุนเปิด แอล เอช โรโบติกส์-E ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KT-GCINCOME-R',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล เครดิต อินคัม ฟันด์ ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'SI5A4',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท อินเวสเมนท์ ซีรี่ส์ 5 เอ 4'
  },
  {
    'code': 'SCBSFFPLUS-P',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัสชนิดหน่วยลงทุน P'
  },
  {
    'code': 'KT-IGF-A',
    'name_th': 'กองทุนเปิดเคแทม อินคัม แอนด์ โกรท ฟันด์ ห้ามขายผู้ลงทุนรายย่อย ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFHEALTH-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเฮลธ์แคร์อิควิตี้-ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFAINCOM-A',
    'name_th': 'กองทุนเปิดกรุงศรีเอเชียนอินคัมเฮดจ์-ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFMINCOM-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลมัลติแอสเซทอินคัมเฮดจ์เอฟเอ็กซ์-ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-SENIOR-X',
    'name_th': 'กองทุนผสมบีซีเนียร์สำหรับวัยเกษียณ เอ็กซ์ตร้า'
  },
  {
    'code': 'TMBEAERMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี Emerging Active Equity เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TMBGPROPRMF',
    'name_th': 'กองทุนเปิดทีเอ็มบี Global Property เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MRECO5',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไทย รีคัฟเวอรี่ ซีรี่ส์ 5'
  },
  {
    'code': 'ONE-GLOBFIN-RA',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฟแนนเชียล ชนิดไม่จ่ายเงินปันผล เหมาะสำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'ONE-GLOBFIN-IA',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฟแนนเชียล ชนิดไม่จ่ายเงินปันผล เหมาะสำหรับผู้ลงทุนรายใหญ่หรือผู้ลงทุนสถาบัน'
  },
  {
    'code': 'ONE-GLOBFIN-RD',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฟแนนเชียล ชนิดจ่ายเงินปันผล เหมาะสำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'ONE-GLOBFIN-ID',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ไฟแนนเชียล ชนิดจ่ายเงินปันผล เหมาะสำหรับผู้ลงทุนรายใหญ่หรือผู้ลงทุนสถาบัน'
  },
  {
    'code': 'TCHT5M2',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า อิควิตี้ ทริกเกอร์ 5M#2'
  },
  {
    'code': 'UDB-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ไดนามิค บอนด์ ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'UDB-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ไดนามิค บอนด์ ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'SCBINCA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBINCR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ อินคัม ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'LHEME-D',
    'name_th': 'กองทุนเปิด แอล เอช อีเมอร์จิ้ง มาร์เก็ต-E ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TLDIVEQ-D',
    'name_th': 'กองทุนเปิดทาลิส DIVIDEND STOCK หุ้นทุนปันผล'
  },
  {
    'code': 'KFGROWTH-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกรทอิควิตี้-สะสมมูลค่า'
  },
  {
    'code': 'KFACHINA-A',
    'name_th': 'กองทุนเปิดกรุงศรีไชน่าเอแชร์อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'M-SELECTCG',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีซีเล็คหุ้นทุนธรรมาภิบาลไทย'
  },
  {
    'code': 'PRINCIPAL GMV-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล แมเนจ โวลาติลิตี้ อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBFINA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล ฟิกซ์ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBFINR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล ฟิกซ์ อินคัม ชนิดรับซื้อคืนอัดโนมัติ'
  },
  {
    'code': 'B-CHINE-EQ',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นจีน'
  },
  {
    'code': 'TISCOINA-A',
    'name_th': 'กองทุนเปิด ทิสโก้ อินเดีย แอคทีฟ อิควิตี้ ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'ONE-VIETNAM-RA',
    'name_th': 'กองทุนเปิด วรรณ เวียดนาม อิควิตี้ ชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'T-Fixed3YR12',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3YR12'
  },
  {
    'code': 'ONE-INDIAOPP-RA',
    'name_th': 'กองทุนเปิด วรรณ อินเดีย ออพพอร์ทูนิตี้ ชนิด RA'
  },
  {
    'code': 'ONE-INDIAOPP-IA',
    'name_th': 'กองทุนเปิด วรรณ อินเดีย ออพพอร์ทูนิตี้ ชนิด IA'
  },
  {
    'code': 'ONE-INDIAOPP-RD',
    'name_th': 'กองทุนเปิด วรรณ อินเดีย ออพพอร์ทูนิตี้ ชนิด RD'
  },
  {
    'code': 'ONE-INDIAOPP-ID',
    'name_th': 'กองทุนเปิด วรรณ อินเดีย ออพพอร์ทูนิตี้ ชนิด ID'
  },
  {
    'code': '1AMSET50-RU',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มเซ็ท 50 ชนิดไม่จ่ายปันผลสำหรับผู้ลงทุนทั่วไปหรือกรมธรรม์ประกันชีวิตควบหน่วยลงทุน'
  },
  {
    'code': 'PRINCIPAL VNEQ-I',
    'name_th': 'กองทุนเปิดพรินซิเพิล เวียดนาม อิควิตี้ ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'K-EUSMALL',
    'name_th': 'กองทุนเปิดเค ยูโรเปียน Small Cap หุ้นทุน'
  },
  {
    'code': 'KFHASIA-A',
    'name_th': 'กองทุนเปิดกรุงศรีเอเชียนอิควิตี้เฮดจ์เอฟเอ็กซ์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ONE-EUROEQ',
    'name_th': 'กองทุนเปิด วรรณ ยูโรเปี้ยน อิควิตี้'
  },
  {
    'code': 'GI5EM1',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกรท อินเวสเมนท์ 5 อีเอ็ม 1'
  },
  {
    'code': 'SCBOPPR',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เครดิต ออพพอทูนิตี้ ชนิดรับซื้อคืนอัตโนมัต'
  },
  {
    'code': 'SCBOPPA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เครดิต ออพพอทูนิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTMEE-A',
    'name_th': 'กองทุนเปิดกรุงไทยมีทรัพย์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTMUNG-A',
    'name_th': 'กองทุนเปิดกรุงไทยมั่งคั่ง ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTSRI-A',
    'name_th': 'กองทุนเปิดกรุงไทยศรีสิริ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTSUK-A',
    'name_th': 'กองทุนเปิดกรุงไทยสุขใจ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHDIGITAL-A',
    'name_th': 'กองทุนเปิด แอล เอช ดิจิตอล อีโคโนมี ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHDIGITAL-D',
    'name_th': 'กองทุนเปิด แอล เอช ดิจิตอล อีโคโนมี ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHDIGITAL-R',
    'name_th': 'กองทุนเปิด แอล เอช ดิจิตอล อีโคโนมี ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'SCBBANKINGA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET BANKING SECTOR INDEX ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBLEQA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้น LOW VOLATILITY (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'ASP-DISRUPT',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ดิสรัปทีฟ ออพพอร์ทูนิตี้ส์'
  },
  {
    'code': 'PRINCIPAL GPS-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล พรีเฟอร์ ซิเคียวริตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBLTSEA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว ซีเล็คท์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBLTSED',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว ซีเล็คท์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KFVIET-A',
    'name_th': 'กองทุนเปิดกรุงศรีเวียดนามอิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'BMSCG',
    'name_th': 'กองทุนเปิด BCAP Mid Small CG ETF'
  },
  {
    'code': 'MS50LTF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เซ็ท 50 หุ้นระยะยาว'
  },
  {
    'code': 'M-S50 RMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เซ็ท 50 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-GCINCOME-A',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล เครดิต อินคัม ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TCMF-I',
    'name_th': 'กองทุนเปิด ไทย แคช แมเนจเม้นท์ ชนิดเพื่อผู้ลงทุนนิติบุคคล'
  },
  {
    'code': 'TGINC-R',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล อินคัม พลัส ชนิดรับซื้อคืนโดยอัตโนมัติ'
  },
  {
    'code': 'KT-MAB-A',
    'name_th': 'กองทุนเปิดเคแทม มัลติ แมเนเจอร์ แอสเซ็ท บาลานซ์ ฟัน ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KT-MFE-A',
    'name_th': 'กองทุนเปิดเคแทม มัลติ แมเนเจอร์ เฟล็กซิเบิ้ล อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KT-MFB-A',
    'name_th': 'กองทุนเปิดเคแทม มัลติ แมเนเจอร์ เฟล็กซิเบิ้ล บอนด์ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-TOPTENRMF',
    'name_th': 'กองทุนเปิดบัวหลวงทศพลเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TEQT5M1',
    'name_th': 'กองทุนเปิด ทิสโก้ ไทย อิควิตี้ ทริกเกอร์ 5M#1'
  },
  {
    'code': 'M-VI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี แวลู อินเวสติง'
  },
  {
    'code': 'KKP GNP-H',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล นิว เพอร์สเปกทีฟ เฮดจ์'
  },
  {
    'code': 'SCBFIXEDA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBCHEQA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ออล ไชน่า อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KCR3YA-UI',
    'name_th': 'กองทุนเปิดเค Complex Return 3YA ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KT-WTAI-A',
    'name_th': 'กองทุนเปิดเคแทม เวิลด์ เทคโนโลยี อาร์ทิฟิเชียล อินเทลลิเจนซ์ อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBPOPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Global Population Trend (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'KFGOOD',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดีเว่อร์'
  },
  {
    'code': 'T-Fixed3YR13',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3YR13'
  },
  {
    'code': 'TMBINDAE',
    'name_th': 'กองทุนเปิดทีเอ็มบี India Active Equity'
  },
  {
    'code': 'MN-USBANK-A',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ ยูเอส แบงค์ อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'M-TWSUK RMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เกษียณทวีสุข เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-CSBOND-A',
    'name_th': 'กองทุนเปิดเคแทม แคปปิตอล ซีเคียวริตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TGINC-A',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล อินคัม พลัส ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'SCBTHAICGP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นธรรมาภิบาลไทย(ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'T-Fixed3YR14',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3YR14'
  },
  {
    'code': 'UGEAR',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อิควิตี้ แอบโซลูท รีเทิร์น'
  },
  {
    'code': 'SCBGEQA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลบอล อิควิตี้ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBJPSMA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นญี่ปุ่นสมอลแคป (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'UVO',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เวียดนาม ออพพอร์ทูนิตี้ ฟันด์'
  },
  {
    'code': 'LHGEQ-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHGEQ-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHGEQ-R',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดขายคืนหน่วยลงทุนอัตโนมัต'
  },
  {
    'code': 'TFixed3Y11M1AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3Y11M1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'MN-BALANCE',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ก้าวไกล'
  },
  {
    'code': 'KT-DHINCOME-A',
    'name_th': 'กองทุนเปิดเคแทม ไดนามิค ไฮ อินคัม ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-FUTURE',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นเพื่อคนรุ่นใหม่'
  },
  {
    'code': 'PRINCIPAL iPROPPLUS',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม พลัส เฮลท์'
  },
  {
    'code': 'TFixed4Y10M1AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 4Y10M1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'M-SUKUK',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล ศุกูก'
  },
  {
    'code': 'SCBPINA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBPIND',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'PRINCIPAL iBALANCED-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล บาลานซ์ อินคัม-ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'KCR3YB-AI',
    'name_th': 'กองทุนเปิดเค Complex Return 3YB ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TCINCP-A',
    'name_th': 'กองทุนเปิด ทิสโก้ คอนเซอเวทีฟ อินคัม พลัส ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'TINC-A',
    'name_th': 'กองทุนเปิด ทิสโก้ อินคัม พลัส ชนิดสะสมผลตอบแทน'
  },
  {
    'code': 'ASP-DISRUPTRMF',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ดิสรัปทีฟ ออพพอร์ทูนิตี้ส์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TINRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ อินคัม พลัส เพื่อการเลี้ยงชีพ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'TINRMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้ อินคัม พลัส เพื่อการเลี้ยงชีพ ชนิดรองรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'LHGMA-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล มัลติ แอสเซ็ท ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHGMA-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล มัลติ แอสเซ็ท ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHGMA-R',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล มัลติ แอสเซ็ท ชนิดขายคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'ONE-ALLCHINA-RA',
    'name_th': 'กองทุนเปิด วรรณ ออล ไชน่า อิควิตี้ ชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'KKP ACT EQ-A',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'T-SmartBeta',
    'name_th': 'กองทุนเปิดธนชาต Smart Beta'
  },
  {
    'code': 'PRINCIPAL CHEQ-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล ไชน่า อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ASP-VIETRMF',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เวียดนาม โกรท เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBLTSETA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว เซ็ท อินเด็กซ์ (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBLTSETD',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว เซ็ท อินเด็กซ์ (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'MSI27',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม ฟันด์ 27'
  },
  {
    'code': 'SCBSMART2A',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สมาร์ทแพลน 2 (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBGEARA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล อิควิตี้ แอพโซลูท รีเทิร์น ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PWIN',
    'name_th': 'กองทุนเปิดฟิลลิปเวิลด์อินโนเวชั่น'
  },
  {
    'code': 'ONE-OPPORTUNITY6/2',
    'name_th': 'กองทุนเปิด วรรณ ออพพอร์ทูนิตี้ 6/2'
  },
  {
    'code': 'KT-BRAIN-A',
    'name_th': 'กองทุนเปิดกรุงไทย เอไอ เบรน ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-ASIARMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นเอเชียเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TGESG',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นโลกยั่งยืน'
  },
  {
    'code': 'SCBTG',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นไทยทริกเกอร์'
  },
  {
    'code': 'B-INNOTECHRMF',
    'name_th': 'กองทุนเปิดบัวหลวงโกลบอลอินโนเวชั่นและเทคโนโลยีเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TEQT5M3',
    'name_th': 'กองทุนเปิด ทิสโก้ ไทย อิควิตี้ ทริกเกอร์ 5M#3'
  },
  {
    'code': 'K-VIETNAM',
    'name_th': 'กองทุนเปิดเค เวียดนาม หุ้นทุน'
  },
  {
    'code': 'UNI',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินโนเวชั่น ฟันด์'
  },
  {
    'code': 'KTMUNG-D',
    'name_th': 'กองทุนเปิดกรุงไทยมั่งคั่ง ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KTSRI-D',
    'name_th': 'กองทุนเปิดกรุงไทยศรีสิริ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ASP-EVOCHINA',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อีโวลูชั่น ไชน่า อิควิตี้'
  },
  {
    'code': 'KTMEE-D',
    'name_th': 'กองทุนเปิดกรุงไทยมีทรัพย์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ASP-INDIA',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อินเดีย ไดนามิกส์ อิควิตี้'
  },
  {
    'code': 'MATECH-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เอเชีย เทคโนโลยี ชนิดผู้ลงทุนทั่วไปที่รับเงินปันผล'
  },
  {
    'code': 'SCBKEQTGP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นเกาหลี (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBINDIAP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นอินเดีย (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBEUSMP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยุโรปสมอลแคป (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBEUEQP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยุโรป (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBNK225P',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นญี่ปุ่น (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBCHAP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นจีนเอแชร์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBCEP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBCEHP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน THB เฮ็ดจ์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'KTSUK-D',
    'name_th': 'กองทุนเปิดกรุงไทยสุขใจ (ชนิดจ่ายเงินปันผล)'
  },
  {
    'code': 'SCBGHCP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นโกลบอลเฮลธ์แคร์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBS&P500P',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยูเอส (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'KFINDIARMF',
    'name_th': 'กองทุนเปิดกรุงศรีอินเดียอิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFAFIXRMF',
    'name_th': 'กองทุนเปิดกรุงศรีแอคทีฟตราสารหนี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFGOODRMF',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดีเว่อร์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-BRAIN RMF',
    'name_th': 'กองทุนเปิดกรุงไทย เอไอ เบรน เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFLTFDNM-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวไดนามิค ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ONE-FIXED-P',
    'name_th': 'กองทุนเปิด วรรณ ชอร์ตเทอม ฟิกซ์ อินคัม ชนิดหน่วยลงทุน P'
  },
  {
    'code': 'HI-DIV RMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL GOPP-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล ออพพอร์ทูนิตี้ ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'KFDNMRMF',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นไดนามิคเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBGMLA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Global Machine Learning Equity ชนิดสะสมมูลค่า'
  },
  {
    'code': 'UGQG',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ควอลิตี้ โกรท ฟันด์'
  },
  {
    'code': 'ONE-EC14-RA',
    'name_th': 'กองทุนเปิด วรรณ อีควิตี้ฟันด์ (คอร์ปอเรท 14) ชนิด\'ไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'BCAP-MSCITH LTF',
    'name_th': 'กองทุนเปิดบีแคป เอ็มเอสซีไอไทยแลนด์ หุ้นระยะยาว'
  },
  {
    'code': 'KGT5YA',
    'name_th': 'กองทุนเปิดเค การันตี 5 ปี A'
  },
  {
    'code': 'UGQGRMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ควอลิตี้ โกรท ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP SG-AA RMF',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KKP GNP RMF-H',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล นิว เพอร์สเปกทีฟ เพื่อการเลี้ยงชีพ เฮดจ์'
  },
  {
    'code': 'KKP GNP RMF-UH',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล นิว เพอร์สเปกทีฟ เพื่อการเลี้ยงชีพ อันเฮดจ์'
  },
  {
    'code': 'SCBSETE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เซ็ท อินเด็กซ์ ฟันด์ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'K-CCTV',
    'name_th': 'กองทุนเปิดเค ไชน่า คอนโทรล โวลาติลิตี้'
  },
  {
    'code': 'TFixed2Y2AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 2Y2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHEQDPLUS-A',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHEQDPLUS-D',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล พลัส ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MSI1AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TMB-ES-APPF',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Asia Pacific Property Flexible'
  },
  {
    'code': 'KTF25MA',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ไทย 25 เดือน A'
  },
  {
    'code': 'TW-E70',
    'name_th': 'กองทุนเปิด ทิสโก้ เวลธ์ โกรท E70'
  },
  {
    'code': 'ASP-AAA-R',
    'name_th': 'กองทุนเปิด แอสเซทพลัส แอคทีฟ แอสเซท แอลโลเคชั่น ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'ASP-AAA-A',
    'name_th': 'กองทุนเปิด แอสเซทพลัส แอคทีฟ แอสเซท แอลโลเคชั่น ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TFixed3Y1AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3Y1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFHHCARE-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเฮลธ์แคร์อิควิตี้เฮดจ์เอฟเอ็กซ์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFHHCARE-D',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลเฮลธ์แคร์อิควิตี้เฮดจ์เอฟเอ็กซ์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBAI25M1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ เอไอ 25M1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ONE-SETHD',
    'name_th': 'กองทุนเปิด วรรณ เซ็ท ไฮ ดิวิเดนด์ หุ้นทุน'
  },
  {
    'code': 'PRINCIPAL GINNO-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล อินโนเวชั่น ชนิดสะสมมูลค่า'
  },
  {
    'code': 'MT3Y1',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี 3 ปี ทวีสุข 1'
  },
  {
    'code': 'KCR3YC-AI',
    'name_th': 'กองทุนเปิดเค Complex Return 3YC ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTF25MB',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ไทย 25 เดือน B'
  },
  {
    'code': 'TFixed2Y3AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 2Y3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UCHINA',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ออล ไชน่า อิควิตี้ ฟันด์'
  },
  {
    'code': 'KGT5YB',
    'name_th': 'กองทุนเปิดเค การันตี 5 ปี B'
  },
  {
    'code': 'TGHDIGI',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล ดิจิตอล เฮลธ์ อิควิตี้'
  },
  {
    'code': 'KKP PLUS-F',
    'name_th': 'กองทุนเปิดเคเคพี ตราสารหนี้พลัส ชนิด F'
  },
  {
    'code': 'KKP ACT FIXED-F',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ ฟิกซ์ อินคัม ชนิด F'
  },
  {
    'code': 'KKP G-UBOND-H -F',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล อันคอนสเตรนด์ บอนด์เฮดจ์ ชนิด F'
  },
  {
    'code': 'T-MultiIncome',
    'name_th': 'กองทุนเปิดธนชาต มัลติ อินคัม'
  },
  {
    'code': 'KT-JPFUND-A',
    'name_th': 'กองทุนเปิดเคแทม เจแปน อิควิตี้ พาสซีฟ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ASP-DGOV-R',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เดลี่ พันธบัตรไทย ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'KKP SG-AA Extra',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น-Extra ชนิดทั่วไป'
  },
  {
    'code': 'KKP SG-AA Light',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น-Light ชนิดทั่วไป'
  },
  {
    'code': 'KFSUPERRMF',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดีเริ่ดเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFSUPER',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดีเริ่ด'
  },
  {
    'code': 'MN-AEPLUS-A',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ เอเชียน อิควิตี้ พลัส เอฟไอเอฟ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'B-TOPTENLTF',
    'name_th': 'กองทุนเปิดบัวหลวงทศพลหุ้นระยะยาว'
  },
  {
    'code': 'TCINC',
    'name_th': 'กองทุนเปิด ทิสโก้ คอนเซอเวทีฟ อินคัม'
  },
  {
    'code': 'KT-SAGA-A',
    'name_th': 'กองทุนเปิดกรุงไทย สตราทีจิค แอคทีฟ โกลบอล แอลโลเคชั่น ชนิดสะสมมูลค่า'
  },
  {
    'code': 'UFM2Y1',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฟิกซ์ แมชชัวริตี้ 2Y1'
  },
  {
    'code': 'KTF3YA-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ไทย 3 ปี A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHESG-A',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นไทย ESG ชนิดบุคคลธรรมดา'
  },
  {
    'code': 'LHESG-IR',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นไทย ESG ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'ONE-GECOM',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล อีคอมเมิร์ซ'
  },
  {
    'code': 'KCR3YD-AI',
    'name_th': 'กองทุนเปิดเค Complex Return 3YD ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UDAILY',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เดลี่ ลิควิดดิตี้ ฟันด์'
  },
  {
    'code': 'ASP-IHEALTH',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อินโนเวทีฟ เฮลธ์แคร์'
  },
  {
    'code': 'WE-MONEY-R',
    'name_th': 'กองทุนเปิด วี มันนี่ มาร์เก็ต ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'WE-INCOME',
    'name_th': 'กองทุนเปิด วี ฟิกซ์ อินคัม'
  },
  {
    'code': 'UFM2Y2',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฟิกซ์ แมชชัวริตี้ 2Y2'
  },
  {
    'code': 'M-MEGA-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี หุ้นไทย เมกะ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'M-MEGA-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี หุ้นไทย เมกะ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'TFixed3Y2AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 3Y2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UOBLTF-D',
    'name_th': 'กองทุนเปิด ยูโอบี หุ้นระยะยาว ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'UJSMRMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เจแปน สมอล แอนด์ มิด แคป ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': '1AMSET50-ID',
    'name_th': 'กองทุนเปิด วรรณเอเอ็มเซ็ท 50 ชนิดจ่ายเงินปันผล สำหรับบุคคลธรรมดา และนิติบุคคล'
  },
  {
    'code': 'ONE-COMPLEX3Y1',
    'name_th': 'กองทุนเปิด วรรณ คอมเพล็กซ์ รีเทิร์น 3Y1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TISCOWB',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นไทย Well-being'
  },
  {
    'code': 'T-SET50Acc',
    'name_th': 'กองทุนเปิดธนชาต SET50 สะสมมูลค่า'
  },
  {
    'code': 'K-CHANGE-A(A)',
    'name_th': 'กองทุนเปิดเค พอสซิทีฟ เชนจ์ หุ้นทุน-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'BCAP-GW25',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 25'
  },
  {
    'code': 'BCAP-GW10',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 10'
  },
  {
    'code': 'BCAP-GW50',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 50'
  },
  {
    'code': 'BCAP-GW75',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 75'
  },
  {
    'code': 'BCAP-GW90',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 90'
  },
  {
    'code': 'KFHTECH-A',
    'name_th': 'กองทุนเปิดกรุงศรีเวิล์ดเทคอิควิตี้เฮดจ์เอฟเอ็กซ์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TCHLINK8',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า ลิ้งค์ คอมเพล็กซ์ รีเทิร์น 8 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UDBC3Y1',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไดนามิค บอนด์ คอมเพล็กซ์ รีเทิร์น ฟันด์ 3Y1'
  },
  {
    'code': 'SCBSET50E',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET50 INDEX (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBNK225E',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นญี่ปุ่น (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBGOLDHE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ THB เฮดจ์ (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBGOLDE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBENERGYE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET ENERGY SECTOR INDEX (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBCHAE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นจีนเอแชร์ (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBCEHE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน THB เฮ็ดจ์ (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBCEE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นจีน (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBBANKINGE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ SET BANKING SECTOR INDEX (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBTMFPLUS-E',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ตราสารรัฐตลาดเงิน พลัส-ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'SCBS&P500E',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยูเอส (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBKEQTGE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นเกาหลี (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBEUEQE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยุโรป (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBINDIAE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นอินเดีย (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'PRINCIPAL GEF-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล อิควิตี้ ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'MSI2AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TAREIT',
    'name_th': 'กองทุนเปิด ทิสโก้ เอเชียน รีท'
  },
  {
    'code': 'ONE-COMPLEX3YA',
    'name_th': 'กองทุนเปิด วรรณ คอมเพล็กซ์ รีเทิร์น 3YA ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'K-GPE19A-UI',
    'name_th': 'กองทุนเปิดเค โกลบอลไพรเวทอิควิตี้ 19A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTF4YA-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ไทย 4 ปี A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KT-EMEQ-A',
    'name_th': 'กองทุนเปิดเคแทม อีเมอร์จิ้ง มาร์เก็ตส์ อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KKP PGE-H',
    'name_th': 'กองทุนเปิดเคเคพี พาสซีฟ โกลบอล อิควิตี้ เฮดจ์ ชนิดทั่วไป'
  },
  {
    'code': 'UDBC3Y2',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไดนามิค บอนด์ คอมเพล็กซ์ รีเทิร์น ฟันด์ 3Y2'
  },
  {
    'code': 'MPII-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิล อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'ASP-LEGACY-UI',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เลกาซี่ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TISCOCHA-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า A-Shares อิควิตี้ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'TCHLINK9',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า ลิ้งค์ คอมเพล็กซ์ รีเทิร์น 9'
  },
  {
    'code': 'TFixed2Y5AI',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ 2Y5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBGOLDHP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ THB เฮดจ์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBAEMP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ เอเชียน อีเมอร์จิ้ง มาร์เก็ต ฟันด์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBBLNP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ บิลเลียนแนร์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBCHEQP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ออล ไชน่า อิควิตี้ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'ONE-DELIGHT-RA',
    'name_th': 'กองทุนเปิด วรรณ ดีไลท์ ชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'ONE-DELIGHT-RD',
    'name_th': 'กองทุนเปิด วรรณ ดีไลท์ ชนิดจ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'SCBDIGIP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลดิจิตอล (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'TMB-ES-GCORE',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Global Core Equity'
  },
  {
    'code': 'TFIXPVD',
    'name_th': 'กองทุนเปิด ทิสโก้ ฟิกซ์ อินคัม ซีเล็ค สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TBONDPVD',
    'name_th': 'กองทุนเปิด ทิสโก้ พันธบัตร 1 ปี สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBMILDA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์มิกซ์ มายด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBCLASSICA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์มิกซ์ คลาสสิก ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBSPICYA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์มิกซ์ สไปซี่ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTGF4Y1',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล ฟิกซ์ อินคัม 4Y1'
  },
  {
    'code': 'SCBLEQP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้น LOW VOLATILITY (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBJPSMP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นญี่ปุ่นสมอลแคป (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBGIFP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล อินฟราสตรัคเจอร์ อิควิตี้ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'KT-CARE-A',
    'name_th': 'กองทุนเปิดกรุงไทย เวลท์ แคร์ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBGEQP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลบอล อิควิตี้ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBUSSMP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ยูเอสสมอลแคป (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBEMEQP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นตลาดเกิดใหม่ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'K-HIT',
    'name_th': 'กองทุนเปิดเค โกลบอล ไฮ อิมแพ็ค ธีมาติก หุ้นทุน'
  },
  {
    'code': 'KHY23A-UI',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท ไฮยีลด์ 2023A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UDBC3Y3',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไดนามิค บอนด์ คอมเพล็กซ์ รีเทิร์น ฟันด์ 3Y3'
  },
  {
    'code': 'KPVDEQ',
    'name_th': 'กองทุนเปิดเค หุ้นทุน สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'KPVDFI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'KPVDSF',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ระยะสั้น สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'WE-GTECH',
    'name_th': 'กองทุนเปิด วี โกลบอล เทคโนโลยี'
  },
  {
    'code': 'PVDFP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PVDFPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดพิเศษ'
  },
  {
    'code': 'PVDSP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PVDSPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดพิเศษ'
  },
  {
    'code': 'PVDTP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารรัฐตลาดเงิน พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PVDTPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารรัฐตลาดเงิน พลัส สำหรับกองทุนสำรองเลี้ยงชีพ ชนิดพิเศษ'
  },
  {
    'code': 'UCHINARMF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ออล ไชน่า อิควิตี้ ฟันด์ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PVDKTSS',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารตลาดเงินสำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'PVDKTFIX-1Y3Y',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ระยะ 1 ถึง 3 ปี สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TCMFPVD',
    'name_th': 'กองทุนเปิด ไทย แคช แมเนจเม้นท์ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TFIFPVD',
    'name_th': 'กองทุนเปิด ไทย ตราสารหนี้ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'BEPVD',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารทุนสำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'BFPVD',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารหนี้สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'BTPVD',
    'name_th': 'กองทุนเปิดบัวหลวงตราสารหนี้ภาครัฐสำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'KT-TRIG2',
    'name_th': 'กองทุนเปิดกรุงไทย ทริกเกอร์ ฟันด์2'
  },
  {
    'code': 'LHDEBTPVD',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'LHMMPVD',
    'name_th': 'กองทุนเปิด แอล เอช ตลาดเงิน สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'MSHORTPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ตราสารหนี้ระยะสั้น สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL iFIXEDPVD',
    'name_th': 'กองทุนเปิดพรินซิเพิล คอร์ ฟิกซ์ อินคัม สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TMB-ES- PVD-FIX',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง ตราสารหนี้ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TMB-ES-PVD-MONEY',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง ตลาดเงิน สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TMB-ES- PVD-STFIX',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง ตราสารหนี้ระยะสั้น สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'TMB-ES- PVD-TREASURY',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง ตลาดเงินภาครัฐ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBCR3YA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 3YA ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ABMM–MF PVD',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ตราสารตลาดเงิน สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'ABMI-MF PVD',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด แบบผสม สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'LHOPP',
    'name_th': 'กองทุนเปิด แอล เอช ออพพอร์ทูนิตี้'
  },
  {
    'code': 'ABFI–MF PVD',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ตราสารหนี้ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'T-GlobalESG',
    'name_th': 'กองทุนเปิดธนชาต หุ้นโลกยั่งยืน'
  },
  {
    'code': 'K-USXNDQ-A(A)',
    'name_th': 'กองทุนเปิดเค หุ้นยูเอส ดัชนีเอ็นดีคิว 100-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBRAAA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Robo Asset Allocation ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ONE-TOP5MA',
    'name_th': 'กองทุนเปิด วรรณ ท็อป ซีเล็คชั่น 5MA'
  },
  {
    'code': 'KTSUPAI5',
    'name_th': 'กองทุนเปิดกรุงไทย ธนทรัพย์ 5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'MSI3AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBGPROPP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล พร็อพเพอร์ตี้ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'B-IR-FOF',
    'name_th': 'กองทุนเปิดฟันด์ออฟฟันด์บัวหลวงโครงสร้างพื้นฐานและอสังหาริมทรัพย์'
  },
  {
    'code': 'SCBROBOP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอลโรโบติกส์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBPGFP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ แพลทตินัม โกลบอล ฟันด์ (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBRMPIN',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTGF30M1',
    'name_th': 'กองทุนเปิดเคแทม โกลบอล ฟิกซ์ อินคัม 30M1'
  },
  {
    'code': 'SCBRMS&P500',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยูเอส เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBRMLEQ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้น Low Volatility เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'MPII-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิล อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TGREIT',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล รีท'
  },
  {
    'code': 'TMB-ES-IALLO',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Income Allocation'
  },
  {
    'code': 'K-FIXEDPRO',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ โปรแอคทีฟ'
  },
  {
    'code': 'K-USA-A(A)',
    'name_th': 'กองทุนเปิด เค ยูเอสเอ หุ้นทุน-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL GBRAND-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล แบรนด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'MSI4AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 4 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UROCK',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-ร็อค ฟันด์'
  },
  {
    'code': 'UPOP',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-ป๊อบ ฟันด์'
  },
  {
    'code': 'UJAZZ',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-แจ๊ส ฟันด์'
  },
  {
    'code': 'KFGBRAND-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลแบรนด์อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KFGPROP-A',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลพร็อพเพอร์ตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TCIEZERO',
    'name_th': 'กองทุนเปิด ทิสโก้ คอนเซอเวทีฟ อินคัม - อิควิตี้ Zero'
  },
  {
    'code': 'K-GLAM-UI',
    'name_th': 'กองทุนเปิดเค โกลบอล ริสก์ แอลโลเคชั่น ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'WE-GOLD',
    'name_th': 'กองทุนเปิด วี โกลด์ แอนด์ ซิลเวอร์ อิควิตี้'
  },
  {
    'code': 'KT-ESG-A',
    'name_th': 'กองทุนเปิดกรุงไทย ก่อการดี'
  },
  {
    'code': 'KFPREFER-A',
    'name_th': 'กองทุนเปิดกรุงศรีพรีเฟอร์มิกซ์เฮดจ์เอฟเอ็กซ์'
  },
  {
    'code': 'LHPROPG-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล พร็อพเพอร์ตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KAB22A',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท เอเชียน บอนด์ 2022A'
  },
  {
    'code': 'WE-MULTI',
    'name_th': 'กองทุนเปิด วี มัลติ แอสเซท อินคัม'
  },
  {
    'code': 'K-STAR-I(D)',
    'name_th': 'กองทุนเปิดเค สตาร์ หุ้นทุน-I ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'MDIVA-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ดิวิเดนด์ เอเชีย ชนิดสะสมมูลค่า สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'MDIVA-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ดิวิเดนด์ เอเชีย ชนิดจ๋ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'PRINCIPAL iPROP-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล พร็อพเพอร์ตี้ อินคัม ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'PRINCIPAL EEF-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ อิควิตี้ ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'B-IR-FOFRMF',
    'name_th': 'กองทุนเปิดฟันด์ออฟฟันด์บัวหลวงโครงสร้างพื้นฐาน&อสังหาริมทรัพย์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL GEF-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล อิควิตี้ ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'PRINCIPAL iGOLD-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลด์ อินคัม ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'PRINCIPAL DPLUS-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม พลัส ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'PRINCIPAL iFIXED-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล คอร์ ฟิกซ์ อินคัม ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'BCAP-MFIX',
    'name_th': 'กองทุนเปิดบีแคป ตราสารหนี้ระยะกลาง'
  },
  {
    'code': 'ONE-DISC-RA',
    'name_th': 'กองทุนเปิด วรรณ ดิสคัฟเวอรี่ ชนิดไม่จ่ายเงินปันผล สำหรับผู้ลงทุนทั่วไป'
  },
  {
    'code': 'T-SET50RMF',
    'name_th': 'กองทุนเปิดธนชาต SET50 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KT-ESG RMF',
    'name_th': 'กองทุนเปิดกรุงไทย ก่อการดี เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KPROPIRMF',
    'name_th': 'กองทุนเปิดเค Property Infra Flexible เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'PRINCIPAL iPROPEN-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซ์ อินคัม ชนิดสะสมมูลค่า'
  },
  {
    'code': 'PRINCIPAL iPROPEN-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซ์ อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MPII-ID',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิล อินคัม (ID)'
  },
  {
    'code': 'WE-USREIT',
    'name_th': 'กองทุนเปิด วี ยูเอส เรียลเอสเตท ซีเคียวริตี้'
  },
  {
    'code': 'KFENFIX',
    'name_th': 'กองทุนเปิดกรุงศรีเอ็นแฮนซ์แอคทีฟตราสารหนี้'
  },
  {
    'code': 'KHY23B-UI',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท ไฮยีลด์ 2023B ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BPLUS',
    'name_th': 'กองทุนเปิด บริลเลียนท์ พลัส ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'BPLUS-R',
    'name_th': 'กองทุนเปิด บริลเลียนท์ พลัส ฟันด์ ชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'SCBEQUALA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Equal Weight Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBLARGEA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Large-Cap Multi-Factor Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBVALUEA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Value Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBQUALITYA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Quality Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBMOMENTA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Momentum Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'WE-GEQUITY',
    'name_th': 'กองทุนเปิด วี โกลบอล อิควิตี้'
  },
  {
    'code': 'SCBVALUEE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Value Portfolio (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBQUALITYE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Quality Portfolio (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBLARGEE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Large-Cap Multi-Factor Portfolio (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBEQUALE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Equal Weight Portfolio (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'SCBMOMENTE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Thai Equity Momentum Portfolio (ชนิดช่องทางอิเล็กทรอนิกส์)'
  },
  {
    'code': 'K-MBOND',
    'name_th': 'กองทุนเปิดเค มัลติ-สตราทีจี บอนด์ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BCAP-GE',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล อิควิตี้'
  },
  {
    'code': 'K-WORLDX',
    'name_th': 'กองทุนเปิดเค โกลบอล อิควิตี้ พาสซีฟ'
  },
  {
    'code': 'KTAF30M1',
    'name_th': 'กองทุนเปิดเคแทม เอเชียน ฟิกซ์ อินคัม 30M1'
  },
  {
    'code': 'LHAFIX22A',
    'name_th': 'กองทุนเปิด แอล เอช เอเชียน ฟิกซ์ อินคัม 22A'
  },
  {
    'code': 'TMB-ES-GSBOND',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Global Smart Bond'
  },
  {
    'code': 'T-FixFIF1Y41',
    'name_th': 'กองทุนเปิดธนชาตตราสารหนี้ต่างประเทศ 1Y41'
  },
  {
    'code': 'SMART-PLUS',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท ฟิกซ์ อินคัม พลัส'
  },
  {
    'code': 'WE-GSECURE',
    'name_th': 'กองทุนเปิด วี โกลบอล ซีเคียวริตี้ อิควิตี้'
  },
  {
    'code': 'KFFAI1Y1',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 1Y1 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'PRINCIPAL iBALANCED-D',
    'name_th': 'กองทุนเปิดพรินซิเพิล บาลานซ์ อินคัม ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBPINP',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล (ชนิดผู้ลงทุนกลุ่ม/บุคคล)'
  },
  {
    'code': 'SCBDPLUSA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Diversified Income Plus (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBSPLUSA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Smart Income Plus (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBASF1YA2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 1YA2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BCAP-GFIA',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล ฟิกซ์ อินคัม แอลโลเคชั่น'
  },
  {
    'code': 'T-ES-GTech',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง โกลบอล เทคโนโลยี'
  },
  {
    'code': 'KFFAI1Y2',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 1Y2 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'SCBASF1YA3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 1YA3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ONE-UGG-IA',
    'name_th': 'กองทุนเปิดวรรณ อัลติเมท โกลบอล โกรว์ธ หน่วยลงทุนชนิดไม่จ่ายเงินปันผล สำหรับบุคคลธรรมดา และนิติบุคคล'
  },
  {
    'code': 'ASP-PROPIN-A',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อสังหาริมทรัพย์และโครงสร้างพื้นฐาน เฟล็กซิเบิ้ล ชนิดสะสมมูลลค่า'
  },
  {
    'code': 'ASP-PROPIN-R',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อสังหาริมทรัพย์และโครงสร้างพื้นฐาน เฟล็กซิเบิ้ล ชนิดรับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'KFFAI1Y3',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 1Y3 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'TCHTECH-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า เทคโนโลยี อิควิตี้ ชนิดหน่วยลงทุน A'
  },
  {
    'code': 'KTAF30M2',
    'name_th': 'กองทุนเปิดเคแทม เอเชียน ฟิกซ์ อินคัม 30M2'
  },
  {
    'code': 'TTHREIT',
    'name_th': 'กองทุนเปิด ทิสโก้ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล'
  },
  {
    'code': 'ONE-COMPLEX1YMIXED',
    'name_th': 'กองทุนเปิด วรรณ คอมเพล็กซ์ รีเทิร์น 1Y MIXED ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KAB22B',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท เอเชียน บอนด์ 2022B'
  },
  {
    'code': 'UINC-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม ฟันด์-หน่วยลงทุนชนิดรับซื้อคืนหน่วยลงทุนแบบดุลยพินิจของผู้ลงทุน'
  },
  {
    'code': 'M-MULTI-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี มัลติ แอสเซ็ท ชนิดสะสมมูลค่า'
  },
  {
    'code': 'M-MULTI-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี มัลติ แอสเซ็ท ชนดิจ่ายเงินปันผล'
  },
  {
    'code': 'T-ES-CHINA A',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง China A Active'
  },
  {
    'code': 'TMB-ES-CHINA-A',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง China A Active'
  },
  {
    'code': 'KKP GINFRAEQ-H',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล อินฟราสตรัคเจอร์ อิควิตี้ เฮดจ์ ชนิดทั่วไป'
  },
  {
    'code': 'UINC-A',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อินคัม ฟันด์ หน่วยลงทุนชนิดรับซื้อคืนหน่วยลงทุนอัตโนมัติ'
  },
  {
    'code': 'TBIOTECH',
    'name_th': 'กองทุนเปิด ทิสโก้ ไบโอเทคโนโลยี เฮลธ์แคร์'
  },
  {
    'code': 'WE-TRBOND-A',
    'name_th': 'กองทุนเปิด วี โทเทิล รีเทิร์น บอนด์ ชนิดไม่จ่ายเงินปันผล'
  },
  {
    'code': 'KKP DIVIDEND-F',
    'name_th': 'กองทุนเปิดเคเคพี ดิวิเดนด์ อิควิตี้ หน่วยลงทุนชนิด F*'
  },
  {
    'code': 'KKP MP-F',
    'name_th': 'กองทุนเปิดเคเคพี มันนี่ โพสิทีฟ หน่วยลงทุนชนิด F*'
  },
  {
    'code': 'KKP PROP-D-F',
    'name_th': 'กองทุนเปิดเคเคพี พร็อพเพอร์ตี้ เซคเตอร์ - ดิวิเดนด์ หน่วยลงทุนชนิด F*'
  },
  {
    'code': 'KKP GNP-H-F',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล นิว เพอร์สเปกทีฟ เฮดจ์ หน่วยลงทุนชนิด F*'
  },
  {
    'code': 'KKP PGE-H-F',
    'name_th': 'กองทุนเปิดเคเคพี พาสซีฟ โกลบอล อิควิตี้ เฮดจ์ ชนิด F*'
  },
  {
    'code': 'M-FOCUS',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โฟกัส อิควิตี้'
  },
  {
    'code': 'PBOND',
    'name_th': 'กองทุนเปิดฟิลลิปตราสารหนี้ไทย'
  },
  {
    'code': 'PRINCIPAL iDAILY-E',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ อินคัม ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'PRINCIPAL SET50-E',
    'name_th': 'กองทุนเปิดพรินซิเพิล เดลี่ เซ็ท 50 อินเด็กซ์ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHWPLUS-A',
    'name_th': 'กองทุนเปิด แอล เอช เวลท์ พลัส ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHWPLUS-D',
    'name_th': 'กองทุนเปิด แอล เอช เวลท์ พลัส ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MSI5AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFAFIXSSF',
    'name_th': 'กองทุนเปิดกรุงศรีแอคทีฟตราสารหนี้-เพื่อการออม'
  },
  {
    'code': 'KFCASHSSF',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารเงิน-เพื่อการออม'
  },
  {
    'code': 'KFENS50SSF',
    'name_th': 'กองทุนเปิดกรุงศรีเอ็นแฮนซ์เซ็ท 50-เพื่อการออม'
  },
  {
    'code': 'KFHAPPYSSF',
    'name_th': 'กองทุนเปิดกรุงศรีชีวิตดี๊ดี-เพื่อการออม'
  },
  {
    'code': 'PRINCIPAL iPROPEN-SSF',
    'name_th': 'กองทุนเปิดพรินซิเพิล เอ็นแฮนซ์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซ์ อินคัม SSF'
  },
  {
    'code': 'PRINCIPAL TDIF-SSF',
    'name_th': 'กองทุนเปิดพรินซิเพิล ไทย ไดนามิก อินคัม อิควิตี้ SSF'
  },
  {
    'code': 'WE-THEQ-A',
    'name_th': 'กองทุนเปิด วี ไทย อิควิตี้ ชนิดไม่จ่ายเงินปันผล'
  },
  {
    'code': 'T-ES-GSBOND',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Smart Bond'
  },
  {
    'code': 'B-ENHANCED',
    'name_th': 'กองทุนเปิดบัวหลวงเพิ่มพูน'
  },
  {
    'code': 'BCAP-GPROP',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซ์'
  },
  {
    'code': 'MS-CORE LTF-N',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ คอร์ หุ้นระยะยาว ชนิดไม่ได้ลดหย่อนภาษี'
  },
  {
    'code': 'SCB70-SSFX',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ผสม 70/30 เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'SCBSET-SSFX',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ ดัชนี SET เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'SCBEQ-SSFX',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นไทยแอคทีฟ เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'BCAP-USND100',
    'name_th': 'กองทุนเปิดบีแคป หุ้นยูเอส เอ็นดี 100'
  },
  {
    'code': 'KT70/30S-SSFX',
    'name_th': 'กองทุนเปิดกรุงไทย 70/30 เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'KTESGS-SSFX',
    'name_th': 'กองทุนเปิดกรุงไทย ก่อการดี เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'UOBEQ-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ตราสารทุน เพื่อการออม'
  },
  {
    'code': 'T-ES-EQDSSFX',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง หุ้นทุนปันผลเพื่อการออมพิเศษ'
  },
  {
    'code': 'BEQSSF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นไทยเพื่อการออม'
  },
  {
    'code': 'KKP SET50 ESG-SSFX',
    'name_th': 'กองทุนเปิดเคเคพี SET50 ESG ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'KFS100SSFX',
    'name_th': 'กองทุนเปิดกรุงศรี SET100-เพื่อการออมพิเศษ'
  },
  {
    'code': 'UOBEQ-SSFX',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ตราสารทุน เพื่อการออมพิเศษ'
  },
  {
    'code': 'PRINCIPAL TDIF-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล ไทย ไดนามิก อินคัม อิควิตี้ ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'PRINCIPAL TDIF-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล ไทย ไดนามิก อินคัม อิควิตี้ ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'K-SUPSTAR-SSFX',
    'name_th': 'กองทุนเปิดเค ซูเปอร์สตาร์ เพื่อการออมพิเศษ'
  },
  {
    'code': 'PRINCIPAL GMV-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล แมเนจ โวลาติลิตี้ อิควิตี้ ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'PRINCIPAL GMV-X',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล แมเนจ โวลาติลิตี้ อิควิตี้ ชนิดผู้ลงทุนพิเศษ'
  },
  {
    'code': 'MS-CORE SSF',
    'name_th': 'กองทุนเปิด แมนูไลฟ์ สเตร็งค์ คอร์ หุ้นระยะยาว ชนิดเพื่อการออม'
  },
  {
    'code': 'TEG-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นทุน เพื่อการออม'
  },
  {
    'code': 'LHSMARTDSSF-SSF',
    'name_th': 'กองทุนเปิด แอล เอช สมาร์ท เพื่อการออม ชนิดการออมและจ่ายเงินปันผล'
  },
  {
    'code': 'TEG-SSFX',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นทุน เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'LHSMARTDSSF-SSFX',
    'name_th': 'กองทุนเปิด แอล เอช สมาร์ท เพื่อการออม ชนิดการออมพิเศษและจ่ายเงินปันผล'
  },
  {
    'code': 'MTF-SSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไทยเฟล็กซิเบิล เพื่อการออม ชนิดเพื่อการออม'
  },
  {
    'code': 'MTF-SSFX',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไทยเฟล็กซิเบิล เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'MTQ-SSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี หุ้นไทย เพื่อการออม ชนิดเพื่อการออม'
  },
  {
    'code': 'MTQ-SSFX',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี หุ้นไทย เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'PRINCIPAL SET50SSF-SSF',
    'name_th': 'กองทุนเปิดพรินซิเพิล เซ็ท 50 อินเด็กซ์เพื่อการออม ชนิดเพื่อการออม'
  },
  {
    'code': 'PRINCIPAL SET50SSF-SSFX',
    'name_th': 'กองทุนเปิดพรินซิเพิล เซ็ท 50 อินเด็กซ์เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'ASP-SME-SSFX',
    'name_th': 'กองทุนเปิด แอสเซทพลัส สมอล แอนด์ มิด แคป อิควิตี้ เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'ONE-TCMSSF-SSFX',
    'name_th': 'กองทุนเปิด วรรณ สนับสนุนตลาดทุนไทย เพื่อการออม ชนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'WE-BOND6M',
    'name_th': 'กองทุนเปิด วี ตราสารหนี้ 6M ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ONE-TCMSSF-SSF',
    'name_th': 'กองทุนเปิด วรรณ สนับสนุนตลาดทุนไทย เพื่อการออม ชนิดเพื่อการออม'
  },
  {
    'code': 'UJAZZ-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-แจ๊ส ฟันด์ หน่วยลงทุนชนิดเพื่อการออม'
  },
  {
    'code': 'UPOP-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-ป๊อป ฟันด์ - หน่วยลงทุนชนิดเพื่อการออม'
  },
  {
    'code': 'UROCK-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฮาร์โมนี-ร็อค ฟันด์ - หน่วยลงทุนชนิดเพื่อการออม'
  },
  {
    'code': 'KFGBRANSSF',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลแบรนด์อิควิตี้ปันผลเพื่อการออม'
  },
  {
    'code': 'KFDIVSSF',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นปันผลเพื่อการออม'
  },
  {
    'code': 'KKP SG-AA-SSF',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น ชนิดเพื่อการออม'
  },
  {
    'code': 'K-STAR-SSF',
    'name_th': 'กองทุนเปิดเค สตาร์ หุ้นทุน ชนิดเพื่อการออม'
  },
  {
    'code': 'K-FIXEDPLUS-SSF',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ พลัส ชนิดเพื่อการออม'
  },
  {
    'code': 'BCAP-TEQ',
    'name_th': 'กองทุนเปิดบีแคป ไทย อิควิตี้'
  },
  {
    'code': 'ONE-ALLCHINA-ASSF',
    'name_th': 'กองทุนเปิด วรรณ ออล ไชน่า อิควิตี้ หน่วยลงทุนชนิดเพื่อการออม แบบไม่จ่ายเงินปันผล'
  },
  {
    'code': 'ONE-UGG-ASSF',
    'name_th': 'กองทุนเปิดวรรณ อัลติเมท โกลบอล โกรว์ธ หน่วยลงทุนชนิดเพื่อการออม แบบไม่จ่ายเงินปันผล'
  },
  {
    'code': 'K-CHANGE-SSF',
    'name_th': 'กองทุนเปิดเค พอสซิทีฟ เชนจ์ หุ้นทุน ชนิดเพื่อการออม'
  },
  {
    'code': 'K-GINCOME-SSF',
    'name_th': 'กองทุนเปิดเค โกลบอล อินคัม ชนิดเพื่อการออม'
  },
  {
    'code': 'UEDTECH',
    'name_th': 'กองทุนเปิด ยูไนเต็ด เอ็ดดูเคชั่น เทคโนโลยี ฟันด์'
  },
  {
    'code': 'BCAP-GFIO',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล ฟิกซ์ อินคัม ออพพอร์ทูนิตี้'
  },
  {
    'code': 'MGFGD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส ชนิดผู้ลงทุนทั่วไปที่รับเงินปันผล'
  },
  {
    'code': 'KKP ACT EQ-SSF',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ อิควิตี้ ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP ACT FIXED-SSF',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ ฟิกซ์ อินคัม ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP MP-SSF',
    'name_th': 'กองทุนเปิดเคเคพี มันนี่ โพสิทีฟ ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP PGE-H-SSF',
    'name_th': 'กองทุนเปิดเคเคพี พาสซีฟ โกลบอล อิควิตี้ เฮดจ์ ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP PROP-D-SSF',
    'name_th': 'กองทุนเปิดเคเคพี พร็อพเพอร์ตี้ เซคเตอร์ – ดิวิเดนด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP SET50 ESG-SSF',
    'name_th': 'กองทุนเปิดเคเคพี SET50 ESG ชนิดเพื่อการออม'
  },
  {
    'code': 'KFDIVERS-A',
    'name_th': 'กรุงศรีไดเวอร์ซิไฟด์อินคัม-สะสมมูลค่า'
  },
  {
    'code': 'KFDIVERS-R',
    'name_th': 'กรุงศรีไดเวอร์ซิไฟด์อินคัม-รับซื้อคืนอัตโนมัติ'
  },
  {
    'code': 'KTSUPAI7',
    'name_th': 'กองทุนเปิดกรุงไทย ธนทรัพย์ 7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KKP SG-AA Extra-SSF',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น-Extra ชนิดเพื่อการออม'
  },
  {
    'code': 'KKP SG-AA Light-SSF',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น-Light ชนิดเพื่อการออม'
  },
  {
    'code': 'PRINCIPAL iGOLD-C',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลด์ อินคัม ชนิดผู้ลงทุนกลุ่ม'
  },
  {
    'code': 'WE-GIHEALTH',
    'name_th': 'กองทุนเปิด วี โกลบอล อินโนเวทีฟ เฮลธ์แคร์'
  },
  {
    'code': 'BM70SSF',
    'name_th': 'กองทุนผสมบัวหลวง 70/30 เพื่อการออม'
  },
  {
    'code': 'ABTESSF',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ตราสารทุนไทย เพื่อการออม'
  },
  {
    'code': 'ABTESSFX',
    'name_th': 'กองทุนเปิด อเบอร์ดีน สแตนดาร์ด ตราสารทุนไทย เพื่อการออม ขนิดเพื่อการออมพิเศษ'
  },
  {
    'code': 'LHCHINA-A',
    'name_th': 'กองทุนเปิด แอล เอช อิควิตี้ ไชน่า ออพพอร์ทูนิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHCHINA-D',
    'name_th': 'กองทุนเปิด แอล เอช อิควิตี้ ไชน่า ออพพอร์ทูนิตี้ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'MPDIVSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ ดิวิเดนด์ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'MVMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเพิ่มค่าหุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'MIFMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีอิสลามิกหุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'MIFSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีอิสลามิกหุ้นระยะยาว ชนิดเพื่อการออม'
  },
  {
    'code': 'MVSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเพิ่มค่าหุ้นระยะยาว ชนิดเพื่อการออม'
  },
  {
    'code': 'KFGDIV-A',
    'name_th': 'กรุงศรีโกลบอลดิวิเดนด์เฮดจ์เอฟเอ็กซ์-สะสมมูลค่า'
  },
  {
    'code': 'KFGDIV-D',
    'name_th': 'กรุงศรีโกลบอลดิวิเดนด์เฮดจ์เอฟเอ็กซ์-ปันผล'
  },
  {
    'code': 'MDIVA-ID',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ดิวิเดนด์ เอเชีย ชนิดจ่ายเงินปันผล สำหรับผู้ลงทุนสถาบัน'
  },
  {
    'code': 'BCAP-GTAC',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล แทคทิเคิล'
  },
  {
    'code': 'ASP-TOPBRAND',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ท็อปแบรนด์ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ASP-X',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เอ็กซ์ตร้า โกรท ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TDSLTF-N',
    'name_th': 'กองทุนเปิด ทิสโก้ ดิวิเดนด์ ซีเล็ค หุ้นระยะยาว (N)'
  },
  {
    'code': 'TMSLTF-N',
    'name_th': 'กองทุนเปิด ทิสโก้ MID/SMALL CAP หุ้นระยะยาว (N)'
  },
  {
    'code': 'TDLTF-N',
    'name_th': 'กองทุนเปิด ทิสโก้ หุ้นระยะยาวปันผล (N)'
  },
  {
    'code': 'TISCOLTF-N',
    'name_th': 'กองทุนเปิด ทิสโก้หุ้นระยะยาว (N)'
  },
  {
    'code': '1S-LTF-NT',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มซีเล็คทีฟหุ้นระยะยาว หน่วยลงทุนชนิดไม่ได้รับสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': '1SG-LTF-NT',
    'name_th': 'กองทุนเปิดวรรณเอเอ็มซีเล็คทีฟโกรทหุ้นระยะยาว หน่วยลงทุนชนิดไม่ได้รับสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'KS50LTF-A(A)',
    'name_th': 'กองทุนเปิดเค เซ็ท 50 หุ้นระยะยาว-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KMVLTF-A(A)',
    'name_th': 'กองทุนเปิดเค มินิมั่ม โวลาติลิตี้ หุ้นระยะยาว-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KMSLTF-A(A)',
    'name_th': 'กองทุนเปิดเค Mid Small Cap หุ้นระยะยาว-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KGLTF-A(D)',
    'name_th': 'กองทุนเปิดเค โกรทหุ้นระยะยาวปันผล-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'KEQLTF-A(A)',
    'name_th': 'กองทุนเปิดเค หุ้นระยะยาว-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KDLTF-A(D)',
    'name_th': 'กองทุนเปิดเค หุ้นระยะยาวปันผล-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'K70LTF-A(D)',
    'name_th': 'กองทุนเปิดเค 70:30 หุ้นระยะยาวปันผล-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'K20SLTF-A(D)',
    'name_th': 'กองทุนเปิดเค 20 ซีเล็คท์หุ้นระยะยาวปันผล-A ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'SCBPLUSA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ อินคัมพลัส (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBFP-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ พลัส (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBSFFPLUS-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ระยะสั้น พลัส (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBSMART2-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์สมาร์ทแพลน 2 (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBDV-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นทุนปันผล (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBSE-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ซีเล็คท์อิควิตี้ ฟันด์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLT1-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวปันผล 70/30 (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLT2-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว พลัส (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLT3-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLT4-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวอินเตอร์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLTT-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวทาร์เก็ต (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLTSET-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว เซ็ท อินเด็กซ์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBPIN-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBGOLDH-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์โกลด์ THB เฮดจ์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KT70/30S-SSF',
    'name_th': 'กองทุนเปิดกรุงไทย 70/30 เพื่อการออม (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KT-PIF-SSF',
    'name_th': 'กองทุนเปิดกรุงไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KTESGS-SSF',
    'name_th': 'กองทุนเปิดกรุงไทย ก่อการดี เพื่อการออม (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBS&P500-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นยูเอส (ชนิดเพื่อการออม)'
  },
  {
    'code': 'SCBLEQ-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้น LOW VOLATILITY (ชนิดเพื่อการออม)'
  },
  {
    'code': 'ASP-GLTF-A',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นระยะยาวทวีกำไร ชนิดไม่มีประโยชน์ทางภาษี'
  },
  {
    'code': 'ASP-LTF-A',
    'name_th': 'กองทุนเปิดแอสเซทพลัสหุ้นระยะยาวชนิด จ่ายเงินปันผลและไม่มีสิทธิประโยชน์ทางภาษี'
  },
  {
    'code': 'ASP-SMELTF-A',
    'name_th': 'กองทุนเปิด แอสเซทพลัส สมอล์ แอนด์ มิด แคป อิควิตี้ หุ้นระยะยาวชนิดไม่มีประโยชน์ทางภาษี'
  },
  {
    'code': 'ASP-SME-SSF',
    'name_th': 'กองทุนเปิด แอสเซทพลัส สมอล แอนด์ มิด แคป อิควิตี้ ชนิดเพื่อการออม'
  },
  {
    'code': 'BMPVD',
    'name_th': 'กองทุนเปิดบัวหลวงมั่นคงสำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBGSIF-SSF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ โกลบอล สตราทีจิก อินเวสเมนท์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'WE-GEDUCATION',
    'name_th': 'กองทุนเปิด วี โกลบอล เอ็ดดูเคชั่น อิควิตี้'
  },
  {
    'code': 'MCHINAGD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไชน่า อิควิตี้ ชนิดผู้ลงทุนทั่วไปที่รับเงินปันผล'
  },
  {
    'code': 'KTMEE-SSF',
    'name_th': 'กองทุนเปิดกรุงไทยมีทรัพย์ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KTMUNG-SSF',
    'name_th': 'กองทุนเปิดกรุงไทยมั่งคั่ง (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KTSRI-SSF',
    'name_th': 'กองทุนเปิดกรุงไทยศรีสิริ (ชนิดเพื่อการออม)'
  },
  {
    'code': 'KTSUK-SSF',
    'name_th': 'กองทุนรวมเพื่อการออม ชนิดเพื่อการออม'
  },
  {
    'code': 'TCLOUD',
    'name_th': 'กองทุนเปิด ทิสโก้ Cloud Computing อิควิตี้'
  },
  {
    'code': 'LHPROPIA-DSSF',
    'name_th': 'กองทุนเปิด แอล เอช พร็อพเพอร์ตี้ อินฟรา เฟล็กซิเบิล A ชนิดเพื่อการออมและจ่ายเงินปันผล'
  },
  {
    'code': 'LHPROPIA-ASSF',
    'name_th': 'กองทุนเปิด แอล เอช พร็อพเพอร์ตี้ อินฟรา เฟล็กซิเบิล A ชนิดเพื่อการออมและสะสมมูลค่า'
  },
  {
    'code': 'LHSTRATEGY-DSSF',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดเพื่อการออมและจ่ายเงินปันผล'
  },
  {
    'code': 'LHSTRATEGY-ASSF',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดเพื่อการออมและสะสมมูลค่า'
  },
  {
    'code': 'LHGEQ-ASSF',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดเพื่อการออมและสะสมมูลค่า'
  },
  {
    'code': 'LHGEQ-DSSF',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดเพื่อการออมและจ่ายเงินปันผล'
  },
  {
    'code': 'KTGF1Y1',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y1'
  },
  {
    'code': 'T-ES-GCG',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Capital Growth'
  },
  {
    'code': 'KTGF1Y2',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y2'
  },
  {
    'code': 'I-SEQS-ASSF',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก ชนิดผู้ลงทุนเพื่อการออม (แบบสะสมมูลค่า)'
  },
  {
    'code': 'I-SEQS-RD',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก ชนิดผู้ลงทุนทั่วไป (แบบจ่ายเงินปันผล)'
  },
  {
    'code': 'I-SEQS-RA',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก ชนิดผู้ลงทุนทั่วไป (แบบสะสมมูลค่า)'
  },
  {
    'code': 'I-SEQS-ID',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก ID'
  },
  {
    'code': 'I-SEQS-IA',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก IA'
  },
  {
    'code': 'I-SEQS-DSSF',
    'name_th': 'กองทุนเปิดอินโนเทค หุ้นไทยยั่งยืนซิสเทมาติก ชนิดผู้ลงทุนเพื่อการออม (แบบจ่ายเงินปันผล)'
  },
  {
    'code': 'PRINCIPAL GEDTECH-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล เอ็ดดูเคชั่น เทค ชนิดสะสมมูลค่า'
  },
  {
    'code': 'TMB-ES-GCG',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Global Capital Growth'
  },
  {
    'code': 'K-GOLD-A(A)',
    'name_th': 'กองทุนเปิดเค โกลด์-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'SCBDM',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Dynamic'
  },
  {
    'code': 'B-INCOMESSF',
    'name_th': 'กองทุนเปิดบัวหลวงอินคัมเพื่อการออม'
  },
  {
    'code': 'B-FUTURESSF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นฟิวเจอร์เพื่อการออม'
  },
  {
    'code': 'MS50MF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เซ็ท 50 หุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'SCBASF6ME9',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6ME9 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KAB21A',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท เอเชียน บอนด์ 2021A'
  },
  {
    'code': 'KHY24A-UI',
    'name_th': 'กองทุนเปิดเค ฟิกซ์เดท ไฮยีลด์ 2024A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF21A',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021A'
  },
  {
    'code': 'MSI6AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 6 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE77',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์77 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE78',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์78 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TINC-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ อินคัม พลัส ชนิดเพื่อการออม'
  },
  {
    'code': 'SCBASF6MF1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KKP SG-AA Ultra Light',
    'name_th': 'กองทุนเปิดเคเคพี สตราทิจิค แอสเซ็ท อโลเคชั่น-Ultra Light'
  },
  {
    'code': 'SCBWIPA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ World Integrated Portfolio ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KT-LVTR-A',
    'name_th': 'กองทุนเปิดเคแทม โลวโว โทเทิล รีเทิร์น ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'MPDIVUNIT',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ ดิวิเดนด์ ฟันด์ ชนิดยูนิตลิงค์'
  },
  {
    'code': 'KT-Ashares-A',
    'name_th': 'กองทุนเปิดเคแทม ไชน่า เอแชร์ อิควิตี้ ฟันด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHMEGA-E',
    'name_th': 'กองทุนเปิด แอล เอช เมกะ เทรนด์ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHMEGA-D',
    'name_th': 'กองทุนเปิด แอล เอช เมกะ เทรนด์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHMEGA-A',
    'name_th': 'กองทุนเปิด แอล เอช เมกะ เทรนด์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KKP SET50 ESG',
    'name_th': 'กองทุนเปิดเคเคพี SET50 ESG ชนิดทั่วไป'
  },
  {
    'code': 'BCAP-TFACTOR',
    'name_th': 'กองทุนเปิดบีแคป ไทย อิควิตี้ ไดนามิค แฟคเตอร์'
  },
  {
    'code': 'MIPLUS',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี แฮปปี้ อินคัม พลัส'
  },
  {
    'code': 'SCBASF6MF2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BP5/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 5/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'WE-CHIG',
    'name_th': 'กองทุนเปิด วี ไชน่า โกรท'
  },
  {
    'code': 'SCBDM2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Dynamic 2'
  },
  {
    'code': 'KTFFE79',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์79 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHGOLDH-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลด์เฮดจ์ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHGOLDH-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลด์เฮดจ์ ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHGOLDH-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลด์เฮดจ์ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHDEBT-L',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ ชนิดผู้ถือหน่วยลงทุนกองทุนภายใต้การบริหารจัดการ'
  },
  {
    'code': 'SCBASF6MF3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE80',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์80 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BCAP-GW10 SSF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 10 เพื่อการออม'
  },
  {
    'code': 'BCAP-GW25 SSF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 25 เพื่อการออม'
  },
  {
    'code': 'BCAP-GW50 SSF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 50 เพื่อการออม'
  },
  {
    'code': 'BCAP-GW90 SSF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 90 เพื่อการออม'
  },
  {
    'code': 'BCAP-GW75 SSF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล เวลท์ 75 เพื่อการออม'
  },
  {
    'code': 'KTGF1Y3',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y3'
  },
  {
    'code': 'SCBASF6MF4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF4 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBCR1YE',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YE ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTHH',
    'name_th': 'กองทุนเปิดกรุงไทย ยกกำลังสุข(ภาพ)'
  },
  {
    'code': 'UESG',
    'name_th': 'กองทุนเปิด ยูไนเต็ด อิควิตี้ ซัสเทนเนเบิล โกลบอล ฟันด์'
  },
  {
    'code': 'KTGF1Y4',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y4'
  },
  {
    'code': 'MGAPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล อัลฟ่า ฟันด์ ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'KFF21C',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021C'
  },
  {
    'code': 'KFF21B',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021B'
  },
  {
    'code': 'KFF6MAA-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAA ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MZ-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 6MZ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MY-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 6MY ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MX-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 6MX ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'K-ASIACV',
    'name_th': 'กองทุนเปิดเค เอเชีย คอนโทรล โวลาติลิตี้'
  },
  {
    'code': 'KTFFE81',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์81 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBASF6MF5',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFS100-A',
    'name_th': 'กองทุนเปิดกรุงศรี SET100-สะสมมูลค่า'
  },
  {
    'code': 'KFS100SSF',
    'name_th': 'กองทุนเปิดกรุงศรี SET100-เพื่อการออม'
  },
  {
    'code': 'UOBSD-SSF',
    'name_th': 'กองทุนเปิด ยูโอบี ชัวร์ เดลี - หน่วยลงทุนชนิดเพื่อการออม'
  },
  {
    'code': 'UGQG-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ควอลิตี้ โกรท ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'LHCHINA-E',
    'name_th': 'กองทุนเปิด แอล เอช อิควิตี้ ไชน่า ออพพอร์ทูนิตี้ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'MRENEW-D',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี รีนิวเอเบิล เอนเนอร์จี ชนิดผู้ลงทุนทั่วไปที่รับเงินปันผล'
  },
  {
    'code': 'AIA-ST',
    'name_th': 'กองทุนเปิด เอไอเอ ตราสารหนี้ระยะสั้น'
  },
  {
    'code': 'AIA-TEQ',
    'name_th': 'กองทุนเปิด เอไอเอ ไทย อิควิตี้'
  },
  {
    'code': 'AIA-ES50',
    'name_th': 'กองทุนเปิด เอไอเอ เอ็นแฮนซ์ เซท 50'
  },
  {
    'code': 'AIA-IC',
    'name_th': 'กองทุนเปิด เอไอเอ อินคัม ฟันด์'
  },
  {
    'code': 'AIA-THDIS',
    'name_th': 'กองทุนเปิด เอไอเอ ไทย อิควิตี้ ดิสคัฟเวอรี่'
  },
  {
    'code': 'SCBASF6MF6',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF6 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BP6/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 6/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'IREITPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อินเตอร์เนชั่นแนล เรียลเอสเตท ฟันด์ ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBASF6MF7',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE82',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์82 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ASP-TFIXED 6M6',
    'name_th': 'กองทุนเปิดแอสเซทพลัสตราสารหนี้ทวีทรัพย์ 6เดือน6 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHDEBT-E',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHPROPINFRA-E',
    'name_th': 'กองทุนเปิด แอล เอช ไทย พร็อพเพอร์ตี้ แอนด์ อินฟราสตรัคเจอร์ เฟล็กซิเบิ้ล ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHSTRATEGY-E',
    'name_th': 'กองทุนเปิด แอล เอช สแทรทิจี อิควิตี้ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHPROPIA-E',
    'name_th': 'กองทุนเปิด แอล เอช พร็อพเพอร์ตี้ อินฟรา เฟล็กซิเบิล A ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'SCBDM3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Dynamic 3'
  },
  {
    'code': 'LHGEQ-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ ชนิดช่องทางอิเล็กทรอนิกล์'
  },
  {
    'code': 'LHWPLUS-E',
    'name_th': 'กองทุนเปิด แอล เอช เวลท์ พลัส ชนิดชองทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'SCBASF6MF8',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF8 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFFAI6M44',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M44 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'KTGF1Y5',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y5'
  },
  {
    'code': 'T-ES-GF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง GIS Global Bond Fund'
  },
  {
    'code': 'KTGF1Y6',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y6'
  },
  {
    'code': 'WE-OSHOP',
    'name_th': 'กองทุนเปิด วี ออนไลน์ ช้อปปิ้ง แอนด์ เพย์เม้นท์'
  },
  {
    'code': 'K-CLIMATE',
    'name_th': 'กองทุนเปิดเค Climate Transition'
  },
  {
    'code': 'SCBASF6MF9',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MF9 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBCR1YF',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YF ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE83',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์83 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'K-GTPE20A-UI',
    'name_th': 'กองทุนเปิดเค Global Tech PE 20A ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF21D',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021D'
  },
  {
    'code': 'KFF21E',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021E'
  },
  {
    'code': 'MSI7AI',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สเตเบิ้ล อินคัม 7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAF-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAF ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAE-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAE ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAD-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAD ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAC-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAC ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAB-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAB ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFLTF50-A',
    'name_th': 'กองทนุเปิดกรุงศรีหุ้นระยะยาว SET50-สะสมมูลค่า'
  },
  {
    'code': 'KFLTFD70-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวปันผล 70/30-ปันผล'
  },
  {
    'code': 'KFLTFDIV-D',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวปันผล-ปันผล'
  },
  {
    'code': 'KFLTFEQ-A',
    'name_th': 'กองทุนเปิดกรุงศรีหุ้นระยะยาวอิควิตี้้-สะสมมูลค่า'
  },
  {
    'code': 'SMARTSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี สมาร์ท ฟิกซ์ อินคัม ชนิดเพื่อการออม'
  },
  {
    'code': 'MMGOVSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พันธบัตรตลาดเงิน ชนิดเพื่อการออม'
  },
  {
    'code': 'UFFF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ฟิกซ์ อินคัม ฟันด์ ออฟ ฟันด์'
  },
  {
    'code': 'MMM-SSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีตราสารหนี้ระยะสั้น ชนิดเพื่อการออม'
  },
  {
    'code': 'LHGEQRMF',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFFAI6M45',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M45 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'SCBASF6MG1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BCAP-2030 RMF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล ทาร์เก็ต เดท 2030 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BCAP-2050 RMF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล ทาร์เก็ต เดท 2050 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BCAP-2040 RMF',
    'name_th': 'กองทุนเปิดบีแคป โกลบอล ทาร์เก็ต เดท 2040 เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBASF6MG2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'PRINCIPAL GCLOUD-A',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล คลาวด์ คอมพิวติ้ง ชนิดสะสมมูลค่า'
  },
  {
    'code': 'WE-MONYRMF',
    'name_th': 'กองทุนเปิด วี มันนี่ มาร์เก็ต เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTGF1Y7',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y7'
  },
  {
    'code': 'HIDIVPLUSUNIT',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ พลัส ชนิดยูนิตลิงต์'
  },
  {
    'code': 'TTECHRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ เทคโนโลยี อิควิตี้ เพื่อการเลี้ยงชีพ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'TTECHRMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้ เทคโนโลยี อิควิตี้ เพื่อการเลี้ยงชีพ ชนิดรองรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'WE-GOLDRMF',
    'name_th': 'กองทุนเปิด วี โกลด์ แอนด์ ซิลเวอร์ อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'ASP-EVOCHINARMF',
    'name_th': 'กองทุนเปิด แอสเซทพลัส อีโวลูชั่น ไชน่า อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'LHGLIFEE-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไลฟ์สไตล์ อิควิตี้ - ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHDIGITAL-E',
    'name_th': 'กองทุนเปิด แอล เอช ดิจิตอล อีโคโนมี ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHGLIFEE-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไลฟ์สไตล์ อิควิตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'BMAPS25',
    'name_th': 'กองทุนเปิดบัวหลวงบีแมพส์ 25'
  },
  {
    'code': 'BMAPS55',
    'name_th': 'กองทุนเปิดบัวหลวงบีแมพส์ 55'
  },
  {
    'code': 'BMAPS100',
    'name_th': 'กองทุนเปิดบัวหลวงบีแมพส์ 100'
  },
  {
    'code': 'BP7/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 7/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBASF6MG3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHPROPG-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล พร็อพเพอร์ตี้ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHPROPG-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล พร็อพเพอร์ตี้ ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHROBOTE-A',
    'name_th': 'กองทุนเปิด แอล เอช โรโบติกส์-E ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHROBOTE-E',
    'name_th': 'กองทุนเปิด แอล เอช โรโบติกส์-E ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'KKP TECH-H',
    'name_th': 'กองทุนเปิดเคเคพี EXPANDED TECH - HEDGED ชนิดทั่วไป'
  },
  {
    'code': 'KKP TECH-H-SSF',
    'name_th': 'กองทุนเปิดเคเคพี EXPANDED TECH - HEDGED ชนิดเพื่อการออม'
  },
  {
    'code': 'SCBCR1YG',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YG ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBASF6MG4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG4 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'PWINRMF',
    'name_th': 'กองทุนเปิดฟิลลิปเวิลด์อินโนเวชั่นเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTGF1Y8',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y8'
  },
  {
    'code': 'KTFFE84',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์84 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTSRI-RMF',
    'name_th': 'กองทุนเปิดกรุงไทยศรีสิริเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTMEE-RMF',
    'name_th': 'กองทุนเปิดกรุงไทยมีทรัพย์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTMUNG-RMF',
    'name_th': 'กองทุนเปิดกรุงไทยมั่งคั่งเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KTSUK-RMF',
    'name_th': 'กองทุนเปิดกรุงไทยสุขใจเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBCR1YH',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YH ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TMB-ES-GINNO',
    'name_th': 'กองทุนเปิดทีเอ็มบี อีสท์สปริง Global Innovation'
  },
  {
    'code': 'SCBLT1-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวปันผล 70/30 (ชนิดปี 2020)'
  },
  {
    'code': 'SCBLT2-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว พลัส (ชนิดปี 2020)'
  },
  {
    'code': 'SCBLT3-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว (ชนิดปี 2020)'
  },
  {
    'code': 'SCBLT4-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวอินเตอร์ (ชนิดปี 2020)'
  },
  {
    'code': 'SCBLTT-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาวทาร์เก็ต (ชนิดปี 2020)'
  },
  {
    'code': 'SCBLTSEA-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว ซีเล็คท์ (ชนิดสะสมมูลค่า ปี 2020)'
  },
  {
    'code': 'SCBLTSED-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว ซีเล็คท์ (ชนิดจ่ายเงินปันผล ปี 2020)'
  },
  {
    'code': 'SCBLTSETA-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว เซ็ท อินเด็กซ์ (ชนิดสะสมมูลค่า ปี 2020)'
  },
  {
    'code': 'SCBLTSETD-2020',
    'name_th': 'กองทุนเปิดไทยพาณิชย์หุ้นระยะยาว เซ็ท อินเด็กซ์ (ชนิดจ่ายเงินปันผล ปี 2020)'
  },
  {
    'code': 'KFF6MAJ-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAJ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAI-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAI ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAH-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAH ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAG-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAG ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KEC3-AI',
    'name_th': 'กองทุนเปิดเค เอ็นแฮนซท์ เครดิต 3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFCORE',
    'name_th': 'กองทุนเปิดกรุงศรีโกลบอลคอร์อโลเคชั่น'
  },
  {
    'code': 'LHESPORT-A',
    'name_th': 'กองทุนเปิด แอล เอช อีสปอร์ต ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHESPORT-D',
    'name_th': 'กองทุนเปิด แอล เอช อีสปอร์ต ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHESPORT-E',
    'name_th': 'กองทุนเปิด แอล เอช อีสปอร์ต ชนิดช่องทางอิเล็กทรอนกิส์'
  },
  {
    'code': 'MGTECH',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เน็กซ์ เจนเนอเรชั่น เทคโนโลยี'
  },
  {
    'code': 'KKP TECH-H-F',
    'name_th': 'กองทุนเปิดเคเคพี EXPANDED TECH - HEDGED ชนิด F'
  },
  {
    'code': 'SCBASF6MG5',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ASP-TFIXED 6M7',
    'name_th': 'กองทุนเปิดแอสเซทพลัสตราสารหนี้ทวีทรัพย์ 6เดือน7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'T-ES-GINNO',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Innovation'
  },
  {
    'code': 'UOBSHC-SSF',
    'name_th': 'กองทุนเปิด ยูโอบี สมาร์ท โกลบอล เฮลท์แคร์ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'UNI-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินโนเวชั่น ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'UGH-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล เฮลท์แคร์ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'TSF-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ สแตรทิจิก ฟันด์ ชนิดหน่วยลงทุนเพื่อการออม'
  },
  {
    'code': 'TISCOMS-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ Mid/Small Cap อิควิตี้ ชนิดหน่วยลงทุนเพื่อการออม'
  },
  {
    'code': 'TISCOCHA-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า A-Shares อิควิตี้ ชนิดหน่วยลงทุนเพื่อการออม'
  },
  {
    'code': 'T-ES-ChinaA-SSF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง China A เพื่อการออม'
  },
  {
    'code': 'T-ES-ChinaA-RMF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง China A เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'T-ES-GCG-SSF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Capital Growth เพื่อการออม'
  },
  {
    'code': 'T-ES-GTech-SSF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Technology เพื่อการออม'
  },
  {
    'code': 'LHAI14M1',
    'name_th': 'กองทุนเปิด แอล เอช ตราสารหนี้ เอไอ 14M1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'WE-PLAY',
    'name_th': 'กองทุนเปิด วี วีดิโอ เกมมิ่ง แอนด์ อีสปอร์ต'
  },
  {
    'code': 'TCHTECH-SSF',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า เทคโนโลยี อิควิตี้ ชนิดเพื่อการออม'
  },
  {
    'code': 'ASP-DGOV-I',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เดลี่ พันธบัตรไทย ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'B-CHINAARMF',
    'name_th': 'กองทุนเปิดบัวหลวงหุ้นจีนเอแชร์เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBASF6MG6',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG6 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBCR1YI',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YI ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFFAI6M46',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M46 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'UPINCM-N',
    'name_th': 'กองทุนเปิด ยูไนเต็ด แพลตินัม อินคัม ออพพอร์ทูนิตี้ส์ พลัส ฟันด์ ชนิดรับชื้อคืนหน่วยลงทุนแบบปกติ'
  },
  {
    'code': 'KCHANGERMF',
    'name_th': 'กองทุนเปิดเค พอสซิทีฟ เชนจ์ หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BP8/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 8/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TNEXTGEN',
    'name_th': 'กองทุนเปิด ทิสโก้ Next Generation Internet'
  },
  {
    'code': 'SCBASF6MG7',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFFAI6M47',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M47 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'USUS',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ซัสเทนเนเบิล อิควิตี้ โซลูชั่น ฟันด์'
  },
  {
    'code': 'KTGF1Y9',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y9'
  },
  {
    'code': 'UCI',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ไชน่า เอ แชร์ อินโนเวชั่น ฟันด์'
  },
  {
    'code': 'ONE-LS-UI',
    'name_th': 'กองทุนเปิด วรรณ ไลฟ์ เซทเทิลเมนท์ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KKP SM CAP-F',
    'name_th': 'กองทุนเปิดเคเคพี SMALL AND MID CAP EQUITY ชนิด F'
  },
  {
    'code': 'KKP SET50 ESG-F',
    'name_th': 'กองทุนเปิดเคเคพี SET50 ESG ชนิด F'
  },
  {
    'code': 'KKP ACT EQ-F',
    'name_th': 'กองทุนเปิดเคเคพี แอ็กทิฟ อิควิตี้ ชนิด F'
  },
  {
    'code': 'SCBASF6MG8',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG8 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KKP GOLD-F',
    'name_th': 'กองทุนเปิดเคเคพี โกลด์ ชนิด F'
  },
  {
    'code': 'KKP GINFRAEQ-H-F',
    'name_th': 'กองทุนเปิดเคเคพี โกลบอล อินฟราสตรัคเจอร์ อิควิตี้ เฮดจ์ ชนิด F'
  },
  {
    'code': 'SCBCR1YJ',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YJ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TMB-T-ES-APlus',
    'name_th': 'กองทุนเปิดทีเอ็มบี ธนชาต อีสท์สปริง Active Bond Plus'
  },
  {
    'code': 'KTFFE85',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์85 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTGF1Y10',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y10'
  },
  {
    'code': 'MT2Y',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี 2 ปี ทวีสุข'
  },
  {
    'code': 'SCBEAI1YA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ เอ็นแฮนซท์ เอไอ 1YA ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE86',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์86 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KEC4-AI',
    'name_th': 'กองทุนเปิดเค เอ็นแฮนซท์ เครดิต 4 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF21F',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021F'
  },
  {
    'code': 'KFF21G',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021G'
  },
  {
    'code': 'KFF6MAK-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAK ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAL-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAL ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAM-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAM ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'PRINCIPAL iGOLD-E',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลด์ อินคัม E'
  },
  {
    'code': 'KFF6MAN-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAN ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'SCBASF6MG9',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MG9 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF21H',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021H'
  },
  {
    'code': 'KFF21I',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021I'
  },
  {
    'code': 'KFFAI6M48',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M48 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'SCBGEESGA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Global Sustainable Equity ชนิดสะสมมูลค่า'
  },
  {
    'code': 'T-ES-GGREEN',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Green Energy'
  },
  {
    'code': 'AIA-GCA',
    'name_th': 'กองทุนเปิด เอไอเอ โกลบอล คอนเวนชั่นนอล อโลเคชั่น ฟันด์'
  },
  {
    'code': 'AIA-GMA',
    'name_th': 'กองทุนเปิด เอไอเอ โกลบอล โมเดอเรท อโลเคชั่น ฟันด์'
  },
  {
    'code': 'AIA-GAA',
    'name_th': 'กองทุนเปิด เอไอเอ โกลบอล แอกเกรสซีฟ อโลเคชั่น ฟันด์'
  },
  {
    'code': 'BP9/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 9/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TCHARMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า A-Shares อิควิตี้ เพื่อการเลี้ยงชีพ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'KFFAI6M49',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M49 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'PRINCIPAL GOPP-SSF',
    'name_th': 'กองทุนเปิดพรินซิเพิล โกลบอล ออพพอร์ทูนิตี้ ชนิดเพื่อการออม'
  },
  {
    'code': 'TCHARMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า A-Shares อิควิตี้ เพื่อการเลี้ยงชีพ ชนิดรองรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'KCHINARMF',
    'name_th': 'กองทุนเปิดเค ไชน่า หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KUSARMF',
    'name_th': 'กองทุนเปิดเค ยูเอสเอ หุ้นทุนเพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TGHRM-P',
    'name_th': 'กองทุนเปิด ทิสโก้ โกลบอล เฮลธ์แคร์ เพื่อการเลี้ยงชีพ ชนิดรองรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'WE-GLOBALEQRMF',
    'name_th': 'กองทุนเปิด วี โกลบอล อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'BCAP-CTECH',
    'name_th': 'กองทุนเปิดบีแคป ไชน่า เทคโนโลยี'
  },
  {
    'code': 'SCBASF6MH1',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'UCHINA-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด ออล ไชน่า อิควิตี้ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'UDB-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล ไดนามิค บอนด์ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'UGIS-SSF',
    'name_th': 'กองทุนเปิด ยูไนเต็ด โกลบอล อินคัม สตราทีจิค บอนด์ ฟันด์ ชนิดเพื่อการออม'
  },
  {
    'code': 'LHGDYNAMIC-A',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไดนามิกส์ มัลติ แอสเซ็ท ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHGDYNAMIC-D',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไดนามิกส์ มัลติ แอสเซ็ท ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHGDYNAMIC-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล ไดนามิกส์ มัลติ แอสเซ็ท ชนิดช่องทางอิเล็กทรอนกิส์'
  },
  {
    'code': 'MCHINAGA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไชน่า อิควิต ชนิดผู้ลงทุนทั่วไปที่ไม่รับเงินปันผล'
  },
  {
    'code': 'MCHINASSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไชน่า อิควิต ชนิดเพื่อการออม'
  },
  {
    'code': 'MPDIVPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี พร็อพเพอร์ตี้ ดิวิเดนด์ ฟันด์ ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBCR1YL',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YL ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHMM-L',
    'name_th': 'กองทุนเปิด แอล เอช ตลาดเงิน ชนิดผู้ถือหน่วยลงทุนกองทุนภายใต้การบริหารจัดการ'
  },
  {
    'code': '1AM-DAILY-SSF',
    'name_th': 'กองทุนเปิดวรรณเดลี่ หน่วยลงทุนชนิดเพื่อการออม'
  },
  {
    'code': 'MGFSSF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส ชนิดเพื่อการออม'
  },
  {
    'code': 'MGFGA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส ชนิดผู้ลงทุนทั่วไปที่ไม่รับเงินปันผล'
  },
  {
    'code': 'ONE-DISC-ASSF',
    'name_th': 'กองทุนเปิด วรรณ ดิสคัฟเวอรี่ หน่วยลงทุนชนิดเพื่อการออม แบบไม่จ่ายเงินปันผล'
  },
  {
    'code': 'SCBASF6MH2',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TRIGGER6-21',
    'name_th': 'กองทุนเปิดบัวหลวงทริกเกอร์ 6-21'
  },
  {
    'code': 'KTFFE87',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์87 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KTFFE88',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์88 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'MCHINAIA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไชน่า อิควิตี้ ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'MCHINAPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไชน่า อิควิตี้ ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'MGFIA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'MGFPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'MIDSMALLMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี มิด สมอล แค็ป หุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'HIDIVMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ หุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'MGMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีโกลบอลหุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'MAMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซีเพิ่มทรัพย์หุ้นระยะยาว ชนิดเพื่อการลงทุน'
  },
  {
    'code': 'KT-Ashares RMF',
    'name_th': 'กองทุนเปิดเคแทม ไชน่า เอแชร์ อิควิตี้ เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'HIDIVPLUSPVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี ไฮ-ดิวิเดนด์ พลัส ฟันด์ ชนิดกองทุนสํารองเลี้ยงชีพ'
  },
  {
    'code': 'ONE-GLOBALTOP8M7',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ท็อป 8M7'
  },
  {
    'code': 'KTGF1Y11',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y11'
  },
  {
    'code': 'BP10/20 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 10/20 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'MGFRMF',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี โกลบอล โฟกัส เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'SCBASF6MH3',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH3 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'T-ES-NF-SSF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง ตราสารหนี้เพื่อการออ'
  },
  {
    'code': 'KTGF1Y12',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y12'
  },
  {
    'code': 'T-ES-GCG-RMF',
    'name_th': 'กองทุนเปิดธนชาต อีสท์สปริง Global Capital Growth เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'TCHTECHRMF-A',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า เทคโนโลยี เพื่อการเลี้ยงชีพ ชนิดผู้ลงทุนทั่วไป'
  },
  {
    'code': 'SCBCR1YM',
    'name_th': 'กองทุนเปิดไทยพาณิชย์คอมเพล็กซ์รีเทิร์น 1YM ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TCHTECHRMF-P',
    'name_th': 'กองทุนเปิด ทิสโก้ ไชน่า เทคโนโลยี เพื่อการเลี้ยงชีพ ชนิดรองรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBMLCAA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Machine Learning China All Share (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'SCBASF6MH4',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH4 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFACHINRMF',
    'name_th': 'กองทุนเปิดกรุงศรีไชน่าเอแชร์อิควิตี้เพื่อการเลี้ยงชีพ'
  },
  {
    'code': 'KFACHINSSF',
    'name_th': 'กองทุนเปิดกรุงศรีไชน่าเอแชร์อิควิตี้เพื่อการออม'
  },
  {
    'code': 'KFF6MAO-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAO ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAP-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAP ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAQ-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAQ ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF21K',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021K'
  },
  {
    'code': 'KFF21J',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2021J'
  },
  {
    'code': 'WE-CRETURN6M2-UI',
    'name_th': 'กองทุนเปิด วี คอมเพล็กซ์ รีเทิร์น 6M2 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ASP-TRIGGER 6M2',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ทริกเกอร์ 6เดือน2'
  },
  {
    'code': 'SCBASF6MH5',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH5 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'BP1/21 (AI)',
    'name_th': 'กองทุนรวมบัวหลวงธนสารพลัส 1/21 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'TGENOME',
    'name_th': 'กองทุนเปิด ทิสโก้ Genomic Revolution'
  },
  {
    'code': 'MATECH-IA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เอเชีย เทคโนโลยี ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'MATECH-PVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เอเชีย เทคโนโลยี ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'MATECH-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี เอเชีย เทคโนโลยี ชนิดผู้ลงทุนทั่วไปที่ไม่รับเงินปันผล'
  },
  {
    'code': 'MRENEW-IA',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี รีนิวเอเบิล เอนเนอร์จ ชนิดผู้ลงทุนสถาบัน'
  },
  {
    'code': 'MRENEW-PVD',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี รีนิวเอเบิล เอนเนอร์จ ชนิดกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'MRENEW-A',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี รีนิวเอเบิล เอนเนอร์จ ชนิดผู้ลงทุนทั่วไปที่ไม่รับเงินปันผล'
  },
  {
    'code': 'KTFFE89',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์89 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KT-TMT2',
    'name_th': 'กองทุนเปิดเคแทม ธีมเมติก ทริกเกอร์ ฟันด์2'
  },
  {
    'code': 'SCBASF6MH6',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH6 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFFAI6M50',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M50 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'SCBUSAA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ หุ้นยูเอส แอคทีฟ ชนิดสะสมมูลค่า'
  },
  {
    'code': 'KTGF1Y13',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y13'
  },
  {
    'code': 'ONE-GLOBALTOP8M8',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ท็อป 8M8'
  },
  {
    'code': 'LHINNO-A',
    'name_th': 'กองทุนเปิด แอล เอช อินโนเวชั่น ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHINNO-D',
    'name_th': 'กองทุนเปิด แอล เอช อินโนเวชั่น ชนิดจ่ายเงินปันผล'
  },
  {
    'code': 'LHINNO-E',
    'name_th': 'กองทุนเปิด แอล เอช อินโนเวชั่น ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'KTGF1Y14',
    'name_th': 'กองทุนเปิดกรุงไทย โกลบอล ฟิกซ์ อินคัม 1Y14'
  },
  {
    'code': 'M-EM',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี อีเมอร์จิ้ง มาร์เก็ต'
  },
  {
    'code': 'KFFAI6M51',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M51 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'USGE-PVD',
    'name_th': 'กองทุนเปิด ยูไนเต็ด สมาร์ท โกลบอล อิควิตี้ ฟันด์ สำหรับกองทุนสำรองเลี้ยงชีพ'
  },
  {
    'code': 'SCBASF6MH7',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH7 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'ONE-GLOBALTOP8M9',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ท็อป 8M9'
  },
  {
    'code': 'SCBAAA',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ Active Allocation (ชนิดสะสมมูลค่า)'
  },
  {
    'code': 'KTFFE90',
    'name_th': 'กองทุนเปิดกรุงไทยตราสารหนี้ เอฟไอเอฟ เอ็นแฮนซท์90 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'MT2Y2',
    'name_th': 'กองทุนเปิดเอ็มเอฟซี 2 ปี ทวีสุข 2'
  },
  {
    'code': 'KFF6MAS-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAS ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'KFF6MAR-AI',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ6MAR ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'I-TEP 3',
    'name_th': 'กองทุนเปิดอินโนเทค ทริกเกอร์ ฟันด์ อีพี 3'
  },
  {
    'code': 'ASP-EUG',
    'name_th': 'กองทุนเปิด แอสเซทพลัส ยุโรป โกรท'
  },
  {
    'code': 'ASP-JHC',
    'name_th': 'กองทุนเปิด แอสเซทพลัส เจแปน ไฮ คอนวิคชั่น'
  },
  {
    'code': 'WE-CYBER',
    'name_th': 'กองทุนเปิด วี เน็กซ์ เจเนอเรชั่น อินเทอร์เน็ต'
  },
  {
    'code': 'KFF22B',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2022B'
  },
  {
    'code': 'KFF22A',
    'name_th': 'กองทุนเปิดเค ตราสารหนี้ต่างประเทศ 2022A'
  },
  {
    'code': 'LHGROWTH-E',
    'name_th': 'กองทุนเปิด แอล เอช โกรท ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHEQD-E',
    'name_th': 'กองทุนเปิด แอล เอช หุ้นปันผล ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'KFFAI6M52',
    'name_th': 'กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M52 - ห้ามขายผู้ลงทุนรายย่อย (AI)'
  },
  {
    'code': 'SCBASF6MH8',
    'name_th': 'กองทุนเปิดไทยพาณิชย์ตราสารหนี้ต่างประเทศ เอเอส 6MH8 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'LHINDIAE-A',
    'name_th': 'กองทุนเปิด แอล เอช อินเดีย-E ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHINDIAE-E',
    'name_th': 'กองทุนเปิด แอล เอช อินเดีย-E ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHEME-A',
    'name_th': 'กองทุนเปิด แอล เอช อีเมอร์จิ้ง มาร์เก็ต-E ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHEME-E',
    'name_th': 'กองทุนเปิด แอล เอช อีเมอร์จิ้ง มาร์เก็ต-E ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHJAPE-A',
    'name_th': 'กองทุนเปิด แอล เอช เจแปน - E ชนิดสะสมมูลค่า'
  },
  {
    'code': 'LHJAPE-E',
    'name_th': 'กองทุนเปิด แอล เอช เจแปน - E ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'LHGINCOME-E',
    'name_th': 'กองทุนเปิด แอล เอช โกลบอล อินคัม ชนิดช่องทางอิเล็กทรอนิกส์'
  },
  {
    'code': 'KTEFIX1Y1-UI',
    'name_th': 'กองทุนเปิดเคแทม เอ็นแฮนซท์ ตราสารหนี้ 1 ปี 1 ห้ามขายผู้ลงทุนรายย่อย'
  },
  {
    'code': 'K-GPROP-A(A)',
    'name_th': 'กองทุนเปิดเค โกลบอล พร็อพเพอร์ตี้ หุ้นทุน-A ชนิดสะสมมูลค่า'
  },
  {
    'code': 'ONE-GLOBALTOP8M10',
    'name_th': 'กองทุนเปิด วรรณ โกลบอล ท็อป 8M10'
  },
  {
    'code': 'TDEX',
    'name_th': 'กองทุนเปิดไทยเด็กซ์เซ็ท 50 อีทีเอฟ'
  }
]
